[
  {
    "website": "https://njit.campuslabs.com/engage/organization/splash",
    "name": "Splash",
    "ShortName": "Splash",
    "Summary": "Splash is an organization that hosts an annual event, also called Splash, where high schoolers can attend classes taught by college students. ",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/bcf",
    "name": "BAPS Campus Fellowship",
    "ShortName": "BCF",
    "Summary": "The purpose of BAPS Campus Fellowship is to unite NJIT students and provide opportunities to learn about Hindu heritage and culture.",
    "Description": "<p>BAPS Campus Fellowship strives to better society through individual development by instilling values, promoting spirituality, cultivating skills, and nurturing growth. We aim to preserve Indian culture and the Hindu ideals of faith, unity, and service. <font style=\"background-color: #ffffff;\">We accomplish our mission by planning youth group discussions, campus events, and community service projects.</font></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/6b128585-8b91-4f28-aa20-e10e1231354218c46cbe-f6c8-4a7e-9ae6-3402246cb304.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/liftingclub",
    "name": "Weightlifting Club",
    "ShortName": "Lifting Club",
    "Summary": "To improve the overall health/fitness of the NJIT community through group weight\r\ntraining and nutritional advice as well as to encourage the NJIT community in accomplishing\r\ntheir health and fitness goals.",
    "Description": "<p>We&rsquo;re here to build a community and improve the overall health/fitness of the NJIT community through group meetings and events!<br />We aim to offer training and nutritional advice. The club also aims to encourage the NJIT community to accomplish their health and fitness goals, all the while promoting a welcoming gym culture for beginner and experienced lifters alike.&nbsp;</p>\r\n<p>-------------------------------------------</p>\r\n<p><a href=\"https://discord.gg/GVfd8FYpxH\">Join our club Discord!</a></p>\r\n<p><a href=\"https://www.instagram.com/njitweightlifting/?hl=en\">Instagram</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a32c3781-60b6-463a-91b3-21ec472863932b2d6731-f220-4fc3-b217-ca8e01fb0371.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/dsc-njit",
    "name": "Google Developer Student Club",
    "ShortName": "GDSC",
    "Summary": "We are a Google sponsored organization that develops software projects with partners and hosts networking events to provide students with the resources, connections, and projects to better their industry knowledge. All majors are welcome!",
    "Description": "<p>Google Student Developer Clubs is a partnership with Google to promote technical skills for anyone interested, regardless of major. Club meetings primarily revolve around group project, which will be submitted for a competition at the end of the school year. Related activities will include various workshops, study jams, and private events. Google will be providing access to a variety of teams from New York for consultation and training demo's. With so much to offer, join our Discord server to stay updated with out latest activities!</p>\r\n<p>Discord: <a href=\"https://njit.campuslabs.com/engage/actioncenter/organization/dsc-njit/discord.gg/TgpAePMkpa\" target=\"_blank\" rel=\"noopener\">discord.gg/TgpAePMkpa</a></p>\r\n<p>Instagram:&nbsp;<a href=\"https://www.instagram.com/gdsc_njit/\" target=\"_blank\" rel=\"noopener\">https://www.instagram.com/gdsc_njit/</a></p>\r\n<p>LinkedIn:&nbsp;<a href=\"https://www.linkedin.com/company/gdscnjit/\" target=\"_blank\" rel=\"noopener\">https://www.linkedin.com/company/gdscnjit/</a></p>\r\n<p>Website:&nbsp;<a href=\"https://gdsc.community.dev/new-jersey-institute-of-technology/\" target=\"_blank\" rel=\"noopener\">https://gdsc.community.dev/new-jersey-institute-of-technology/&nbsp;</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/07558f49-aa8f-4063-8d4a-86fd33f526c2b4b72c91-66f3-40ff-b62c-5e799fb55978.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ivcf",
    "name": "InterVarsity Christian Fellowship",
    "ShortName": "IVCF",
    "Summary": "InterVarsity Christian Fellowship is a community of believers that wants every student on campus to know that they are loved by God by welcoming them in to caring, diverse communities where they can build friendships and explore Christian faith.",
    "Description": "<p>The vision of InterVarsity Christian Fellowship is to see students and faculty transformed, campuses renewed, and world changers developed. We welcome students into caring, diverse communities, where they can build friendships and explore Christian faith in the marketplace of ideas. We long to establish and advance witnessing communities of students and faculty who follow Jesus as Savior and Lord: growing in love for God, God's Word, God's people of every ethnicity and culture, and God's purposes in the world.</p>\r\n<p>&nbsp;</p>\r\n<p>Advisor: Matthew Blanar</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/8d0f4d23-f5cc-4df4-9fbf-f86379b1e30f7b4456ee-5549-44ca-a36c-b45158c9e05e.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/grss",
    "name": "Geoscience and Remote Sensing Society",
    "ShortName": "GRSS",
    "Summary": "The Geoscience and Remote Sensing Society (GRSS) is a technical Society of the Institute of Electrical and Electronics Engineers (IEEE). GRSS fosters engagement of its members for the benefit of society through science, engineering, and education.",
    "Description": "<div class=\"elementor-element elementor-element-e4117c1 elementor-widget elementor-widget-text-editor\" data-id=\"e4117c1\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\r\n<div class=\"elementor-widget-container\">\r\n<div class=\"elementor-text-editor elementor-clearfix\">\r\n<p class=\"p1\">The fields of interest of GRSS span science and engineering, and include theory, concepts, and techniques of remote sensing of the Earth, oceans, atmosphere, and space, as well as the processing, interpretation, and dissemination of this information:</p>\r\n<ul>\r\n<li class=\"p1\">Remote Sensing of Land and Surface Processes</li>\r\n<li class=\"p1\">Remote Sensing of the Atmosphere and Oceans</li>\r\n<li class=\"p1\">Remote Sensing of the Cryosphere</li>\r\n<li class=\"p1\">Remote Sensing of Solid Earth and Geodynamic Processes</li>\r\n<li class=\"p1\">Remote Sensing and Mitigation of Natural Disasters</li>\r\n<li class=\"p1\">Remote Sensing Data Processing Techniques</li>\r\n<li class=\"p1\">Electromagnetics and Radiative Transfer</li>\r\n<li class=\"p1\">Sensors, Platforms, and Instruments for Remote Sensing</li>\r\n<li class=\"p1\">Education, Standards and Policy</li>\r\n</ul>\r\n</div>\r\n</div>\r\n</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/87229253-6dc5-4a6e-a1c8-39e213a33f10e51772a7-5c7e-4713-ab84-32da6a6ec5e8.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/chess",
    "name": "Highlander Chess Club",
    "ShortName": "Highlander Chess Club",
    "Summary": "We play chess! \r\nFides et ratio",
    "Description": "<p>Chess club is where people of all different chess skill levels come together and play against one another in the ancient game. The club will bring people together and be informational towards students about how the game is played and different strategies<br /><br />Join the discord here: https://discord.gg/Jw7bsharZU</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4d328814-2e77-4f19-9a02-eb7c0b816cbbeb244e3f-93de-48c1-882c-b00a0fdb8f12.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/honorshallcouncil",
    "name": "Honors Hall Council",
    "ShortName": "Honors Hall Council",
    "Summary": "The governing body for the residents living in John Martinson Honors Residence Hall",
    "Description": "<p>The governing body for the residents living in the John Martinson Honors Residence Hall.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ddf5df78-04a3-4550-a42f-8634a0c1cffb46370057-c247-4574-bb5c-1281e5762e5e.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gem",
    "name": "Genetically Engineered Machines",
    "ShortName": "GEM",
    "Summary": "Genetically Engineered Machines",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/emscso",
    "name": "NJIT First Aid Squad",
    "ShortName": "NJIT FAS",
    "Summary": "NJIT FAS program is designed to protect and serve the community of NJIT by proving Emergency Medical Services and Community Service Student Officers working with NJIT Public Safety.",
    "Description": "<p>NJIT EMS are student Emergency Medical Technicians certified through the State of New Jersey through a&nbsp;rigorous 240 hour class in which students are able to provide&nbsp;care to the those on and surroundings areas of the NJIT Campus. Students work directly with NJIT Public Safety and University Hospital ensuring the highest level of care is provided to the community.&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>NJIT CSOs are student Community Service Officers designed to work with NJIT Public Safety providing additional level of safety and protection for the community. CSO's assist with student EMTs as well as participate in Community Policing.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0a01aa10-6999-47e5-bd38-1331ea8b81c94bb36edd-7663-42eb-8e1a-1c4ef902faf2.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/shla",
    "name": "Society of Hispanic and Latine Appreciation",
    "ShortName": "SHLA",
    "Summary": "Society of Hispanic and Latine Appreciation",
    "Description": "<p><strong>Hola a Todos!</strong><br /><br />We are the <strong>Society of Hispanic and Latine Appreciation</strong>!<br />Our organization mainly aims to appreciate our <strong>culture</strong> and <strong> history</strong> through events, meetings, and tablings! We welcome any NJIT student to come by and appreciate our culture with us! &lt;3<br /><br /></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c0241956-e4b2-4649-9d71-1ebd2469fcbcf39e9cf2-61ef-4026-95fa-24b55658c4bc.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitesports",
    "name": "Esports",
    "ShortName": "Esports",
    "Summary": "The heart of gaming at NJIT. Our pillars are Events, Competition, and Careers. We support casual play and events, open to all students alongside managing collegiate esports teams that are skill based and compete against other colleges.",
    "Description": "<p>Events: NJIT Esports hosts a variety of recurring events across 14+ games, including but not limited to Smash tournaments, LAN events, and casual bi-weekly game nights!&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Competition: We currently support 8 Division 1 teams and 5+ Division 2 teams. These teams are skill based and compete against other colleges for scholarship money. Tryouts happen during September of each new year, with certain special cases that may arise.</p>\r\n<p>&nbsp;</p>\r\n<p>Careers: As many tech companies are invested in esports, participating in collegiate esports whether on the competitive or management sides gets students connected with many big names in the industry such as Corsair, Nvidia, Microsoft, Logitech, etc. These companies have initiatives that directly work with collegiate esports organizations and often times recruit within esports spaces. At NJIT Esports, we work hard to connect members to the large network we have available to us. Computer/ Mechanical/ Electrical engineers find advantages with peripheral companies while Computer Science and IT majors (specifically with Game Dev specializations) can connect to developer jobs and game development jobs with ease as companies such as Blizzard and Riot love recruiting esports students.<br /><br />Join our Discord:<a href=\"http://discord.gg/njit\" target=\"_blank\" rel=\"noopener\">http://discord.gg/njit</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/eb850fa0-665a-4aef-8aac-d759f696d5122279a0ad-3aac-4f9b-9be0-d133ae7336d9.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/opa",
    "name": "Office of Prevention and Advocacy",
    "ShortName": "OPA",
    "Summary": "The Office of Prevention and Advocacy is committed to the eradication of dating and sexual violence by providing confidential support, educational programming, and centering survivor autonomy at NJIT. ",
    "Description": "<p><span style=\"font-weight: 400;\">The Office of Prevention and Advocacy is committed to the eradication of dating and sexual violence by providing confidential support, educational programming, and centering survivor autonomy at NJIT. The office promotes awareness on dating violence, sexual assault, stalking, and other forms of interpersonal violence as well as campus and local resources. Our programs aim not only to educate the NJIT community on these topics, but also to emphasize our shared responsibility in speaking out, modeling consent and safety, as well as uplift all community members. </span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e3f11870-32b9-42ee-959d-7441d82f619048ac1739-0b70-4b84-8fd0-82d94db68373.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/vhl",
    "name": "Robert W. Van Houten Library",
    "ShortName": null,
    "Summary": "The Robert W. Van Houten Library, NJIT’s university library, houses a core collection of print books, group study rooms, and has an Information Commons computer lab with more than 100+ computer workstations and wireless access throughout the building.",
    "Description": "<p><strong>The Robert W. Van Houten Library offers:</strong></p>\r\n<p><strong>-Over 200,000 <a href=\"https://primo.njit.edu/discovery/search?vid=01NJIT_INST:NJIT&amp;lang=en&amp;mode=simple\"> print books</a>, <a href=\"https://primo.njit.edu/discovery/search?tab=CourseReserves&amp;search_scope=MyInstitution&amp;vid=01NJIT_INST:NJIT&amp;lang=en\"> Course Reserves</a>, 34&nbsp;<a href=\"https://library.njit.edu/journals\">Full Text Journals</a>, 100+&nbsp;<a href=\"https://researchguides.njit.edu/az.php\">Databases</a>, and 168,000&nbsp;<a href=\"https://researchguides.njit.edu/ebooks\">E-books</a>.&nbsp;</strong></p>\r\n<p><strong>-<a href=\"https://njit.libcal.com/spaces?lid=10358\">14 group study rooms</a>&nbsp;</strong></p>\r\n<p><strong>-An <a href=\"https://ist.njit.edu/computing-labs-njit\">Information Commons</a> with more than 100 computers</strong></p>\r\n<p><strong>-A variety of lounge seating and study areas.</strong></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Research and Instruction Librarians are available to meet with you for <a href=\"https://njit.libcal.com/appointments/one-on-one\" target=\"_blank\" rel=\"noopener\"> individual appointments</a>.&nbsp;</strong></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/d068ee09-121b-4e8b-8d2c-ae437566d8d7dd3dc9c5-888f-4c3c-82da-b2d8d15181b0.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cs",
    "name": "Coptic Society",
    "ShortName": "CS",
    "Summary": "Coptic Society is an organization which looks to center itself on Christ and hopes to support the surrounding community by embodying the spirit of the Church on campus.",
    "Description": "<p>Coptic Society is an organization that offers students a spiritual supplement to the secularity of academia. It is an organization which looks to center itself on Christ and hopes to support the surrounding community by embodying the spirit of the Church on campus. Members are encouraged to integrate their beliefs as Christians into their lives as students by promoting tolerance and fellowship. Members are also encouraged to become persons of consequence and active members of the Rutgers/NJIT-Newark community.&nbsp;This organization is neither restricted to a singular race nor particular religion.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2e882469-436e-49ba-8941-376a94f14227338e9cf6-bf53-4109-be01-cd173692d268.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ultimate",
    "name": "Ultimate Frisbee",
    "ShortName": "NJITU/ Highlander Ultimate",
    "Summary": "NJIT Ultimate is a club sanctioned sport at New Jersey Institute of technology that welcomes all skill levels and participates in local and state tournaments.",
    "Description": "<p>In the Ultimate Frisbee Organization, we strongly believe that teamwork, and learning from failure is the key to success. Often times these values are overlooked in various academic settings. At NJIT Ultimate we place high value in cooperation before competition. Because we know that one may travel far only if they have the support and the help of his friends.</p>\r\n<p>We offer a recreational and competitive approach. However, most practice settings are geared towards competing at tournaments and reaching Nationals. If you have any questions or concerns, do not hesitate to email our coach, Jason Pon at&nbsp; jpon111@gmail.com or the Organization President, Curtis Asral at cca3@njit.edu</p>\r\n<p>We are most active on our Discord, so please join! https://discord.gg/uBwuvf2M36</p>\r\n<p><br />Last Updated: 08/02/2023</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/1a9f39dc-fe54-4489-b383-194ec95d73b8e8a0b016-73b0-4cc1-bde6-310635a51465.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nsc",
    "name": "New Jersey Institute of Technology Soccer Club",
    "ShortName": "NSC",
    "Summary": "NSC connects highlanders interested in soccer through events, competitions, trainings, and more to foster friendships and the love of soccer amongst them.\r\nOur inaugral semester has events like charity match, screenings, pickup games, inter college match",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/52a9e23a-363b-4a65-bb74-da8add13eae301b0f1fb-5ee0-401d-b491-4a8360c55382.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitttc",
    "name": "Table Tennis Club",
    "ShortName": "NJITTTC",
    "Summary": "The Highlander Table Tennis club aims at making the sport more accessible to the student body, with the purpose of connecting beginners and enthusiasts alike interested in the sport, together, for both recreational and competitive play.",
    "Description": "<p>NJIT Table Tennis Club welcomes players of&nbsp;<strong>ALL levels</strong>&nbsp;to come and play! It is a great opportunity to meet new people and improve your game at the same time! No experience is required, anyone who is interested in the sport is invited to come and have fun. We will also be sponsoring and supporting interested advanced players to compete at the collegiate levels.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/779fa17c-d556-41a3-a636-30e98556a5085c093955-b1ea-4233-87a7-270f1f388498.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/stementors",
    "name": "STEMentors Club",
    "ShortName": "STEMentors",
    "Summary": "A club for NJIT and other local college students interested in mentoring K-12 students, organizing academic competitions, and promoting STEM education.  This club is supported by the Center for Pre-College Programs.",
    "Description": "<p>A club for NJIT and other local college students interested in mentoring K-12 students, organizing academic competitions, and promoting STEM education. This club is supported by the Center for Pre-College Programs and was established in Fall 2019.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/6c6cd941-49a5-4356-b168-e7aed8370987b35b38c0-1ea8-4a92-a4e2-ba5d5eb9443a.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hlolc",
    "name": "Highlander League of Legends Club",
    "ShortName": "HLOLC",
    "Summary": "The Club allows players to come together and socialize about the game that they care about and love whether it being playing competitively or playing the game casually making friends",
    "Description": "<p>League of Legends has become one of the world's most popular team-based games, having roughly 115 MILLION players.<br /><br /></p>\r\n<p>We, as the <strong>Highlanders League of Legends Club</strong>, strive to create a welcoming, fun-filled community that brings all NJIT students involved with League of Legends!<br /><br /><span style=\"text-decoration: underline;\"><strong>Meetings:<br /></strong></span></p>\r\n<p>General Body Meetings are held (bi-weekly) on Wednesdays at 2:30 PM in collaboration with the NJIT Esports organization. Here, we discuss dates and details for future events as well as take suggestions from the club members.<br /><span style=\"text-decoration: underline;\"><strong><br />Competitive:<br /></strong></span></p>\r\n<p>Want to take your skills to the next level?<br /><br /><strong>Highlanders League of Legends Club</strong> consists of events and teams for both <strong>casual and competitive play</strong>. A player at any rank will be able to find a team suited for their skill level.<br /><br />Our <strong>Division 1</strong> and <strong>Division 2</strong> teams represent NJIT's League of Legends club by facing off against other colleges. All teams are given various opportunities to face off against other teams and participate in tournaments.<br /><br /><span style=\"text-decoration: underline;\"><strong>Events:</strong></span></p>\r\n<p>From the weekly in-houses to the custom team tournaments, every semester has a plethora of both <strong>casual and competitive events</strong> to appeal to all types of players in the League of Legends community.<br /><br />While some events are for the teams, there are plenty of game nights and other large-scale events available to all members of the club. To create a simulation of the League Championships, we stream most tournaments/events on our twitch channel for viewing pleasure.<br /><br />Follow our Twitch:&nbsp;https://www.twitch.tv/highlanders_lol<br /><span style=\"text-decoration: underline;\"><strong>The Community:<br /></strong></span></p>\r\n<p>Discord is the home of our club members. In this server, members are able to interact with one another through text or voice, play games together, and retrieve information about future events.<br /><br />Join our discord: <a href=\"https://www.discord.gg/njit\">https://www.discord.gg/njit</a> and make sure you get the League role!<br /><br />We'll see <strong>YOU</strong> on the Rift!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f9be5f63-6726-424b-9065-6615d2ee1bb68a814674-cf7d-4f65-9c62-7ba4e9a4fe2d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cru",
    "name": "Cru",
    "ShortName": "Cru",
    "Summary": "NJIT Cru is a welcoming and loving community. We meet several times a week to learn about Christ and further His kingdom. Everyone is welcome. Whether you are a Christian or not, we invite you to join us to learn more about Jesus Christ.",
    "Description": "<h2 style=\"text-align: center;\"><strong><em>\"Empowered and led by the Holy Spirit, let us advance God&rsquo;s kingdom by making Jesus Christ known on every campus, influencing the state and ultimately the world\"</em></strong></h2>\r\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Cru is an international organization with a target audience of high-school and college students. As an organization Cru is interdenominational and welcomes students from all walks of life, religions, and beliefs. As stated above Cru exists to make Jesus known on every campus.&nbsp;</span></p>\r\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">&nbsp;</span></p>\r\n<h2 style=\"text-align: center;\"><strong><em>\"We are a caring community passionate about connecting people to Jesus Christ\"</em></strong></h2>\r\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">At NJIT we have several weekly meetings (times below), as well as, occasional events, opportunities to meet Christians on other campuses, retreats, and conferences. We strive to maintain a friendly, open community and a strong focus on fellowship. Whether you are Christian, have different beliefs, or are seeking your purpose in life we want you at Cru. We want to get to know you and we can't wait to see you at one of our events.</span></p>\r\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">(&nbsp;<a href=\"https://linktr.ee/njitcru\">Get Connected</a>&nbsp;)</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ec87263d-106a-454e-9832-8f113d14a02b0bc8aad5-3a8d-469d-8059-24232302adb1.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/acs",
    "name": "American Chemical Society",
    "ShortName": "ACS",
    "Summary": "ACS is linked to professors, research opportunities, and meaningful resources. Being a member of ACS means that you are always in touch with the world of science through a powerful network, and you are taking an opportunity to grow as a budding scientist",
    "Description": "<p>ACS is linked to professors, research opportunities, and meaningful resources. Being a member of ACS means that you are always in touch with the world of science through a powerful network, and you are taking an opportunity to grow as a budding scientist.</p>\r\n<p>Advisor: Dr. Bhavani Balasubramanian</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2ead6302-9e35-4e9b-821e-5e74609b6f4340d5f849-c14e-4787-878c-27bb2fe3772e.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/temetnosce",
    "name": "Minds+",
    "ShortName": null,
    "Summary": "Minds+ is The Positive Psychology Club of NJIT.\r\n\r\n",
    "Description": "<p>&nbsp;</p>\r\n<p>Minds+ is&nbsp;The Positive Psychology Club of NJIT.</p>\r\n<p>What is Positive Psychology?</p>\r\n<p>Positive psychology is the scientific study of the strengths and virtues that enable individuals and communities to thrive and grow and not just go through life.</p>\r\n<p>&nbsp;</p>\r\n<p>Why positive psychology?</p>\r\n<p>Before World War II, psychology had three missions: curing mental illness, making the lives of all people more fulfilling, and identifying and nurturing talent. After the war, most focus was on curing mental illness which helped countless people.</p>\r\n<p>But the downside was that the other two fundamental missions of psychology&mdash;making the lives of all people better and nurturing talent&mdash;were all but forgotten. These missions were revived with the introduction of positive psychology in 1998.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Minds+ can be a great way for you to get involved on campus while enriching your life experiences, or just to socialize with like minded people.</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/29318689-3c7d-4e0c-9629-030613f7bc337caafee1-4d6e-41d7-9b67-fccbdc76bcf2.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/flylanders",
    "name": "SAE Aero Design Team",
    "ShortName": "Flylanders",
    "Summary": "The NJIT's SAE Aero Design Team, otherwise known as the Flylanders, is an organization that is dedicated to providing opportunities for students to apply their knowledge to the aerospace field. We Design, Build, and Fly aircraft for the SAE competition.",
    "Description": "<p>The Society of Automotive Engineers (SAE) Aero Design Team at NJIT is an organization that is dedicated to promoting opportunities for students to apply their knowledge to aerospace projects outside the classroom. SAE annually hosts an International Aero Design Competition in which students from dozens of universities are given constraints to design, build, and fly a radio-controlled airplane.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/6ea38a37-b003-43d1-94b0-ae45ccad8857fa294a01-fa5b-4d07-ac7a-664c5b7a50ce.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/asc",
    "name": "Office of Academic Advising",
    "ShortName": "ASC",
    "Summary": "Through meaningful and collaborative relationships with advisors, students are able to effectively create and follow sound curriculum plans that are consistent with their personal values, interests, goals, and career paths.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/5f53bf7e-ba5b-405f-8366-510c3f6c3bc36d51f3c7-e9de-45cf-a147-30de90ec36d8.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitsigchi",
    "name": "NJIT Special Interest Group on Computer–Human Interaction",
    "ShortName": "NJIT SIGCHI",
    "Summary": "NJIT SIGCHI is an ACM special interest group dedicated to encouraging discussions about Human-Computer Interaction. What brings us together is a shared understanding that designing useful and usable technology has the power to transform persons' lives.",
    "Description": "<div id=\"x_x_x_x_x_x_x_chat-messages-768274152854519880\" class=\"x_x_x_x_x_x_x_message-2qnXI6 x_x_x_x_x_x_x_cozyMessage-3V1Y8y x_x_x_x_x_x_x_groupStart-23k01U x_x_x_x_x_x_x_wrapper-2a6GCs x_x_x_x_x_x_x_cozy-3raOZG x_x_x_x_x_x_x_zalgo-jN1Ica\" tabindex=\"-1\">\r\n<div class=\"x_x_x_x_x_x_x_contents-2mQqc9\">\r\n<div class=\"x_x_x_x_x_x_x_markup-2BOw-j x_x_x_x_x_x_x_messageContent-2qWWxC\">SIGCHI is an interdisciplinary group of computer scientists, software engineers, psychologists, interaction designers, graphic designers, sociologists, multimedia designers, anthropologists, and more. What brings us together is a shared understanding that designing useful and usable technology is an interdisciplinary process, and when done properly it has the power to transform persons' lives. At NJIT, our goal is to create a community of students to spark interest and encourage discussions on human-computer interaction (HCI)</div>\r\n<div class=\"x_x_x_x_x_x_x_markup-2BOw-j x_x_x_x_x_x_x_messageContent-2qWWxC\">&nbsp;</div>\r\n<div class=\"x_x_x_x_x_x_x_markup-2BOw-j x_x_x_x_x_x_x_messageContent-2qWWxC\">We have weekly meetings to focus on professional development related to&nbsp;HCI through discussions, projects, challenges, and more. We also have networking opportunities in the&nbsp;HCI field, potential workshops, seminars, access to various HCI resources, and many&nbsp;other ACM SIGCHI benefits!</div>\r\n</div>\r\n</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e0c846b3-ad6e-41a4-9485-4a5f864fb87d9536e49a-5fd0-4229-b679-c9ad6e9e54bf.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitmotorsports",
    "name": "NJIT Motorsports Club",
    "ShortName": "Motorsports",
    "Summary": "The NJIT Motorsports Club's goal is to provide an outlet for any discipline of automotive culture at NJIT to grow. We host car meets on-campus as well as other off-campus events.",
    "Description": "<p>The NJIT Motorsports Club's goal is to provide an outlet for any discipline of automotive culture at NJIT to grow. We host car meets on-campus as well as&nbsp;other off-campus events (Autocross/Karting/Carwash Days/etc). Our club also caters to people who are not advanced with cars, hosting workshops on basic car maintenance and safety for all to attend.</p>\r\n<p>Join the discord <a title=\"Discord\" href=\"https://discord.gg/y3naT9CjkE\" target=\"_blank\" rel=\"noopener\">here</a>!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/cab35355-8494-4aa9-9330-691efc8f7d81d6a6476d-1233-41d7-af88-bd1b423454db.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tennisclub",
    "name": "NJIT Tennis Club",
    "ShortName": "NJIT-TC",
    "Summary": "NJIT students of all skill levels who want to play tennis are welcome!",
    "Description": "<p>NJIT students of all skill levels who want to play tennis are welcome. There are some racquets for players to borrow at our events and balls are provided. We meet at The Naimoli Family Athletic and Recreational Facility on Mondays and Tuesdays from 6pm - 9pm!</p>\r\n<p>Discord:&nbsp;<a href=\"https://discord.gg/uQNVFfrrgC\">https://discord.gg/uQNVFfrrgC</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/17011113-6d61-4f56-a6b0-32b3fea61d8007edcaec-8f3c-49e5-a892-9465cf809f0a.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pls",
    "name": "Pre-Law Society",
    "ShortName": "PLS",
    "Summary": "Pre-Law Society is an organization dedicated to providing the NJIT student body opportunities and information needed to consider a future in the legal profession.",
    "Description": "<p>Welcome to the NJIT Pre-Law Society, a vibrant and dynamic community dedicated to empowering aspiring lawyers, legal scholars, and justice advocates in their pursuit of a legal career. Our organization is the ultimate destination for undergraduates who are passionate about the law, social justice, and the art of advocacy!<br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"http://www.prsaneworleans.org/wp/wp-content/uploads/2016/01/uncle-sam-we-want-you.jpg\" alt=\"Image result for we want you\" width=\"483\" height=\"400\" /></p>\r\n<p>We also publish an undergraduate law journal giving students to share their work with regards to the fields of law, history, etc.&nbsp;</p>\r\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://media3.giphy.com/media/xT4uQkaHm6EeUDFo40/source.gif\" alt=\"Image result for how i met your mother lawyered\" /></p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ca3364ee-5fed-42c0-b7b3-77c83ac70c744fe9ff5c-ba45-4049-8f33-56eb765e0cc8.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/kappasigma",
    "name": "Kappa Sigma",
    "ShortName": null,
    "Summary": "Kappa Sigma",
    "Description": "<p>Kappa Sigma is the largest college social fraternity in the world, originally founded at the University of Virginia in 1869.&nbsp;Kappa Sigma is focused upon the Four Pillars of Fellowship, Leadership, Scholarship, and Service.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/454adaff-515c-47b4-b8de-1810080afbcc704610a5-b000-4300-94d5-b7e7b3898d0a.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sigmapi",
    "name": "Sigma Pi Fraternity International",
    "ShortName": "Sigma Pi",
    "Summary": "We are a Greek lettered fraternity that has been on campus since 1938.",
    "Description": "<p>Sigma Pi Fraternity was founded in 1897 at Vincennes University, in Vincennes, Indiana. Our Executive Office&nbsp;is located at the historic Mitchell House in Lebanon, Tennessee. The Fraternity is one of the top men&rsquo;s collegiate organizations in North America, with more than 120 active chapters and colonies in the United States and Canada. With over&nbsp;100,000 alumni and 5,700 undergraduates; our men strive for excellence by living our core values to promote fellowship, develop character and leadership, advance heightened moral awareness, enable academic achievement, and inspire service. Sigma Pi is the only Greek letter organization with an international philanthropic program, The ACE Project, specifically designed to give back to our host institutions.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ef00c7db-7d78-429e-8b72-092c37c736ce98c25679-b458-4d55-8fea-e60306be69dc.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/apo",
    "name": "Alpha Phi Omega",
    "ShortName": "APO",
    "Summary": "Established in 1925 and founded on Leadership, Friendship, and Service, Alpha Phi Omega is the single most represented co-educational intercollegiate service organization & fraternity in the United States.",
    "Description": "<p>Established in 1925, Alpha Phi Omega is the largest intercollegiate fraternity in the United States, with chapters at over 350 campuses and an active membership of over 25,000 students.&nbsp;Founded on the Cardinal Principles of Leadership, Friendship and Service, APO envisions&nbsp;to be the premier, inclusive, campus-based, leadership development organization through the provision of service to others and the creation of community.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3129be9c-95ad-44eb-afd8-d4252e5f4f677fd648c1-18ab-43fc-acde-20938f68e2f8.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pds",
    "name": "Pre-Dental Society",
    "ShortName": "PDS",
    "Summary": "We are a group run by current pre-dental students seeking to provide guidance to interested pre dental students on how to fill out the AADSAS application, build manual dexterity, and expose themselves to the world of dentistry.",
    "Description": "<p><span style=\"font-weight: 400;\">Pre-Dental Society is an organization that offers information about all aspects of dentistry for all interested students. Members are encouraged to attend events that will guide students in pursuit of their dental career. Through our events and peer mentorship, students will have the tools they need to successfully apply to their dental schools of their choice. </span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">To contact us or keep up with announcements, please join or follow our social platforms:</span></p>\r\n<p><span style=\"font-weight: 400;\">-&nbsp;</span><span style=\"font-weight: 400;\"><a href=\"https://groupme.com/join_group/86934538/yBwAON2W\" target=\"_blank\" rel=\"noopener\">GroupMe</a></span></p>\r\n<p><span style=\"font-weight: 400;\">-&nbsp;</span><span style=\"font-weight: 400;\"><a href=\"https://www.instagram.com/njit_pds/\">Instagram</a>&nbsp;</span></p>\r\n<p><span style=\"font-weight: 400;\">-&nbsp;</span><span style=\"font-weight: 400;\"><a href=\"https://discord.gg/nWtw3fAYnb\">Discord</a></span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7d8f2a75-506e-4fac-98d1-60c0558b1ca2917bd07f-5522-4194-8541-e2fb81159184.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/newjerseyinstituteoftechnology",
    "name": "Office of Student Life",
    "ShortName": null,
    "Summary": "Office of Student Life",
    "Description": "<p>The Office of Student Life&nbsp;enhances the student experience at NJIT&nbsp;by providing opportunities for&nbsp;student-centered learning, personal&nbsp;and professional growth,&nbsp;and resources that foster an engaged and inclusive campus community.&nbsp;Through advisement, advocacy, annual programs and services, we empower our students to develop the skills necessary to be leaders in the workforce.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/85a0f902-4fda-45a3-973c-68b118b1ca0918173437-ee3c-4348-851d-e04b21aca339.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitvbc",
    "name": "NJIT Volleyball Club",
    "ShortName": "njitvbc",
    "Summary": "The purpose of the Volleyball Club shall be to spread intramural volleyball throughout the NJIT community. The club shall provide and organize opportunities for students to play on the campus. Additionally, the club shall support the NJIT College Teams.",
    "Description": "<p>The purpose of the Volleyball Club shall be to spread intramural volleyball throughout the NJIT community. The club shall provide and organize opportunities for students to play on the campus. You can get more information about our club through the discord link here: <a class=\"x_x_x_x_waffle-rich-text-link\" href=\"https://discord.gg/URTsqw7678\"> https://discord.gg/URTsqw7678</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/860d1f84-7d96-473e-9d59-5bf440d73218355f40e1-23e5-445a-822f-f6b128fe9cd5.PNG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitgreen",
    "name": "NJIT Green",
    "ShortName": "NJIT Green",
    "Summary": "A student-led initiative tasked with promoting new and lasting sustainable practices on both a personal and an institutional level.\r\n",
    "Description": "<p><em>Educate. Advocate. Collaborate.</em></p>\r\n<p>NJIT Green is a student-led initiative to bring sustainability to NJIT. The team behind the movement is working to build relationships between students, faculty, and staff to promote green choices and practices on an institutional scale.</p>\r\n<p>Here are some of our favorite events that we hold each year:</p>\r\n<ol>\r\n<li>Earth Day! A day when all organizations, labs, and departments on campus come together to celebrate sustainability.</li>\r\n<li>Our new Dual Chamber Composter. On the roof of the Campus Center, there is a new composter for all students, and faculty to use.</li>\r\n<li>Planting Events. Each semester we try to do at least one planting to increase the biodiversity on campus.</li>\r\n</ol>\r\n<div>If you have any questions, ideas, or concerns, feel free to contact us at any time.</div>\r\n<p class=\"gmail-x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_mb-0\">Our vision is to set NJIT as a leader in sustainability among other polytechnic universities and institutions around the country.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/18c6e9c0-e941-400b-8b7a-78089e8269c32c559066-b324-4b85-ae61-754cf17db33d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/deskoperations",
    "name": "Desk Operations",
    "ShortName": null,
    "Summary": "Residence Life has a front desk for each of the five residence halls on campus.  They provide security for the residence halls by monitoring the main entrances and exits of the halls.  ",
    "Description": "<p>The desk attendants (DA) provide security for the residence halls by monitoring the main entrances and exits of the halls.&nbsp;&nbsp;DAs enforce the ID (No ID, No Entry) and guest policies. The desk manager (DM) is responsible for assisting in the hiring,&nbsp;training, supervision and scheduling of the DAs.&nbsp;&nbsp;Residence Life also offers students the opportunity to work as mail people, office assistants, web masters and van drivers.&nbsp;&nbsp;During the summer recess, staff includes conference assistants, conference managers, desk managers, desk attendants&nbsp;and resident assistants.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/redwoodhallcouncil",
    "name": "Redwood Hall Council",
    "ShortName": "Redwood Hall Council",
    "Summary": "The governing body for the residents of Redwood Hall ",
    "Description": "<p>The governing body for the residents of Redwood Hall</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/05cf23ec-f9cb-42f9-b81b-e388397d73f992dcdb08-7744-425e-8661-8b97c2cc8342.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/afsa",
    "name": "African Students Association",
    "ShortName": "AFSA",
    "Summary": "We are an organization that aims to benefit the NJIT community by educations it about the African community and culture through educational and cultural activities",
    "Description": "<p>We are an organization that aims to benefit the NJIT community by educating it about the African community and culture through educational and cultural activities. We wish to invite the community to not only learn about our organization, but participate and share our culture.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/baa45a52-caa9-48a5-a482-61d2d4b317b3fc3024e7-b5c6-453c-bf4d-86c4508579a8.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/wjtb",
    "name": "WJTB Radio",
    "ShortName": "WJTB",
    "Summary": "Providing the students of NJIT with music, talk shows, and occasional live music.",
    "Description": "<p>WJTB is NJIT's college radio. Broadcasting at <a href=\"https://wjtb.njit.edu/\"> wjtb.njit.edu</a>, we feature various talk shows, on-air DJs, recording studios, and more. WJTB provides entertainment and live sound to the surrounding campus area through the shows and music it broadcasts.&nbsp;<br /><br /></p>\r\n<p>To chat with us, <a href=\"https://wjtb.njit.edu/discord\">Join our discord here!</a></p>\r\n<p>&nbsp;</p>\r\n<p>To submit a live sound request, please fill out our <a href=\"https://wjtb.njit.edu/sound-request\"> live event form&nbsp;here</a>.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/31da6324-ab57-4d46-b181-a0b168093e0632eda359-4e54-42e7-80c5-aa2e3f273bfa.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/healthandwellness",
    "name": "Campus Health & Wellness",
    "ShortName": null,
    "Summary": "The mission of Campus Health and Wellness Services is to protect, promote and improve the overall health and wellbeing of the NJIT students, faculty, and staff members. ",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/doscl",
    "name": "Office of the Dean of Students",
    "ShortName": "DOSCL",
    "Summary": "The mission of the Office of the Dean of Students is to support students both in and outside of the classroom through general advisement, advocacy, special programs and events, problem-solving, as well as implementing the Student Honor Code.",
    "Description": "<p>It is my honor to serve as the Dean of Students. The mission of the Office of the Dean of Students is to support students both in and outside of the classroom through general advisement, advocacy, special programs and events, problem-solving, as well as implementing&nbsp;the Code of Student Conduct and policies under the Title IX. The entire DOS team exists to create opportunities for student support and engagement.&nbsp;</p>\r\n<p>NJIT is uniquely positioned to attract a diverse intersection of the brightest minds to participate in solving the world&rsquo;s most challenging problems. Our students have the capacity to innovate, to bring rich new perspectives to important endeavors. The Office of the Dean of Students has a crucial role to play in mobilizing the resources of the campus and broader community to help our students to achieve success and fulfill their vast potential.</p>\r\n<p>Please contact us if you are having difficulties, if you have a great idea for improving student life on campus or if you are simply unsure about where to turn for help.&nbsp; I encourage you to explore our webpage to learn more about the many services we provide.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/dfa584d1-fea5-4795-90f8-d435fa3060c408d5d457-9f94-48bb-8cc4-605e08399e9e.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/newmanclubnwk-new123",
    "name": "Newman Catholic Campus Ministry",
    "ShortName": "Newman Catholic Club",
    "Summary": "Newman Catholic meets regularly for prayer, faith formation, and fellowship.",
    "Description": "<p>Welcome to the Newman Catholic Club!</p>\r\n<p>We are a Catholic campus ministry serving NJIT. We engage in prayer and fellowship to grow in faith and as a Catholic community. All are welcome to come to our events!</p>\r\n<p>The Newman Center offers many daily and weekly. Details on events will be communicated shortly through the newsletter and Discord (https://discord.gg/wFWkFA3x)</p>\r\n<p>We would love to see you at our events! Contact us for more information through our email or Discord!!!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0be92bc0-f9b4-4588-956d-e0272320bf78100872db-bf15-41ed-84fa-b4ac385ca858.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/aaees",
    "name": "American Academy of Environmental Engineers & Scientists",
    "ShortName": null,
    "Summary": "American Academy of Environmental Engineers & Scientists (AAEES) NJIT Student Chapter",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/9e108534-49ab-493b-a99d-27ef98e0e615b4688f02-4d51-4187-85b9-4361e1e14d5d.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gwics",
    "name": "Graduate Women in Computing Society",
    "ShortName": "GWiCS",
    "Summary": "Graduate Women in Computing Society (GWiCS ) is the graduate student club of the Ying Wu College of Computing focusing to encourage and engage the women in all aspects of the computing field.",
    "Description": "<p>We are a student club to build a community to improve cohesiveness between women in computer science.</p>\r\n<p>-To empower women by sharing both academic and professional opportunities.</p>\r\n<p>-To advocate for women in computer science through mentorship and workshops.&nbsp;</p>\r\n<p>-The club aims at promoting and empowering women in computing through tech talks while also facilitating networking opportunities with employers.&nbsp;</p>\r\n<p>-We are dedicated to fostering diversity and inclusion in the Computer Science and general STEM fields at NJIT.&nbsp;Our goal is to ensure our colleagues have a strong support system and appropriate resources to pursue their endeavors.&nbsp;</p>\r\n<p>-We are also committed to creating a comfortable environment and fun social group for our members. Work hard, play hard!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/5c30ddf2-1ccc-40e1-a695-9c71e741886d9140e073-92e0-4205-a313-7c79b31eb56c.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/datascienceclub",
    "name": "Data Science Club",
    "ShortName": "DSC",
    "Summary": "The overall purpose of the club is to educate the student body on various topics within Data Science. Members will learn about research and industry topics in Data Science, as well as engage in discussions, workshops, hackathons and more.",
    "Description": "<p><span style=\"font-weight: 400;\">The overall purpose of the club is to educate the student body on various topics within Data Science. Members will learn about research and industry topics in Data Science, as well as engage in discussions, workshops, hackathons and more. This club is aimed at the population of students studying Data Science by assisting their coursework through tutoring and the aforementioned activities. We are also appealing to students from outside of the major and even undergraduate students<span class=\"x_x_x_JsGRdQ\">. All are </span>welcome to attend the events to learn more about how Data Science, as it can help with their career and academic advancement. This has the added benefit of informing undergraduate students how &ldquo;cool&rdquo; a Masters in Data Science is, and keeps the talent within our university moving from undergraduate to graduate school. Although the Jersey City campus is dis-engaged from campus as a whole, we really want to connect with those students by supporting their transportation to our events on campus, or even going to their campus to connect as well. We are already coordinating with WiCS and ACM for future events, and hope to work with DeepCS and G-WiCS as well to build a positive cross-discipline relationship. In addition, we will have opportunities to connect with current industry professionals through projects, lectures and workshops. This opens up the opportunity for students to secure jobs as well.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/03aa2af5-465a-4bb9-8550-52ff4f448715c44705d8-88f9-44d7-937c-08a01a6c41dc.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/finact",
    "name": "Finance and Actuarial Society",
    "ShortName": "NJIT FinAct",
    "Summary": "Join the Finance and Actuarial Club at NJIT! Learn about the profession, gain valuable skills & study for SOA exams. Connect with industry leaders & learn Excel, SQL, SAS, VBA, Python & R. Stand out in the world of actuaries & have fun while doing it!",
    "Description": "<p><span style=\"font-weight: 400;\">Hey there! Are you interested in the field of actuaries and looking for ways to give yourself an edge? Look no further than the renewed Finance and Actuarial Club at NJIT! This club is perfect for students who want to learn more about the profession and gain some valuable skills.</span></p>\r\n<p><span style=\"font-weight: 400;\">Not only can you study for the SOA Professional Exams with the help of the club's resources, but you'll also get to meet and connect with leaders in the field through events and guest speaker presentations. Plus, you'll get to learn and practice Excel, SQL, VBA, Python, and R. These skills are crucial for data analysis, modeling and automating the process of Actuary. These are the most important tools for the Actuary profession.</span></p>\r\n<p><span style=\"font-weight: 400;\">So if you're looking to break into the world of actuaries and stand out from the crowd, join the Finance and Actuarial Club at NJIT! It's a great way to get ahead and have some fun while you're at it.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e6781f1f-c3b0-4498-9695-ebe612e7f054df51653c-cfb1-4431-b3b0-124d98ed092f.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/igda",
    "name": "International Game Developer's Association",
    "ShortName": "IGDA",
    "Summary": "IGDA is NJIT's student game development hub!\r\nWe are a forum for developers of any level of experience to collaborate, improve their skills, and make incredible games. \r\nWe host workshops, showcases, and collaborative game-making events.",
    "Description": "<p><strong>IGDA</strong> is NJIT's game development hub. We are a forum for developers of any level of experience to collaborate, improve their skills, and make incredible games.</p>\r\n<p>Want to improve your skills? Our <strong>workshops</strong> provide new opportunities for practice and growth on a variety of topics!</p>\r\n<p><br />Want to get in on the action? Our <strong>Game Jam</strong> events challenge our members to produce a game in a limited amount of time. Anyone is welcome to participate!<br /><br />What feedback for a project you are working on? Bring it in and we will help you <strong> showcase</strong> it!<br /><br />Hop right in to the club <strong>Discord</strong> at <a href=\"https://discord.gg/thVyCC6\"> https://discord.gg/thVyCC6</a></p>\r\n<p>Check out what our members have made on our <strong>itch.io</strong>! <a href=\"https://igda-njit.itch.io/\"> https://igda-njit.itch.io/</a></p>\r\n<p>Our faculty advisor is <strong>DJ Kehoe</strong>: <a class=\"email\" href=\"mailto:kehoed@njit.edu\">kehoed@njit.edu </a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/453ca1a7-8278-4ec1-b955-0c25b943319680ee4a49-1e24-40af-9d63-2f6546b9b094.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/lsa",
    "name": "Lebanese Student Association ",
    "ShortName": "LSA",
    "Summary": "The Lebanese Student Association (LSA) is committed to spreading the Lebanese culture across campus by holding regular fun events and meetings. Lebanese Students will also be able to meet their fellow citizens thanks to this organization\r\n",
    "Description": "<p><span style=\"font-weight: 400;\">The Lebanese Student Association (LSA) is committed to spreading the Lebanese culture across campus by holding regular fun events and meetings. Lebanese Students will also be able to meet their fellow citizens thanks to this organization.</span></p>\r\n<p><span style=\"font-weight: 400;\">Our organization will serve as a meeting ground for all Lebanese and non-Lebanese students that are interested in Lebanon and its culture. Lebanese people will be able to meet their fellow citizens during our meetings, gatherings, and events. Some events that we may host include food spreads that will feature staples of Lebanese cuisine that all students on campus will be able to try; Traditional Lebanese nights featuring Lebanese music and dancing such as the \"Dabke\" and a tutorial on how to do it. Additional events include fundraising for NGOs and poor people in Lebanon to help the less privileged stuck in the crisis-ridden country.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/afd5c46b-c7ae-48d5-bc6b-107d676df8387738f8fd-d59e-4253-b418-c43f8d0a025f.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/highlanderracing",
    "name": "Highlander Racing",
    "ShortName": "NJIT SAE BAJA",
    "Summary": "Design. Build. Compete. \r\nBaja SAE allows students to gain real-world experience in engineering design and manufacturing as they build a single-seat off-road car from the ground up, to be tested at competitions around the country against 100 other schools",
    "Description": "<p>Highlander Racing is a collegiate racing team within the Society of Automotive Engineers. Students are involved in all aspects of racing on and off the track. From managing the team's business strategy to designing and manufacturing an off-road racing vehicle.</p>\r\n<p><a href=\"https://www.youtube.com/watch?v=tYoGB4aqD20&amp;ab_channel=NJITHighlanderRacing\">Youtube Channel</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7b819db3-0658-40f1-a4f7-92763142822289d53556-3d4d-41c1-b225-b895593fcec3.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/mgc",
    "name": "Multicultural Greek Council",
    "ShortName": "MGC",
    "Summary": "The Multicultural Greek Council will promote and support the development and sustainability of multicultural Greek fraternities and sororities through mutual respect, appreciation and acceptance. ",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/ce3e990d-4246-4c01-a815-38899f65f4dd82b2f04c-9764-46f0-8c44-53046e9d4ff1.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nsbe",
    "name": "National Society of Black Engineers",
    "ShortName": "NSBE",
    "Summary": "National Society of Black Engineers (NSBE) offers its members leadership training, professional development activities, mentoring, career placement services, community service opportunities and more. ",
    "Description": "<p>The mission of the National Society of Black Engineers is&nbsp;<strong><em>\"to increase the number of culturally responsible Black Engineers who excel academically, succeed professionally and positively impact the community.\"</em></strong><br /><br />The National Society of Black Engineers strives to accomplish the following objectives for our organization:</p>\r\n<ul>\r\n<li>Stimulate and develop student interest in the various engineering disciplines</li>\r\n<li>Strive to increase the number of minority students studying engineering at both the undergraduate and graduate levels&nbsp;</li>\r\n<li>Encourage members to seek advanced degrees in engineering or related fields and to obtain professional engineering registrations</li>\r\n<li>Promote public awareness of engineering and the opportunities for Blacks and other minorities in that profession</li>\r\n<li>Function as a representative body on issues and developments that affect the careers of Black Engineers&nbsp;&nbsp;</li>\r\n</ul>\r\n<p>Innovative project ideas are generated and implemented throughout the year on the chapter, regional and national levels. Some of NSBE's present activities include tutorial programs, group study sessions, high school/junior high outreach programs, technical seminars and workshops, a national communications network (NSBENET), two national magazines (NSBE Magazine and NSBE Bridge), an internal newsletter, a professional newsletter (Career Engineer, a supplement in NSBE Magazine), resume books, career fairs, awards, banquets and an annual national convention.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7aaf55a8-67e9-4183-b37f-0dc52614f2ecf70957a1-c342-4eec-b1d5-8b76f2ab22bd.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/swe",
    "name": "Society of Women Engineers",
    "ShortName": "SWE",
    "Summary": "SWE strives to connect our members with opportunities for networking, advancement and mentor-ship as they grow their careers in engineering related fields.",
    "Description": "<p><span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_color_17\">The Society of Women Engineers, founded in 1950, is a not-for-profit organization in the United States. The organization is meant to give back to the community as well as spread knowledge about engineering. We host many events that give students the&nbsp;</span><span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_color_17\">opportunity</span><span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_color_17\">&nbsp;to make&nbsp;</span><span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_color_17\">connections&nbsp;</span><span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_color_17\">with</span><span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_color_17\">&nbsp;companies and professionals.</span></p>\r\n<p>You can find out more information about national SWE and how to become a paid member at:&nbsp;<a href=\"https://swe.org/\">https://swe.org/</a></p>\r\n<p>Join our Discord to stay updated and connect with other SWE members: <a href=\"https://discord.gg/WdHVZan9aJ\">NJIT SWE Discord</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/1ade9692-2c8d-4586-8970-c0fcbd4d1b744be0445d-6ff0-41cb-a033-9525b2f77fa3.PNG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/dphie",
    "name": "Delta Phi Epsilon Sorority",
    "ShortName": "DPhiE",
    "Summary": "Delta Phi Epsilon is an international social sorority founded upon the principles of justice, sisterhood, and love. Our mission is to create a sisterhood experience rich in tradition, innovation, and opportunities for growth.",
    "Description": "<p>Delta Phi Epsilon is an international social sorority&nbsp;that equips its members with the leadership skills they will need to create change in their communities. Our organization raises money for the Cystic Fibrosis Foundation (CFF), Anorexia Nervosa and Associated Disorders (ANAD), and the Delta Phi Epsilon Education Foundation. Find out more about our international organization at&nbsp;<a href=\"https://dphie.org/\">https://dphie.org/</a>!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/dd851ba3-a94a-4e4d-851a-886ff80f57a6ea696bc9-2134-4932-8f28-5ce0f346b419.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/redwood",
    "name": "Redwood Hall",
    "ShortName": null,
    "Summary": "Redwood Hall is a coed facility that houses 200 freshmen and some sophomores, juniors and seniors in single or double rooms.",
    "Description": "<p>Redwood Hall is a coed facility that houses 200 first year students and some sophomores, juniors and&nbsp;seniors in single or double rooms. Each room is furnished with a bed, dresser, desk, chair&nbsp;and lamp for each student. Two large common bathrooms are on each floor. A kitchen is located on the first floor, as well as a game room and two lounges. Room measurements are 11&rsquo;6&rdquo; x 18&rsquo;9&rdquo;.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7b7cd8d2-c277-42f8-a12c-1a8d9473e29f28b34592-04ea-4783-89fd-8f1df9b7474f.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tbp",
    "name": "Tau Beta Pi",
    "ShortName": "TBP",
    "Summary": "We are the oldest and foremost Engineering Honor Society. ",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/2d9eee18-c4c8-42b8-aa03-66a4e2b6ae8144eb980e-954a-4b13-94b0-c359dcef71d1.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cypresshallcouncil",
    "name": "Cypress Hall Council ",
    "ShortName": "Cypress Hall Council ",
    "Summary": "Cypress Hall Council represents the residents living in Cypress Hall ",
    "Description": "<p>Cypress Hall Council represents the residents living in Cypress Hall! We provide programming, advocacy, and an opportunity to get together as a building.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/35dc2ace-891e-4438-a139-132fb46993333ba56034-6b16-4f90-b5d9-4513edcfbfc3.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/aviationclub",
    "name": "Aviation Club",
    "ShortName": null,
    "Summary": "Aviation Club",
    "Description": "<p>Welcome to NJIT's Aviation Club! We explore the latest in aviation technology with simulators, drones, and virtual reality experiences. Join us any Wednesday from 2:30 pm to 4:00 pm for our weekly meetings in the container building at corner of Lock St. and Warren St.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e27462f6-77d7-4fbb-8347-671348529e1953665c3f-464f-4173-8784-3c91ec11faf4.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/msa",
    "name": "Muslim Student Association",
    "ShortName": "MSA",
    "Summary": "The Muslim Student Association aims to unite students of all backgrounds and encourage diversity and harmony throughout campus through spiritual and prophetic teachings.",
    "Description": "<h5>The mission of the Muslim Student Association is to unite students &mdash; of all backgrounds &mdash; and encourage diversity and harmony throughout campus. Our main goal is to spread hope and happiness to all people, and show that, regardless of society&rsquo;s physical, religious, or mental differences, we can all unite under one common ground: the desire for peace. As a result, the purpose of our organization is to create events, meetings, and discussions that unify students on campus and allow them to have an opportunity to belong to a group that provides a positive influence in their lives.</h5>\r\n<h5>Some of the objectives of the Muslim Student Association are to create a community of strong brotherhood and sisterhood among our members, increase their knowledge of Islam, and provide a wide range of events that cater to all NJIT students.</h5>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0b4c472a-4384-47c3-bed1-ec8cdbcd2322c7405095-99a8-4913-902f-66de0f2d27b3.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ogi",
    "name": "Office of Global Initiatives",
    "ShortName": "OGI",
    "Summary": "The Office of Global Initiatives (OGI) is the primary university resource and focal point for international student services and study abroad.",
    "Description": "<p>The Office of Global Initiatives (OGI) is the primary university resource and focal point for international student services and study abroad.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2cbb3593-c6f7-4ac2-a55c-7989044b72f84ceb189e-8a69-4a55-a664-fd9b1d04fbec.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/athletics",
    "name": "Athletics",
    "ShortName": "Athletics",
    "Summary": "Home of NJIT Highlanders Athletics! #RollTech",
    "Description": "<p>NJIT Highlanders Athletics has 19 Division l sports. We post game information, news, promotions and highlights for students to see! <em>#RollTech</em></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0e62782b-380f-4bc2-8867-4dab22e636f3a4882544-c160-454a-84e7-88080392b476.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/eop",
    "name": "Educational Opportunity Program",
    "ShortName": "EOP",
    "Summary": "Educational Opportunity Program",
    "Description": "<p>EOP's mission is to provide educational opportunities and improve educational outcomes for populations traditionally underrepresented in mathematics, the natural sciences, engineering, computer and information science, business, architecture, engineering technology, and in the professions related to these fields.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nucleusyearbook",
    "name": "Nucleus Yearbook",
    "ShortName": "Nucleus Yearbook",
    "Summary": "Nucleus Yearbook creates and publishes the annual NJIT Yearbook, attends and hosts events and programs on campus to catalog and preserve NJIT history for generations to come.",
    "Description": "<p>Our mission, as Nucleus Yearbook, is to produce an accurate and original publication that thoroughly reflects and represents all the differing interests of the student body and highlights activities and events of the year, all while maintaining the respect of all members of the school community without bias, to the best of our abilities.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/6f3f96b5-85cd-4b48-9385-b880282b8024b8729dff-7c38-4a00-93bf-ef29661b9794.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitvector",
    "name": "The Vector Newspaper",
    "ShortName": "The Vector",
    "Summary": "As the official student newspaper, our mission is to inform and entertain our readers, cultivate awareness of issues concerning the NJIT community, and provide a forum for purposeful, constructive discussion among its members.",
    "Description": "<p>As the official student newspaper, our mission is to inform and entertain our readers, cultivate awareness of issues concerning the NJIT community, and provide a forum for purposeful, constructive discussion among its members.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c567a83b-6048-4d00-8adc-6b9c3de7a790b7fd2cb2-817d-454a-af17-699f08dceb2b.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/transect",
    "name": "Transect",
    "ShortName": null,
    "Summary": "HCAD's student-produced architectural journal",
    "Description": "<p><em>Transect</em> is the student-produced architectural journal of NJIT&rsquo;s Hillier College of Architecture and Design. The publication seeks to contribute to and situate the school&rsquo;s work within broader stands of contemporary architectural discourse by publishing student projects and essays as well as original essays by faculty, scholars, and practitioners. <em>Transect</em> is published once a year, in physical and <a href=\"https://transectpub.cargo.site/articles\">digital</a> form.</p>\r\n<p>Originally begun in 2019 as a catalog of exemplary student work to serve as a resource for students, <em>Transect</em> has grown in scope to provide critical commentary on and explorations of the nature and potentials of architecture and its pedagogy while arguing for its continued relevance. The publication takes its name from the title of the school&rsquo;s Spring 2019 lecture series and embodies a way of seeing that encourages interdisciplinarity, mixed methods of presentation, and engagement across the wide and varied landscape of architectural discourse, past and present.</p>\r\n<p>Transect also regularly publishes student-produced architectural writing in a tabloid called&nbsp;<em>Iteration</em>&nbsp;that is published physically and&nbsp;<a href=\"https://transect.substack.com/\">digitally on Substack</a>. Previous topics have included inclusionary spaces, school/life balance in architecture school, and architectural criticism of NJIT&rsquo;s Newark campus.</p>\r\n<p>Join our <a href=\"https://discord.gg/twmnf3pa8v\">Discord</a>&nbsp;to stay up to date with us!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/50328a19-5aa4-4e1b-9fe1-227ae81bf948147a5ad4-ae74-431a-8386-da23c484e21d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sps",
    "name": "Society of Physics Students",
    "ShortName": "SPS",
    "Summary": "The Society of Physics Students ",
    "Description": "<p><span style=\"font-weight: 400;\">The purpose of the Society of Physics Students is to give any NJIT student with an interest in physics a place where they can conduct research using instruments provided by the Physics Department and allow them to network with professionals in their field. The club will be a safe space for students to work with each other, and faculty from the Physics Department on learning more about physics. The club will provide tutoring for any student who needs help with classes that fall under the branch of physics.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ssa",
    "name": "Newark Sikh Student Association",
    "ShortName": "SSA",
    "Summary": "A religious organization with the goal of raising awareness of the Sikh religion.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/e19bc960-b4c4-46f7-bd4c-7baa0cb1a5f8506e87c6-b1df-454e-a1db-5445b73fc304.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njit-tep-usitt",
    "name": "NJIT TEP & USITT STUDENT CHAPTER",
    "ShortName": "NJIT TEP",
    "Summary": "A unified theatre club for all things theatre. From acting, technical theatre, improvisation, and film production, NJIT TEP aims to offer students the opportunity to collaborate on personal projects and theatrical productions on campus!",
    "Description": "<p><span style=\"font-weight: 400;\">NJIT TEP &amp; USITT Student Chapter is a community where students interested in theatre can join our organization and collaborate with peers in theatrical/entertainment related activities; Whether it be student run theatrical productions, or university wide performances for the whole community to enjoy. Our organization has several divisions dedicated to different sub-fields of the larger theatre industry. From Acting, to Technical Theatre, to Improvisation to Film Production/making, NJIT TEP &amp; USITT Student Chapter will be the central hub for all things theatre on campus. </span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3e451bdd-1256-4f0f-9141-d1db36b8171b3c792435-00ab-491e-b2fc-41821259f2f1.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ais",
    "name": "Association of Indian Students",
    "ShortName": "AIS",
    "Summary": "We are an NJIT organization dedicated to bringing cultural diversity and heritage to the student body at NJIT.",
    "Description": "<p>We are an NJIT organization dedicated to bringing cultural diversity and heritage to the student body at NJIT.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/d44d6f67-fc62-4557-b62f-81a5aa19e5fe84a0dabc-a9d6-4602-8411-d2bb17c20cb3.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ieee",
    "name": "Institute of Electrical and Electronics Engineers",
    "ShortName": "IEEE",
    "Summary": "Professional organization with a goal of providing students with the means to succeed at NJIT as well as in the future. We have a history of doing countless activities over the years such as technical workshops, company tours, lectures/seminars, and more",
    "Description": "<p>As the world's largest technical professional organization, IEEE offers a number of ways to get involved with technical and local communities. These communities are active participants in research and authorship, conferences, and important conversations about today's most relevant technical topics locally and globally.<br /><br />With 39 technical Societies, ten geographic regions that host over 10,000 local meetings annually, several affinity and special interest groups, humanitarian opportunities, and virtual communities and private groups through IEEE Collabratec&trade;, IEEE offers ample opportunity to network and grow professionally through communities.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Join our discord server <a href=\"/engage/actioncenter/organization/ieee/%20https:/discord.gg/ugPATnt\"> here</a>! It's the best and fastest way to keep up to date with our current events and to get involved with IEEE!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/8aed18fe-9438-45cd-8ba3-9b4d9096e2897dedbb05-0e95-42f4-ae22-aaf1f528f7f5.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/kidswhocode",
    "name": "Kids Who Code ",
    "ShortName": "KWC",
    "Summary": "We will be dedicated to helping out at the after school program in Newark elementary schools and to creating a curriculum to augment the programming proficiency among kids in Newark. We’ll also be setting up a buddy system between them and NJIT students.",
    "Description": "<p>&nbsp;</p>\r\n<div><span style=\"color: #000000; font-family: arial,helvetica,sans-serif;\">We will&nbsp;be dedicated to helping out at the after school program at Hawthorne Ave Elementary<span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_m_3128125022899665965m_-5191618712411664431m_-1091306421598229815gmail-Apple-converted-space\">&nbsp;</span>School in Newark and to creating a curriculum to augment the programming proficiency among the youth in Newark. We&rsquo;ll also be setting up a buddy system between NJIT students and<span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_m_3128125022899665965m_-5191618712411664431m_-1091306421598229815gmail-Apple-converted-space\">&nbsp;Hawthorne Ave&nbsp;</span>students for a more individualized learning experience. We plan on facilitating community service events both on and off campus.&nbsp;</span></div>\r\n<div><span style=\"color: #000000; font-family: arial,helvetica,sans-serif;\">Join our <a href=\"https://discord.gg/jfr262N3he\">Discord Server</a>!</span></div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3f53c744-0106-4e59-a080-22197e7bfc9775c16a23-bd09-4806-a5d5-536093c416d2.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hosa",
    "name": "Health Occupations Students of America",
    "ShortName": "HOSA",
    "Summary": "NJIT HOSA is a professional pre-health organization that offers competitive events at the state and national level, volunteering and fundraising opportunities, as well as networking and leadership opportunities - ALL related to healthcare!",
    "Description": "<p><span style=\"font-weight: 400;\">NJIT HOSA provides professional opportunities for pre-health students to become leaders in healthcare through competitions, leadership, networking, volunteering, fundraising, and more! Through HOSA, students will be able to explore various fields within the healthcare industry and develop professionally for a future career in healthcare! </span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/53f3a067-f824-4d79-9b4e-cfee7dce306abb061cb4-9532-4891-8e48-4886c1e208a0.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/betapsiomega",
    "name": "Beta Psi Omega",
    "ShortName": "BPO",
    "Summary": "Beta Psi Omega is a professional biology fraternity where the mission is to provide a supportive brotherhood for students pursuing careers in the biological sciences or interested in the subject, and to further the advancement of biology as a science.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/867bd759-39f9-4350-ba64-e900cdec8efa5a69e17e-0a9d-409f-a9c8-01032fdbd401.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/greekvillage",
    "name": "Greek Village",
    "ShortName": null,
    "Summary": "The Greek Village consists of five duplex homes for members of fraternities, sororities and students.",
    "Description": "<p>The Greek Village consists of five duplex homes for members of fraternities, sororities and&nbsp;students. The living, dining and chapter spaces are on the first floor and the student rooms&nbsp;are on the upper two floors. Each room is furnished with a bed, a dresser, desk, chair and a&nbsp;lamp for each student.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e9edad00-e20f-4b53-abe4-17f5bc5e23eabb3460b2-bf6d-4d0c-ba5f-f95cbaf2c48e.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/maple",
    "name": "Maple Hall",
    "ShortName": null,
    "Summary": "Maple Hall is a coed, apartment style facility that houses 548 sophomore, junior, senior and graduate students.",
    "Description": "<p>Maple Hall is a coed, apartment style facility that houses 548 sophomore, junior, senior and graduate students. Apartments consist of the following:</p>\r\n<p>Studio Apartment (Private)</p>\r\n<p>1 Bedroom/ 1 Bathroom (Double)</p>\r\n<p>2 Bedroom/2 Bathroom (Double)</p>\r\n<p>2 Bedroom/1 Bathroom (Private)</p>\r\n<p>4 Bedroom/2 Bathroom (Private)</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b8f958af-f989-4afd-be46-b619f96c7a901c7d77c6-f1d5-4abb-99cf-22d116b388ea.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gsa",
    "name": "Graduate Student Association",
    "ShortName": null,
    "Summary": "As a student government organization, GSA's mission is to represent the interests of all graduate students in university affairs. GSA maintains relationships with graduate students, our university administrators and officials. ",
    "Description": "<p>All NJIT graduate students are already members of GSA! Portions of the graduate fees paid with the school tuition allows students full access to all the benefits that the GSA provides. As student representatives from all graduate programs are the critical element in ensuring student representation, representatives are made available to their respective constituencies with regular department wide feedback sessions. These sessions allow all students to express their opinions, comments and difficulties to their representative. Representatives then work with department administration to resolve any issues. This structure provides students a powerful voice in their departments and on campus. Representatives are also available with weekly office hours to provide any assistance necessary to their fellow graduate students.</p>\r\n<div>&nbsp;</div>\r\n<div>To get involved with the GSA, please contact your Department Rep or email us at gsa-vp-communication-group@njit.edu</div>\r\n<div>&nbsp;</div>\r\n<div><a href=\"https://drive.google.com/drive/folders/1pREhYRW1klXD0IAOIn0yupBnPUpH5iwH?usp=sharing\" target=\"_blank\" rel=\"noopener\">GSA Documents</a></div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/eb7f23b1-c920-421e-8ad8-7d4745c7a6663a05b5fc-2150-4fc1-8980-64ca57e52652.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/finest",
    "name": "Filipinos In Newark Engaging in Sociocultural Traditions",
    "ShortName": "FINEST",
    "Summary": "The purpose of the Filipinos in Newark Engaging Socio-Cultural Traditions of NJIT shall be to benefit the NJIT community by spreading knowledge and culture of the Philippines through food, music, history, dance, and language. \r\n",
    "Description": "<p>We are the <em><strong>Filipinos In Newark Engaging In Sociocultural Traditions</strong></em>, a.k.a. <em><strong>FINEST</strong></em>. Our goal is to spread the knowledge of the Filipino culture through a variety of events that range from food, to music, history, dance, and language. Our club is open to everyone who wants to learn more about the Filipino culture and want to bond with other fellow Filipino or Filipino-American students in NJIT.</p>\r\n<p>&nbsp;</p>\r\n<p>Examples of events we hold:</p>\r\n<p>- <strong>Reign or Shine:</strong> Our annual dancing event held once a year that brings the dancing community together from across the Tri-state area and either showcases or competes at our event to bring to the NJIT community an amazing show filled with talent.</p>\r\n<p>- <strong>Ate, Kuya, Bunso Program (AKB):</strong> Want to bond within our FINEST community? Our Ate Kuya Bunso program, a.k.a. our AKB program, aims to partner people with a \"lineage\" and connects them with fellow peers within FINEST to build a closer bond. These lineages also give opportunity to connect with Alumni to give them opportunities on how they can take advantage of their future careers.</p>\r\n<p>- <strong>Cooking Nights:</strong> We also hold cooking events every year for our members to get a hands-on experience on how to cook a variety of Filipino dishes, ranging from kare kare, sinigang, pancit canton, etc.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>External events:</strong></p>\r\n<p>FINEST is also a member of Filipino Intercollegiate Networking Dialogue, Incorporated (FIND Inc.), a non-profit organization aimed to promote unity and connection with Filipino students in universities across the eastern seaboard. Composed of nine \"districts\", we are currently associated with the 3rd district, also known as District Three (D3), which is composed of 29 different colleges from North Jersey, Long Island, and Metro NYC. Events that we participate in include Mr./Ms. Philippines (pageant), Wanna Canta (singing competition), Sportsfest (volleyball and basketball competition), etc.</p>\r\n<p>&nbsp;</p>\r\n<p>Feel free to join our <a href=\"https://bit.ly/FINESTDiscord\">discord</a>!</p>\r\n<p>Want to stay updated on news in FINEST? Join our <a href=\"https://bit.ly/FINEST_Newsletters_Signup_Form\"> mailing list</a>!</p>\r\n<p>Follow our <a href=\"https://www.instagram.com/njitfinest/\">Instagram</a>!</p>\r\n<p>Our office is located in the Campus Center Basement, in office B15. Feel free to stop by and visit!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/76e2e60d-aa20-412b-9c0b-110084081cef6afc28ba-e4a3-4fae-b9ab-d4a323786db7.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gide",
    "name": "Graduates for Inclusion, Diversity, and Equity",
    "ShortName": "GIDE",
    "Summary": "A graduate club committed to promoting inclusivity, celebrating diversity, and creating equitable programs for the NJIT graduate student body.",
    "Description": "<p>Our mission is to promote inclusivity, celebrate diversity, and create equitable programs for the NJIT graduate student body. We aim not only to celebrate the diversity of the current graduate population but to increase the participation of historically underrepresented groups in future STEM graduate programs. We will support, educate, and recognize students of ALL backgrounds and create a safe space for dialogue.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e5f917eb-867f-49fa-96c3-d8e13c845cc9de743d6a-207e-480f-8c4e-77d707bed0eb.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/wrestling",
    "name": "NJIT MMA Club",
    "ShortName": "NJIT Wrestling",
    "Summary": "NJIT MMA Club invited all NJIT students to participate in a physical recreational sports. Such as Wrestling, Boxing, and Jujutsu. Previous experience not required.\r\n\r\nJoin our discord server: https://discord.gg/xCCgV9r6th ",
    "Description": "<p>NJIT MMA Club is a recreational sport group at NJIT that focuses on improving physical strength, Technique, and Mental endurance.</p>\r\n<p>Practice Meeting Times:</p>\r\n<p>Wednesdays: 9-10pm WEC Multipurpose Room</p>\r\n<p>Fridays: 6-8pm WEC Multipurpose Room&nbsp;</p>\r\n<p>Current Hosting</p>\r\n<p>*Wrestling&nbsp;</p>\r\n<p>*Boxing</p>\r\n<p>*Jujutsu&nbsp;</p>\r\n<p>* No prior experience necessary</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0af889d3-a50e-4ab2-9de5-893f4fcb215386aad136-c6b0-4c17-a7aa-77fda34a65ba.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/legoclub",
    "name": "LEGO Club",
    "ShortName": null,
    "Summary": "The LEGO Club is devoted to providing a creative outlet for students in the form of semester-long projects using LEGOs.",
    "Description": "<p><span style=\"font-weight: 400;\">Join us on our discord page!&nbsp;</span></p>\r\n<p><a href=\"https://discord.gg/qZCyatw5V5\"><span style=\"font-weight: 400;\">https://discord.gg/bJqVBvMy4</span></a></p>\r\n<p><span style=\"font-weight: 400;\">The purpose of the LEGO Club will be to encourage a creative outlet for students through the use of LEGOs. LEGO Club meetings will consist of many things; planning future projects and building them, discussions and brainstorming, building competitions, or collaborating on a semester-long project.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/07e31409-0561-411b-9935-6fcfa8ab8d283fe81eea-516e-4a93-84f8-92a0152b7c7a.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hinduyuva",
    "name": "Hindu Youth for Unity, Virtues and Action",
    "ShortName": "Hindu YUVA",
    "Summary": "Hindu YUVA is a socio-cultural organization that aims to preserve, practice, protect, and promote Hindu culture and heritage, by bringing together Hindu youth at the New Jersey Institute of Technology campus.",
    "Description": "<p><span style=\"font-weight: 400;\">Hindu YUVA is a socio-cultural organization that aims to preserve, practice, protect, and promote Hindu culture and heritage, by bringing together Hindu youth at the New Jersey Institute of Technology campus. YUVA abbreviates for Youth Unity Virtues and Actions.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3cfa68c3-e5ed-4d18-adf0-0065c27da50c9d4d3f37-0d87-4175-88a8-ed199a5040eb.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitanime",
    "name": "NJIT Anime Club",
    "ShortName": "Anime Club",
    "Summary": "We meet once a week to discuss and watch anime, as well as host events such as movie nights, music quizzes, and pizza meetings. Our club also organizes the NJIT MiniCon.",
    "Description": "<p>We meet once a week to discuss and watch anime, as well as host events such as movie nights, music quizzes, and pizza meetings. Our club also organizes the NJIT MiniCon.</p>\r\n<p>Our Discord server is a great place to keep up with the club activities, as well as chat with and get to know the members. Click the globe below to join the server, or copy and paste this link in a web browser: <a href=\"/engage/actioncenter/organization/njitanime/njit.gg/anime\"> njit.gg/anime</a></p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/9e493994-ded5-4ec8-956b-64d9750de75da0148620-b796-439f-b8e8-fe048b1fec2a.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/swimclub",
    "name": "Swim Club",
    "ShortName": null,
    "Summary": "The Swim Club is an organization that will provide an environment in which individuals can either learn or improve their ability to swim at the pool in the WEC.",
    "Description": "<p>Welcome to The Swim Club at NJIT!</p>\r\n<p>&nbsp;</p>\r\n<p>Our organization is dedicated to fostering a welcoming and inclusive environment within the NJIT community, where individuals can learn or enhance their swimming abilities while prioritizing both physical and mental well-being.</p>\r\n<p>&nbsp;</p>\r\n<p>Whether you're a beginner dipping your toes into the water for the first time or an experienced swimmer looking to refine your technique, The Swim Club is here for you. We offer guidance and support to swimmers at all levels, from those learning the basics to those seeking to improve their health and fitness.</p>\r\n<p>&nbsp;</p>\r\n<p>But we're more than just a swim club, we're a community. Our goal is to create a space where students can escape the stresses of school, connect with others, and enjoy the benefits of swimming in a judgment-free zone. Whether you're looking to conquer a fear of water, challenge yourself, or simply have a good time, you'll find a home with us. Join us for pool sessions, social events, and more!</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">Connect with us to keep up-to-date with our events:</span></p>\r\n<p><span style=\"font-weight: 400;\">- Instagram: @<a href=\"https://www.instagram.com/theswimclubnjit/\">theswimclubnjit</a></span></p>\r\n<p><span style=\"font-weight: 400;\">- Discord:&nbsp;<a href=\"https://discord.gg/HqCYJ4KUv4\" target=\"_blank\" rel=\"noopener\">https://discord.gg/<wbr />HqCYJ4KUv4</a></span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\"><strong><span style=\"text-decoration: underline;\">NOTE</span></strong>: Please check you spam folder if you are already a member and not receiving emails from us!</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c2406683-9570-4a92-8405-c4b3471ab7a34c59a394-3eb1-416f-840f-a56358da60b3.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/spikeballclub",
    "name": "Spikeball Club",
    "ShortName": null,
    "Summary": "An arising sport, called Spikeball, will be played, spreading awareness of this awesome sport on campus! ",
    "Description": "<p>Spikeball is a sport consisting of a round net played among four players. A team, comprising of 2 players, would spike the ball to the opposing team. Similar to volleyball, the opposing team needs to hit, or spike, the ball back to the team that they are playing against. Spikeball is normally played as 2v2. Each team needs to work together to spike the ball at the net while making it harder for the other team to spike the ball back. Through this club, members will not only learn how to play Spikeball but also enhance their communicational skills and meet new people on campus! Whether it is your first time playing or not, everyone is encouraged to join!</p>\r\n<p>--------------------------------------------------------------</p>\r\n<p><a href=\"https://discord.gg/dW5xdqpU5p\">Join Our Discord!</a></p>\r\n<p><a href=\"https://instagram.com/njitspikeball?utm_medium=copy_link\">Follow Us on Instragram!</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/71ed619e-12a7-4254-b93d-e8ea3b24788cf21f8942-7101-4947-a98e-3f0af0d62649.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/maplehallcouncil",
    "name": "Maple Hall Council ",
    "ShortName": "Maple Hall Council ",
    "Summary": "Creating the best on-campus experience at NJIT's newest residence hall!",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/fdb8ae0e-552c-425b-87f1-9007a36c720f8d8b738e-90ea-44f7-81e1-7330b12497b5.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nrhh",
    "name": "National Residence Hall Honorary (NRHH)",
    "ShortName": "NRHH",
    "Summary": "NRHH is the top 1% student leaders living in the residence halls",
    "Description": "<p>The National Residence Hall Honorary (NRHH) Highlander Chapter is an NJIT Residence Life based organization focused on the development of leadership, community service, and advocacy. Through programming and campus-wide initiatives, NRHH provides recognition to individuals who have demonstrated outstanding service alongside opportunities to foster continued and purposeful growth of NJIT Residence Halls and surrounding community.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4775729c-4e8f-44ae-9b88-2822ad4a3975150d1dae-f10f-4d44-a52d-2594ef09844f.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ewb-njit",
    "name": "Engineers Without Borders",
    "ShortName": "EWB",
    "Summary": "Engineers Without Borders is a professional organization which operates with a global mission to help developing nations maintain resiliency by providing a variety of practical engineering solutions to rising problems and issues.",
    "Description": "<p>In the world&rsquo;s toughest places, Engineers Without Borders USA (EWB-USA) is partnering with communities to meet their basic human needs. We&rsquo;re building footbridges to provide pathways to opportunities. We&rsquo;re installing solar panels to bring light where it is dark. We&rsquo;re digging for water so hope can spring from the ground. Each project builds the foundation for a community to thrive for years to come.</p>\r\n<p>EWB-USA builds a better world through engineering projects that empower communities to meet their basic human needs and equip leaders to solve the world&rsquo;s most pressing challenges.</p>\r\n<p>EWB-USA&rsquo;s vision is a world in which every community has the capacity to sustainably meet their basic human needs.</p>\r\n<p>Please join our discord at:https://discord.gg/TJ57zkcPak</p>\r\n<p>Visit our&nbsp; Website for more information:&nbsp;https://ewb-njit.com/</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/695a9a7d-44e7-4381-9ffb-c567f7bed0a90b48256c-a270-48c6-b4d3-1297402999c3.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gbmes",
    "name": "Graduate Biomedical Engineering Society",
    "ShortName": "GBMES",
    "Summary": "The Graduate Biomedical Engineering Society (GBMES) aims to help graduate students from biomedical engineering interact and learn new skills through various professional development, leadership development, and social events. ",
    "Description": "<p>The Graduate Biomedical Engineering Society (GBMES) section of NJIT aims to&nbsp;<span style=\"font-weight: 400;\">help graduate students learn more about biomedical engineering research by&nbsp;providing graduate students a platform to practice research presentations, ask scientific questions and have discussions related to current biomedical engineering research. Events will include invited speakers from the industry, tips for seeking employment, networking opportunities and more!&nbsp;</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/db74d52d-b716-49b8-bc2a-008c8b0527f62a83de5d-54d3-446b-95fe-02cc7c56f6fe.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/phidelt",
    "name": "Phi Delta Theta",
    "ShortName": null,
    "Summary": "Phi Delta Theta",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/rcl",
    "name": "Red Cross League",
    "ShortName": "RCL",
    "Summary": "The Red Cross League is a local collegiate chapter of the American Red Cross, and we work to better the city of Newark through education as well as community service.",
    "Description": "<p>Guided by the fundamental principles of the American Red Cross and its mission to prevent and alleviate human suffering in the face of emergencies by mobilizing the power of volunteers and the generosity of donors the NJIT Red Cross League, will learn, practice and exemplify humanitarian values through mission-related service projects. The club will plan and coordinate a minimum of three Red Cross mission-related service projects per year. The service projects will focus on preparedness, blood, and fundraising.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f9451784-1c67-4bd1-92af-9640a0f03e286a469c93-ea13-4bc3-b70e-1b8e6d867856.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sigmabetarho",
    "name": "Sigma Beta Rho",
    "ShortName": "SigRho",
    "Summary": "As an organization that prides itself on having individuals from every continent, ethnicity, and religion, we seek to foster enriching, cross-cultural discourse both amongst our members and within our campus communities. ",
    "Description": "<div id=\"x_yui_3_17_2_1_1549466110698_1338\" class=\"x_row x_sqs-row\">\r\n<div id=\"x_yui_3_17_2_1_1549466110698_1337\" class=\"x_col x_sqs-col-8 x_span-8\">\r\n<div id=\"x_block-27dfeda223a67cbc7f7c\" class=\"x_sqs-block x_html-block x_sqs-block-html\">\r\n<div id=\"x_yui_3_17_2_1_1549466110698_1336\" class=\"x_sqs-block-content\">\r\n<p id=\"x_yui_3_17_2_1_1549466110698_1335\" class=\"x_text-align-center\">Sigma Beta Rho is the nation&rsquo;s premier multicultural fraternity. We span over 50 universities with over 3,000 members nationwide. Our high standard of performance and maintaining the integrity of the values of our fraternity have contributed to our being one of the fastest growing fraternity of our kind. Central to our efforts in Sigma Beta Rho are our pillar: service to our society, our bond of brotherhood, and remembrance of our origins. If interested fill out the interest form at:&nbsp;https://linktr.ee/sigrho_newark.</p>\r\n</div>\r\n</div>\r\n</div>\r\n<div class=\"x_col x_sqs-col-2 x_span-2\">&nbsp;</div>\r\n</div>\r\n<div id=\"x_block-yui_3_17_2_5_1477517828904_9066\" class=\"x_sqs-block x_summary-v2-block x_sqs-block-summary-v2\">&nbsp;</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c4195f78-26a7-4a03-aa64-567b26db8c3fad34f5e9-2899-4884-ae38-1e3f8432cf5c.PNG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cypress",
    "name": "Cypress Hall",
    "ShortName": null,
    "Summary": "Cypress Hall is a coed facility that houses 450 first-year, sophomore, junior, senior and graduate students in two-room suites.",
    "Description": "<p>Cypress Hall is a coed facility that houses 450 first-year, sophomore, junior, senior and graduate students in two-room suites. Suites consist of single,&nbsp; double and triple rooms. Each suite has a&nbsp;shared bath. Rooms are furnished with a bed, dresser, desk, chair and lamp for each student.&nbsp;&nbsp;Each floor has two lounges with a microwave and sink.&nbsp;&nbsp;Double room measurements are&nbsp;22&rsquo;1/3&rdquo; x 13&rsquo;6&rdquo; (bedroom) and 6&rsquo;3/4&rdquo; x 7&rsquo;1/3&rdquo; (foyer).</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f152275c-580e-4869-8bed-de86daa1e19613bd99c0-cd28-420a-8d34-9e787945ac58.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ehsaas",
    "name": "Ehsaas Dance Team",
    "ShortName": "Ehsaas",
    "Summary": "The goal Ehsaas is to enlighten students about the different aspects of Indian culture. Our objective includes teaching students the meaning and  significance of various dance styles such as classical, folk, and  Bollywood. ",
    "Description": "<p>The goal Ehsaas is to enlighten students about the different aspects of Indian culture. Our objective includes teaching students the meaning and significance of various dance styles such as classical, folk, and Bollywood. We hope this association will allow students to compete and perform on various levels with different dance techniques.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/672574e0-3732-481a-aa7d-7b5c8485e0f2086ceee4-34b2-4c51-bc32-5137d7752997.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/russian",
    "name": "Russian Club",
    "ShortName": null,
    "Summary": "Our organization consists of Russians, other Russian-speaking nationals, and those, who are interested in Russian culture. Together, we share our passion with members of the NJIT community.",
    "Description": "<p><strong>You're Russian? You speak Russian? You're curious about Russia?</strong></p>\r\n<p>Then this is the right club for you.</p>\r\n<p>&nbsp;</p>\r\n<p>Our doors are open to anyone, not just Russians. In fact, the body of our club is currently 1/3 Russian. Many people are eager to find out more about such an interesting culture. Together, we engage in conversations, or rather debates sometimes, watch movies and TV-shows about Russia, cook Russian food, play Russian games... You name it - we do it. Come by one of our events, meet our friendly members. Chances are - you will stay.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/23590e90-0701-41a4-aabb-6f6395f37083d3cc9677-dedb-4c70-b312-89a35086db4c.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/chemistry-honor-society",
    "name": "Gamma Sigma Epsilon",
    "ShortName": "Chemistry Honor Society",
    "Summary": "The purpose of this organization shall be to recognize outstanding students demonstrating exceptional ability and interest in the field of chemistry. It aims to promote professionalism and scholarship in chemistry and the general welfare of its members.\r\n",
    "Description": "<p>The purpose of this organization shall be to recognize outstanding students demonstrating exceptional ability and interest in the field of chemistry. It aims to promote professionalism and scholarship in chemistry and the general welfare of its members.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/018bb9c1-2618-471c-876f-95cd38c5e26545d8ccec-f891-482e-903c-755f54352b16.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nasnjit",
    "name": "North African Society",
    "ShortName": "N.A.S.",
    "Summary": "North African Society is a cultural, non-political university society aimed at bringing together North Africans, Arabs, and non-Middle Eastern students at the university and giving an insight into North African culture, traditions, and history.",
    "Description": "<p>NAS aims to bring you a society that celebrates, unites, and shares the diverse cultures of North African countries: Morocco, Algeria, Tunisia, Libya, Egypt, and Sudan. The society hopes to bring you a year of excitement through our social, cultural, and charity events as well as collaborations with organizations. Come along to our events to meet and make lifelong friends and celebrate the varied cultures we bring as a society.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b5689067-27af-471a-9927-ddcf7ebf69521ffe0404-e53c-4369-beb1-7ee9f9f814aa.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sfhr",
    "name": "Students for Hunger Relief",
    "ShortName": "SFHR",
    "Summary": "Hunger Relief organization focused on holding on-campus food-packing events to alleviate malnutrition in the broader Newark community",
    "Description": "<p>We organize large-scale, on-campus initiatives to address hunger in Newark and connect NJIT students to the surrounding community. Our initiatives involve working with external charitable organizations to acquire food and then holding on-campus packing events where volunteers prepare hundreds of meals. The meals from past initiatives have included rice, chicken, beef chili, chicken curry, and salad, which we acquired from 501(c)(3) accredited organizations. Once all the food is packed, SFHR leads distribution efforts at various locations in Newark like Penn Station, Lincoln Park, Covenant House, and other shelters. Events are held monthly in Campus Center followed by a regular general body meeting.</p>\r\n<p>NJIT students have been instrumental in expanding the scope of hunger relief in the city of Newark in an informal capacity over the past year. What started out as a small team of four students has grown into a group of more than sixty committed members consistently and successfully delivering hundreds of meals on a monthly basis. Our group of volunteers is continuing to expand, and we encourage you to get involved as well!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e6e5fb44-09d0-483e-bc2b-c75515943b96b616730e-8ea3-45b1-8b84-982f8a77bb9d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/honors",
    "name": "John Martinson Honors Residence Hall",
    "ShortName": null,
    "Summary": "The Honors Residence is a coed facility housing 360 first-year, sophomore, junior, senior and graduate students in single and double rooms",
    "Description": "<p>The Honors Residence is a coed facility housing 360 first-year, sophomore, junior, senior and&nbsp;graduate students in single and double rooms. Each room is furnished with a bed, dresser,&nbsp;desk, chair and lamp for each student. The building features lounges on each floor, a dining&nbsp;facility, a convenience store and fitness center.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/cb4dbe78-ed49-45ad-ad2e-8658f6a34b6d7ae2d40e-38da-4f41-9c15-a1a72d9ffd9a.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/psanjit",
    "name": "Pakistani Student Association",
    "ShortName": "PSA",
    "Summary": "\r\nThe Pakistani Student Association (PSA) is a proud united ethnic Student Organization.\r\nThe objectives of this Organization are to promote awareness within and throughout the community, of Pakistan, and of its Customs and Cultures.\r\n",
    "Description": "<p><span style=\"font-weight: 400;\">We strive to insure accurate knowledge of Pakistani traditions to our members and outside affiliations. Pakistani Student Association is the voice of Pakistan at the New Jersey Institute of Technology. We strive for unity amongst our diverse community, faith within and throughout our organization, and discipline through knowledge of Pakistan, Land of the Pure, and to serve all University Students, Faculty and Staff, including International Students, in achieving the aforementioned goals.&nbsp;</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a308e9ad-fb93-492c-ac30-abaf59bf8efc6d3093ce-2ed2-479c-a750-b9d9862f2c20.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/girlup",
    "name": "Girl Up",
    "ShortName": null,
    "Summary": "We work to empower women across the world, because no country can truly develop with half of the population left behind. \r\n\r\nJoin our Discord to stay in touch! https://discord.gg/XJGzw5pTdd",
    "Description": "<p>We are a United Nations based organization working to empower women across the world, because no country can truly develop with half of the population left behind.</p>\r\n<p>Join our <a href=\"https://discord.gg/XJGzw5pTdd\">Discord</a> to stay in touch!&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/79eef459-8503-4952-ad61-748049c6ee6bd839eba2-26b8-4ab8-bec1-cef19b77c961.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/rha",
    "name": "Residence Hall Association",
    "ShortName": "RHA",
    "Summary": "All resident students are Residence Hall Association (RHA) members. The purpose of RHA is to represent all resident students in matters and affairs with the administration and other organizations concerning or affecting the quality of living on campus. ",
    "Description": "<p>All resident students are Residence Hall Association (RHA) members. The purpose of RHA is to represent all resident students in matters and affairs with the administration and other organizations concerning or affecting the quality of living on campus.&nbsp; RHA meets weekly in Cullimore Lecture Hall 1.&nbsp; Meeting times will be posted in your residence hall lobby area or you may contact your RA for additional information.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/8107b70f-c703-4b73-8a26-a7e54ed8dba22d599c5b-c079-4498-92ba-de94de09414e.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nadi",
    "name": "North American Disease Intervention",
    "ShortName": "NJIT NADI",
    "Summary": "We are a health screening organization dedicated to raising awareness of chronic illness and organizing health screenings in the Newark community. The purpose of these screenings is to empower residents with information about their health.",
    "Description": "<p>We are a passionate team of healthcare advocates, dedicated to empowering our Newark community with the knowledge and resources they need to take control of their health. Through organizing health screenings and raising awareness of chronic illnesses, we strive to give Newark residents the information they need to live their best lives. Join us in our commitment to improving the well-being of our community.</p>\r\n<p>&nbsp;</p>\r\n<p>Advisor: Dr. Stephen Pemberton</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/dea5c31d-f425-486f-8dd8-d0714fd3ec6c0a4b5641-0bcc-40fb-ac60-9c49491b9093.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hillel",
    "name": "NJIT Hillel",
    "ShortName": "Hillel",
    "Summary": "We are a student run group providing students with resources to engage with their community and celebrate Jewish culture and identity.",
    "Description": "<p>We are a student-run group providing students with resources to engage with their community and celebrate Jewish culture. Through club events celebrating Jewish holidays, Jewish culture and cuisine, the Hebrew language, and other traditions, our club provides a safe space for Jewish students and non-Jewish allies on campus; we are welcoming and friendly to all! Hillel has no denominational affiliation.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c109c490-badf-4402-83c0-d82c3678cc0c74976bbb-ee49-4921-8a9e-6764ca27a710.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pci",
    "name": "PCI Student Chapter ",
    "ShortName": "Precast/Prestressed Concrete Institute",
    "Summary": "A PCI Student Chapter is formed to:\r\nHelp acquaint students with the precast/prestressed concrete industry, Create networking opportunities for students with local precast industry, Provide learning travel opportunities for students to national convention",
    "Description": "<ul class=\"font_8\">\r\n<li>\r\n<p class=\"font_8\">Help acquaint students with the precast/prestressed concrete industry</p>\r\n</li>\r\n<li>\r\n<p class=\"font_8\">Further student education about design and construction,</p>\r\n</li>\r\n<li>\r\n<p class=\"font_8\">Foster interdisciplinary education and communication</p>\r\n</li>\r\n<li>\r\n<p class=\"font_8\">Administer industry scholarships</p>\r\n</li>\r\n<li>\r\n<p class=\"font_8\">Provide structure for industry competitions</p>\r\n</li>\r\n<li>\r\n<p class=\"font_8\">Provide learning travel opportunities for students to regional and national conventions, and</p>\r\n</li>\r\n<li>\r\n<p class=\"font_8\">Create networking opportunities for students with local precast industry.</p>\r\n</li>\r\n</ul>",
    "pfp": "https://se-images.campuslabs.com/clink/images/87933b5e-8dcf-4d5e-b6f3-db7f69e0bf616f9e998c-7d43-40da-8b2d-5bfaa9e9ec93.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/studentsenate",
    "name": "Student Senate",
    "ShortName": null,
    "Summary": "The NJIT Student Senate is the primary governing body for the undergraduate students of the university.",
    "Description": "<p style=\"text-align: left;\">Student Senate is dedicated to improving your NJIT experience. Our job on campus is to represent the student body. We act as liaisons between the students and university administrators to discuss academic policies and campus life. Student Senate is also responsible for the funding of student events and organizations. If you have any ideas, tips, or questions please let us know and we'd love to tackle the problem.</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\">View our reports, meeting minutes, documents, logos, and more <a title=\"Senate Drive\" href=\"https://bit.ly/313NBzd\">HERE</a>!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/1909c3bf-4ae9-415a-ad3d-d10c7b91950775cb1a51-fbdf-45bf-bbba-768c85e38131.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/art",
    "name": "Art Club",
    "ShortName": "Art Club",
    "Summary": "The Cre-Art-tivity club will serve the general student body population of undergraduate students with the purpose of creating avenues for students to express themselves artistically and beautifying the NJIT campus and the general Newark area.",
    "Description": "<p>The Art Club is a student organization dedicated to providing students with supplies and activities that allow them to explore their creative (visual) passions within a technical school. We're always interested in working with new mediums and connecting with the student body, and helping artists grow.</p>\r\n<p>Feel free to join our Discord and mailing list, and welcome to the club!</p>\r\n<p><a href=\"https://discord.gg/VHXYscn\" target=\"_blank\" rel=\"noopener\">Join our Discord</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/21a1bd8e-f61c-484a-b605-74f220c2cd84b16f7991-7eb1-48ac-9ae0-c0d8e0ce216d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/mcnairprogram",
    "name": "Ronald E. McNair Postbaccalaureate Achievement Program",
    "ShortName": "McNair Program",
    "Summary": "The Ronald E. McNair Post-baccalaureate Achievement program, awards grants to​ institutions of higher education for projects designed to provide underrepresented students with effective preparation for doctoral study.",
    "Description": "<p>The New Jersey Institute of Technology (NJIT) Ronald E. McNair Post-baccalaureate Achievement program is a comprehensive one. It is designed to help low-income and first-generation or underrepresented students majoring in Science, Technology, Engineering and Mathematics (STEM) disciplines to complete their bachelor's degree, and to enroll in post-baccalaureate degree programs, with the goal of obtaining doctoral degrees.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/d25c6376-aa33-488c-bc43-8e0a464c277d4dadeb57-8295-4671-a00b-e1a72e139b21.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/learningcommunities",
    "name": "Learning Communities",
    "ShortName": null,
    "Summary": "Modeling the building blocks of success!\r\n\r\nYour Learning Community will play a critical role in helping you get acclimated to university life and on track for a successful first year! Learn Together, Connect for Life!",
    "Description": "<p><strong>Modeling the building blocks of success!</strong></p>\r\n<p>&nbsp;</p>\r\n<p>As students transition to university life, their experience is more positive and successful if they get the support they need.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Learning Communities allow students to:</strong></p>\r\n<ul>\r\n<li>\r\n<p><em>Network with students and professors</em></p>\r\n</li>\r\n<li>\r\n<p><em>Collaborate with peers on projects in and outside of class</em></p>\r\n</li>\r\n<li>\r\n<p><em>Develop an understanding of how their learning experiences relate to their career goals</em></p>\r\n</li>\r\n<li>\r\n<p><em>Become involved in active learning experiences, including cooperative learning, service learning, and research projects</em></p>\r\n</li>\r\n<li>\r\n<p><em>Exposure to academic and career development resources</em></p>\r\n</li>\r\n<li>\r\n<p><em>Opportunities to showcase exceptional student work</em></p>\r\n</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p>Your Learning Community&nbsp;will play a critical role in helping you get acclimated to university life and on track for a successful first year!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7503102e-c51f-4a09-9be0-98e8ecd687e912b46cf0-0f21-4bf1-b5a3-7e31fa47804d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitmakerspace",
    "name": "Makerspace",
    "ShortName": null,
    "Summary": "The NJIT Makerspace is a rapid prototyping and collaboration facility where engineers, architects, designers, and scientists can create and test ideas, put theory into practice, and turn ideas into reality. ",
    "Description": "<p>This 21st-century prototyping, manufacturing, and collaborative space allows students, faculty, and industry partners, to build physical systems in a functional and inspirational environment.</p>\r\n<p><strong>\"<em>If you can dream it, you can make it at NJIT\"</em></strong></p>\r\n<p>The 10,000 square-foot Makerspace is the largest of its kind in New Jersey and houses the industrial-grade tools and technologies that today&rsquo;s STEM students must master in order to become tomorrow&rsquo;s innovators and leaders. It provides them a venue where they can test ideas, visualize, create prototypes, and apply complex technologies, machines, and materials used in state-of-the-art manufacturing. Through this process all participants gain real-world experience across an array of industries. Among other functions, the Makerspace offers equipment and devices for 3D printing, additive manufacturing, material cutting and shaping, metrology, visualization, computing, emulation, and simulation.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pwc",
    "name": "Peer Wellness Coaching",
    "ShortName": null,
    "Summary": "Peer Wellness Coaching is an opportunity for undergraduate students to maximize their well-being! ",
    "Description": "<p>Specially trained student coaches are available to meet individually and in groups to discuss health and wellness goals and empower their peers to achieve them. This program is funded in part by the Healthcare Foundation of New Jersey and student coaches are supervised by NJIT&rsquo;s Center for Counseling and Psychological Services and Campus Health Services. (Coaching is NOT professional counseling, health services, or advising; so if you need or want these services, then a coach can connect you to them.)</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitasme",
    "name": "American Society of Mechanical Engineers",
    "ShortName": "ASME",
    "Summary": "The American Society of Mechanical Engineers (ASME) is an American professional association that promotes the art, science, and practice of multidisciplinary engineering and allied sciences around the globe.",
    "Description": "<p>The&nbsp;<strong>American Society of Mechanical Engineers</strong>&nbsp;(<strong>ASME</strong>) is an American&nbsp;professional association&nbsp;that, in its own words, \"promotes the art, science, and practice of multidisciplinary engineering and allied sciences around the globe\" via \"continuing education, training and&nbsp;professional development, codes and&nbsp;standards,&nbsp;research, conferences and publications, government relations, and other forms of outreach.\" ASME is thus an&nbsp;engineering society, a&nbsp;standards organization, a&nbsp;research and development&nbsp;organization, an advocacy organization<span style=\"font-size: xx-small;\">,</span>&nbsp;a provider of training and education, and a&nbsp;nonprofit organization. Founded as an engineering society focused on&nbsp;mechanical engineering&nbsp;in North America, ASME is today multidisciplinary and global.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/866e6c01-cab6-47f8-b007-47fc95753bcfcdcbfdb0-6b6d-4180-bd91-e6238f363657.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nsa",
    "name": "Nepali Student Association ",
    "ShortName": null,
    "Summary": "Nepali Student Association ",
    "Description": "<p><strong>Mission Statement:</strong> The Nepali Student Association (NEPSA) at NJIT is dedicated to fostering a supportive and inclusive community for students of Nepali heritage and anyone interested in Nepalese culture. Our mission is to celebrate our rich cultural heritage, promote cultural awareness, and provide a platform for networking, academic support, and personal growth.</p>\r\n<p><strong>What We Do:</strong></p>\r\n<ul>\r\n<li><strong>Cultural Events:</strong> We organize various cultural events throughout the year, including traditional festivals like Dashain, Tihar, and Holi. These events are a vibrant showcase of Nepali music, dance, food, and traditions.</li>\r\n<li><strong>Social Gatherings</strong></li>\r\n<li><strong>Community Service</strong></li>\r\n<li><strong>Networking Opportunities</strong></li>\r\n<li><strong>Support System:</strong> We offer a strong support system for new students, helping them acclimate to university life and navigate academic and personal challenges.</li>\r\n</ul>\r\n<p><strong>Join Us:</strong> Whether you are of Nepali descent or simply interested in learning more about Nepalese culture, the Nepali Student Association at NJIT welcomes you. Join us to celebrate our heritage, make new friends, and enrich your university experience.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Discord link:</strong>&nbsp;https://discord.gg/GGkXahR6</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/fedede25-0b40-4930-a03e-2a6dc6f006a33143053b-0868-4f3c-bf5f-32a5df8548ad.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/iise",
    "name": "Institute of Industrial and Systems Engineers",
    "ShortName": "IISE",
    "Summary": "Professional Organization for Industrial Engineering Majors",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/idsa",
    "name": "Industrial Designers Society of America",
    "ShortName": "IDSA",
    "Summary": "The Industrial Design Society of America offers workshops, lectures, career development, portfolio building, field trips, and design competitions to all design students. Our organization seeks to provide all of our members with a supportive network. ",
    "Description": "<p>\"If architects design the house, then industrial designers design everything inside.\"</p>\r\n<p>Industrial design surrounds the world around us, every product you encounter and interact with is the result of a rigorous design process. A combination of art, design, engineering, and critical problem solving, Industrial Design lies at the crossroads of dozens of other fields.&nbsp;</p>\r\n<p>IDSA is the only professional society of Industrial Designers in the United States. This organization works to advance the practice of Industrial&nbsp;Design through education, information, community, and advocacy.</p>\r\n<p>NJIT's chapter has been around for over 10 years and is growing fast to encompass all that this field has to offer. Offering workshops, lectures, career development, portfolio building, field trips, and&nbsp;design competitions to all design students, our organization seeks to bridge the gap between art and engineering.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/061fb3a1-8a9a-4955-aeab-b69f7a5f519f1b5ce8c1-0d2a-4ee6-8478-6bc8afdc3ef5.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cssa",
    "name": "Chinese Students and Scholars Association (CSSA)",
    "ShortName": "CSSA",
    "Summary": "Chinese Students and Scholars Association (CSSA) for graduate students.\r\n",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/2e79d0d1-1319-492e-92be-d565fb415d4741460135-4fa9-4eb5-9eae-fa10d9146e35.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/integritycouncil",
    "name": "Highlander Integrity Council",
    "ShortName": null,
    "Summary": "TBD",
    "Description": "<p>TBD</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/alpha",
    "name": "Alpha Phi Alpha Fraternity Inc.",
    "ShortName": null,
    "Summary": "Alpha Phi Alpha Fraternity",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/alpha_sig",
    "name": "Alpha Rho Chapter of Alpha Sigma Phi Fraternity",
    "ShortName": "Alpha Sig",
    "Summary": "A group of Gentlemen and Scholars who seek to Better the Man through the creation and perpetuation of brotherhood founded upon the values of character: Silence, Charity, Purity, Honor, and Patriotism. ",
    "Description": "<p>Founded nationally in 1845 and locally in 1921, Alpha Sigma Phi seeks to Better the Man through our five values of character: Silence, Charity, Purity, Honor, and Patriotism. A brotherhood that sticks together and rises much like the Phoenix of legend.</p>\r\n<p>Causa Latet Vis Est Notissima.&nbsp;<em>The Cause is Hidden, the Results Well Known.</em></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4c504432-2710-461a-b39c-ef09548e20e921a073af-7ce1-43eb-9d64-618f081850d1.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/akpsi",
    "name": "Alpha Kappa Psi",
    "ShortName": "AKPsi",
    "Summary": "Alpha Kappa Psi is a Professional Co-ed Business Fraternity founded in 1904 with the purpose of developing its members into principled business leaders.",
    "Description": "<p>Alpha Kappa Psi is a Professional Co-ed Business Fraternity founded in 1904 with the purpose of developing its members into principled business leaders. Originally founded by 4 men at New York University, the professional organization now has over 298,000 initiated members at 219 universities in 4 countries. Alpha Kappa Psi has grown to be the oldest and largest business fraternity in the world! With an extensive network of alumni, members are able to land opportunities at some of the most profitable companies in the world. As one of the best professional co-ed business fraternities, we are truly preparing our brothers for a life of success.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/73756419-c046-42bb-98f0-66b63e157b92e247aaff-9599-48b1-93e8-f6eb0b1622d0.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/lto",
    "name": "Lambda Tau Omega Sorority Incorporated",
    "ShortName": "LTO, Enchanting Mermaids",
    "Summary": "Lambda Tau Omega Sorority Inc. is a non-profit Greek letter organization that was founded on October 9th, 1988 at Montclair State University. Our mascot is the Enchanting Mermaid and our motto is womyn empowerment.  We are the Trilogy Gamma Chapter.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/0cbd0211-9bb9-4acd-bcc2-89f11cd42a3f269b49c9-120d-43a1-ac62-900555a56f37.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/apx",
    "name": "Alpha Rho Chi",
    "ShortName": "APX",
    "Summary": "Alpha Rho Chi is a co-ed professional fraternity for architecture and the allied arts.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/ccce0302-e2b1-4a6b-97e4-0b00cf6988653ab05e16-b156-4c4f-bca7-895bd5425907.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tau-delt",
    "name": "Tau Delta Phi",
    "ShortName": "Tau Delt",
    "Summary": "Tau Delta Phi aims to culture men of quality regardless of their race, religion, or identity.",
    "Description": "<p>Tau Delta Phi is one of the oldest chapters at NJIT founded in 1947 at the then Newark College of Engineering.&nbsp;From its inception, Tau Delta Phi has demonstrated its progressive place within the fraternal&nbsp;movement. Its exceptional direction has led Tau Delta Phi to be a fraternity of firsts: the first to end fraternal segregation, the first modest sized national fraternity to remove pledging and operate under a developmental training model for all members, and one of the first organizations to be accepting of men based solely on the content of their character, not the color of their skin, the way they choose to worship or not worship God, the country their family comes from, or even who they choose to fall in love with.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f6ca6a9a-d5da-477e-b1ae-801fc75c6c4a3d181ba9-e9ef-434e-a975-91a9b1c3ed82.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/psiupsilon",
    "name": "Psi Upsilon",
    "ShortName": "Psi U",
    "Summary": "Psi Upsilon is a social fraternity, one of the oldest in the United States. Our deep rooted brotherhood offers great alumni connections, leadership and employment, and community service opportunities. We are the Alpha Omicron chapter.",
    "Description": "<p>Psi Upsilon is a social fraternity, one of the oldest in the United States founded in 1833. Our deep rooted brotherhood offers great alumni connections, as well as leadership, employment, and community service opportunities.&nbsp;We are the Alpha Omicron chapter.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c2fa42e3-5562-46c4-a5a5-2161d8f712febf8371fd-1597-4969-932d-fc0df3ca6036.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/chorus",
    "name": "NJIT Community Chorus",
    "ShortName": "Chorus",
    "Summary": "The NJIT Community Chorus seeks to teach its members about music theory and explore a diverse range of music genres in performances so that we can bring different styles to the campus.",
    "Description": "<p style=\"margin: 0in; margin-bottom: .0001pt; background: white;\">The NJIT Community Chorus is a vocal instrumental ensemble at NJIT. We sing songs from different genres, from Gregorian chants to 21st century atonal music. We want to explore different styles of harmony, tonality and expression that composers from across time have tried to evoke in their music. In addition to classical music, we will sing folk music from around the world, jazz and gospel. Join our choir family in singing and lend your voice to the beautiful harmonies!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/502c7410-58d9-4ac2-af8b-ff383b9ffc1cccc92906-e59b-4790-acfd-92c81df7f0b8.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ywccmp",
    "name": "YWCC Mentoring Program",
    "ShortName": "YWCCMP",
    "Summary": "An extracurricular activity welcome to all students interested in further developing academically and professionally in the field of computing.",
    "Description": "<p>The <strong>YWCC Mentoring Program</strong> is an extracurricular activity welcome to all students interested in further developing academically and professionally in computing.</p>\r\n<p>As a student-run program, mentors will be working together to create dynamic and interactive workshops, panels, and discussion sessions relating to topics in career development, collaborative projects, personal branding, networking, and opportunities inside and outside of NJIT.</p>\r\n<p>We encourage and welcome students who are not mentors or mentees to attend our general body meetings and progress further in the realm of computing. Altogether, every student will gain the skills necessary to be leaders, innovators, and accomplish their goals by having a focus on professional development, academic success and mentoring relationships.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong><span style=\"text-decoration: underline;\">Mentors</span></strong></p>\r\n<p>We are looking for mentors who aren't experts, but have a passion for computing, learning, contributing to YWCC, and are open-minded. Peer mentors will be working together to create dynamic and interactive workshops, panels, and discussion sessions relating to topics in career development, academics, projects, personal branding, networking, and opportunities inside and outside of NJIT. If you are interested in working in a collaborative environment with other tech enthusiasts, join now :)</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"text-decoration: underline;\"><strong>Mentees:</strong></span></p>\r\n<div class=\"x_x_container\">\r\n<ul>\r\n<li>Unsure of your major?</li>\r\n<li>How to get started in the professional industry?</li>\r\n<li>Need course assistance?</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p>Our <strong>purpose</strong> is to assist students to continue their growth by improving on their current skills and building new ones in the field of computing. Students attending the Ying Wu College of Computing voluntarily apply to become mentors. Many of them have been in your footsteps and it's with their enthusiasm they share their experiences in the professional industry, college life, and obstacles they have gone through to excel in the computing realm. This is a flexible program to meet your needs and help you get a seat at the table.</p>\r\n</div>\r\n<div class=\"x_x_container\">&nbsp;</div>\r\n<div class=\"x_x_bg-light x_x_pt-5 x_x_px-5 x_x_text-center x_x_text-md-left\">\r\n<div class=\"x_x_row\">\r\n<div class=\"x_x_col-md-6 x_x_mt-md-0 x_x_mt-3 x_x_mb-4\">&nbsp;</div>\r\n</div>\r\n</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a9083a21-e523-4841-b874-018261ed185b0927da5a-f1e2-4496-889a-54aca218004d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/oak",
    "name": "Oak Hall",
    "ShortName": null,
    "Summary": "Oak Hall is a coed apartment facility that houses 180 full-time sophomore, junior, senior and graduate students in two person rooms and three, four-person apartments. \r\n",
    "Description": "<p>Oak Hall is a coed apartment facility that houses 180 full-time sophomore, junior, senior and&nbsp;graduate students in two person rooms and three, four-person apartments. Each room/apartment is furnished with a bed, dresser, wardrobe closet, desk, chair and lamp for each&nbsp;student. The rooms have stove tops, refrigerators, kitchen tables and chairs; the three and&nbsp;four person apartments also have ovens. The eighth floor is designated for graduate students.&nbsp;Two-person apartments end in room numbers 02, 04, 05, 06 and 07; three-person apartments&nbsp;end in 00, 01 and four-person apartments end in 08 and 09.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/fa2dd09d-1bbf-4256-8afe-7885df04f18bea90e85b-b06e-4ba4-a43e-2e59ffa101f4.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/foodpantry",
    "name": "Food Pantry",
    "ShortName": null,
    "Summary": "The NJIT Food Pantry aims to help students with food insecurity, promote nutrition, and support student success through providing pantry staples to users, hosting food drives within the community, and educating students on assistance programs.  ",
    "Description": "<p>The NJIT Food Pantry aims to help students with food insecurity, promote nutrition, and support student success through providing pantry staples to users, hosting food drives within the community, and educating students on assistance programs.&nbsp;&nbsp;</p>\r\n<p>Food Pantry appointments can be made for the first time by emailing foodpantry@njit.edu.</p>\r\n<p>Students will need to bring their Student ID with them and may visit the pantry once per week. Hours during break periods (winter/spring/summer) may vary and are appointment only.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b2a9634b-3541-4523-a221-03d3a68a2bcaa41e70a0-defe-4bf1-ab96-de79da48f576.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/phd",
    "name": "PhD Club",
    "ShortName": null,
    "Summary": "PhD Club",
    "Description": "<p>PhD Club is a dynamic hub dedicated to guiding doctoral students through every facet of their PhD. Our mission encompasses multifaceted support, spanning various stages of the program. By organizing academic and professional exposure opportunities, we empower members to expand their horizons. A collaborative platform ignites knowledge exchange and celebrates academic triumphs. Additionally, we serve as a resource for undergraduates and master's students aspiring to pursue a doctoral degree, offering insights, advice, and a roadmap to success in academia. Join us to thrive in a nurturing community that amplifies growth&nbsp;and&nbsp;knowledge.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/442edd75-df6c-47ca-9cbc-3f924e1361597c25e931-8b63-4d7c-9029-2b9fef551442.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/knit",
    "name": "Knit N' Crochet Club",
    "ShortName": "Knit N' Crochet",
    "Summary": "In this organization, we come together to learn how to knit and crochet. We create projects such as blankets, hats, and scarves and donate these handmade garments to charities in Newark like the soup kitchen and Apostles Homeless shelter. ",
    "Description": "<p>In this organization, we come together to learn how to knit and crochet. We create projects such as blankets, hats and scarves and donate these handmade garments to charities in Newark like the soup kitchen and Apostles Homeless shelter. We also work on various service projects throughout the semester such a toiletry drives and food drives to give back to the NJIT and Newark community.</p>\r\n<p>&nbsp;</p>\r\n<p>Join our Discord! <a href=\"https://discord.com/invite/DGvg2rjZuJ\">https://discord.com/invite/DGvg2rjZuJ</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/25a6ab04-629e-4531-a032-5eb728821fede7c07b33-067b-4937-8957-55cdceabb2bc.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/humed",
    "name": "Medical Humanities Club",
    "ShortName": "HuMed",
    "Summary": "The Medical Humanities Club's main goal is to educate our members to stand up against injustices in the medical field and help procure the best possible outcomes as future patients and/or medical providers. ",
    "Description": "<p>The purpose of the medical humanities club is to facilitate constructive dialogue regarding bioethics and medical humanities. We are dedicated to addressing common injustices in healthcare through meetings with expert guest speakers, volunteer opportunities, and drafting legislative proposals.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/42f0e1e9-5f91-4ae0-9396-831d034905b268605f0a-a1e8-48fb-8b1c-3aab96974b53.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitawwa",
    "name": "American Water Works Association Student Chapter",
    "ShortName": "AWWA",
    "Summary": "AWWA is dedicated to helping students build connections in the water industry. Water plant tours, volunteer park/stream clean ups and professional events are some opportunities from which students can learn more about water and taking care of our planet.",
    "Description": "<p>AWWA Student Chapter at NJIT works closely with the civil engineering department and hopes to bring students from other majors. Our members have interest in the water industry including water supply, distribution, and quality. Through our events, members learn more about water as we emphasize on our dedication to take care of our environment. Our members volunteer at nearby parks or streams, visit water and wastewater treatment plants which helps them broaden their knowledge and experiences. Our professional events also help our members build connections&nbsp;and find job opportunities.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/98ff7920-fd66-44e4-aeb1-85f748e6d9da486a8fd5-bb7d-43a7-99be-33925d76ddea.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/bookclub",
    "name": "Book Club",
    "ShortName": null,
    "Summary": "We aim to promote the joy of reading and create a space for individuals to delve into various genres, authors, and literary works. We believe in the power of books to inspire, educate, entertain, and be a form of escapism in someone's everyday life.",
    "Description": "<p>Join the discord:https://discord.gg/T358H3f65p</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/dc7454a4-3d0f-48b1-b2fd-c1ed5b59e3b60b16fa9f-19ac-49ec-a9bc-474718985b9d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cywoodhallcouncil",
    "name": "CyWood Hall Council",
    "ShortName": "CyWood Hall Council",
    "Summary": "The governing body for the residents of Cypress and Redwood Hall ",
    "Description": "<p>The governing body for the residents of Cypress and Redwood Hall</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/vso",
    "name": "Veteran Student Organization",
    "ShortName": "VSO",
    "Summary": "The Veteran Students Organization is dedicated to providing support for NJIT's student veterans and military affiliated students.",
    "Description": "<p>&nbsp;</p>\r\n<p>The Veteran Students Organization (VSO) at NJIT is a chapter of Student Veterans of America (SVA) which is the premier organization leading service, research, programs, and advocacy for veterans in higher education.&nbsp; Our mission at NJIT is to bridge the gap between military-connected students and civilian life.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0f8d9b65-1b3a-490d-8795-242edec9b34a9fe14e01-b4ef-4636-83ce-6954d6dda8db.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/umr",
    "name": "United Mission for Relief & Development",
    "ShortName": "UMR",
    "Summary": "The purpose of this organization is to implement targeted, cost-effective relief and development programs that improve lives.",
    "Description": "<p><span style=\"font-weight: 400;\">The purpose of this organization is to implement targeted, cost-effective relief, development programs that improve lives and to provide students an outlet for giving, community service, and a global impact on poverty. UMR believes that everyone across the world is entitled to clean water, health and dental care, and to have access to basic social services no matter their race or religion. The UMR NJIT will serve local communities and support UMR&rsquo;s international initiatives through advocacy, training and fundraising.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/09cb28c5-837f-4a5e-886d-1b127a84cd323b49d12a-d7cb-48b9-8fc2-463b42bd8dfd.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/business-club",
    "name": "Business Masterminds",
    "ShortName": null,
    "Summary": "The purpose of the Business Masterminds Club is to benefit and support the NJIT undergraduate and graduate student community by introducing, exposing, and educating them on practical skills applied to and in the different aspects of business.",
    "Description": "<p><span id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_m_-4921927640064410503gmail-m_-1289275094144452114gmail-docs-internal-guid-b39a6226-7fff-7aa7-19c1-76765277691c\">Business Masterminds is here to benefit and support the NJIT undergraduate and graduate student community by introducing, exposing, and educating them on practical skills applied to and in the different aspects of business across various sectors and disciplines.</span>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Meetings will include general discussion meetings, workshops and professional panel speaking/networking events with guest speakers, competitions, and more! We learn all about the technical business terms and concepts in our classes, but we want our members to apply what they learn and in order to do that we plan to have workshops, field trips, and more to help apply what is learned!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Don't forget to follow us on Instagram and participate in our giveaways this semester to get gift cards and Business Masterminds merch!!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/242367bb-3e67-43b2-a2de-98e505b7bcbab2af9f6a-6974-4a8c-a976-428c71bb7c5c.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tsa",
    "name": "Turkish Student Association",
    "ShortName": "TSA",
    "Summary": "Turkish Student Association",
    "Description": "<p>Welcome to our Turkish Student Association at NJIT! Whether you&rsquo;re a Turkish student, an alum, or simply curious about Turkish culture, you&rsquo;ve found your home away from home. Our vibrant community is dedicated to celebrating and sharing the richness of Turkish heritage while fostering lasting friendships and connections.</p>\r\n<p>At TSA, we believe in creating a warm and welcoming environment where everyone feels valued and included.&nbsp;</p>\r\n<p>Aside from Highlander Hub, our Instagram account is your go-to source for staying updated on upcoming events, so fo ahead and give us a follow @njit_tsa.&nbsp;</p>\r\n<p>Join us in embracing Turkish culture, forging lifelong connections, and making memories that will last a lifetime. We can&rsquo;t wait to meet you and welcome you into the TSA family! Sevgiler, TSA Ailesi 🇹🇷💙</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3917e1c7-c623-4d98-abdc-9d24796f01166f9a0d15-4a3a-47c2-bffc-1dfb95ce5419.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/firstfellows",
    "name": "First Fellows",
    "ShortName": null,
    "Summary": "First Fellows is an organization with the purpose of helping incoming and undergraduate first-generation college students transitioning through their undergraduate years at New Jersey Institute of Technology.",
    "Description": "<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">The purpose of this organization is to provide guidance to incoming and undergraduate students that identify or are recognized as first generation. Providing the appropriate materials and resources for the incoming and undergraduate first-generation students will make their transition into college easier. For incoming and undergraduate students, this organization will provide constant and consistent guidance, and eventually mentorship, to aid them for any college related needs. </span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4c49774f-3133-4b27-9700-5f29250d12959ade469e-d136-4bac-a6f5-f907db906950.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pikappaphi",
    "name": "Pi Kappa Phi",
    "ShortName": null,
    "Summary": "Pi Kappa Phi",
    "Description": "<p>Welcome to Phi Kappa Phi Fraternity, where academic excellence and brotherhood converge. Since our establishment in 1948, we have been committed to fostering a community of driven individuals who strive for scholarly achievement, leadership, and service. Through our diverse range of events, mentorship programs, and philanthropic initiatives, we empower our members to excel both academically and personally, forming bonds that last a lifetime. Join us in our pursuit of knowledge, camaraderie, and making a positive impact on the world. Together, we embody the spirit of Phi Kappa Phi - a beacon of intellectual curiosity and lifelong learning.<br /><br /></p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e6e8d216-2431-4903-a4ea-00b2d3567774ae3f72ff-3de1-498a-82bb-cadc8cdbe5cb.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tke",
    "name": "Tau Kappa Epsilon",
    "ShortName": "TKE",
    "Summary": "Tau Kappa Epsilon is a social fraternity that promotes love, charity, and esteem.",
    "Description": "<p><strong>Tau Kappa Epsilon</strong></p>\r\n<p>Tau Kappa Epsilon is a men&rsquo;s social fraternity with hundreds of prominent alumni and was established January 10, 1899, at Illinois Wesleyan University. With more than 250 active chapters and colonies in the United States and Canada, Tau Kappa Epsilon&rsquo;s membership is as diverse and unique as the collegiate and universities in which we reside. There isn&rsquo;t a proper blanket statement that is able to capture the essence of what a member of Tau Kappa Epsilon, or rather a &ldquo;Teke&rdquo; is&mdash;that&rsquo;s up to you to decide.</p>\r\n<p>Men like Ronald Reagan, Steve Forbes, Danny Thomas, Conrad Hilton, and Charles R. Walgreen actively sought to better themselves, and in return, better the Fraternity.&nbsp;</p>\r\n<p><br /><strong>Have you heard about our Commuter Rush Education Program?</strong></p>\r\n<p>At Tau Kappa Epsilon we believe that regardless of your residency status whether it's on-campus or as a commuter, that it shouldn't stop you from being able to join our fraternity and becoming part of our brotherhood. Be sure to follow our Instagram page <a href=\"https://www.instagram.com/njittke/\"><strong>@njittke</strong></a> for updates about our Rushing process and events we'll be hosting at NJIT so that you can meet the brothers!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7848be33-edf4-4ce9-9b28-d3fbf8e22299506c7137-b15a-4232-8eda-428d6625fea1.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pwcsc",
    "name": "Professional Women in Construction NJ Student Chapter",
    "ShortName": "PWCSC",
    "Summary": "Professional Women in Construction Student Chapter",
    "Description": "<p>Professional Women in Construction Student Chapter aims to&nbsp;<span style=\"font-weight: 400;\">assist women studying/working in the architecture, construction, and engineering industries.&nbsp;We want to create a community that promotes gender diversity in traditionally male-dominated fields.&nbsp;Our organization offers personal/professional mentorship, opportunities for field practices(shadow days), so students get a feeling of what the work environment feels like in their field of interest, and events like Site Tours, Lunch and Learn, and Networking Days.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3c5ca2bf-614c-4a1f-976e-f9b8997277cc3a0bd778-ca5f-4938-ba6a-65f011478122.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/pep",
    "name": "Highlander Pep Band",
    "ShortName": "Pep Band",
    "Summary": "The highlander pep band is a student-run group of musicians founded on the premise of bringing music to athletic events on campus. ",
    "Description": "<p style=\"margin: 0in 0in 0.0001pt; vertical-align: baseline; text-align: left;\"><span style=\"font-size: 14.0pt; font-family: 'Proxima Nova',serif; color: black;\"><a title=\"2020-2021 Interest Form\" href=\"https://docs.google.com/forms/d/e/1FAIpQLScq_UMsRipb2ZmTFXtlf0jlKJs9OPbgS4n77GbnabbYXJxSmw/viewform?gxids=7628\">https://docs.google.com/forms/d/e/1FAIpQLScq_UMsRipb2ZmTFXtlf0jlKJs9OPbgS4n77GbnabbYXJxSmw/viewform?gxids=7628</a></span></p>\r\n<p style=\"margin: 0in 0in 0.0001pt; vertical-align: baseline; text-align: left;\">&nbsp;</p>\r\n<p style=\"margin: 0in 0in 0.0001pt; vertical-align: baseline; text-align: left;\"><span style=\"font-size: 14.0pt; font-family: 'Proxima Nova',serif; color: black;\">Instrumentation includes but is not limited to; flutes, clarinets, alto saxophones, baritone saxophone, trumpets, trombones, tuba, guitar, snare drums and bass drum. The pep band plays traditional stand tunes to pop music to jazz. The pep band plays at men's and women's basketball games, highlander thon and homecoming events. As the pep band grows and evolves, we'd love to play at other school events such as open houses, new student orientation and accepted students day.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ef59dcfb-fbb9-41e5-88ad-07d0d5a5edf22c56d30d-7a24-48e5-8992-b1cc85141f38.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/laurel",
    "name": "Laurel Hall",
    "ShortName": null,
    "Summary": "Laurel Hall is a coed facility that houses 582 sophomore, junior, senior and graduate students in two-room suites. Suites consist of two double rooms, one double room with a single room, or two double rooms with a single",
    "Description": "<p>Laurel Hall is a coed facility that houses 582 sophomore, junior, senior and graduate students in two-room suites. Suites consist of two double rooms, one double room with a single&nbsp;room, or two double rooms with a single. Single rooms are reserved for returning upper class&nbsp;students. Suites are furnished with a bed, dresser, desk, chair and lamp for each student.&nbsp;Each suite has a shared bathroom. Common lounges and kitchenette facilities are located&nbsp;on the first floor. The approximate double room measurements are 12&rsquo; x 16&rdquo; (bedroom) and&nbsp;8&rsquo; x 12&rdquo; (foyer).</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a98a7a37-a23b-4c65-8050-e56e2e5a2ed72fa0d7e7-be8a-4c3b-a7f5-77c91bf36d1e.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/saavan",
    "name": "Saavan",
    "ShortName": null,
    "Summary": "NJIT's first South-Asian a cappella group.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/9cfb2840-5589-4531-9f54-dd0e77d4ae5efb7b41a7-aadf-40f8-9280-8d1c83e69e5c.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/munclub",
    "name": "Model United Nations Club",
    "ShortName": "MUN Club",
    "Summary": "The Model United Nations club encourages students to engage in the ever-changing field of international relations and polish their public speaking skills by simulating the United Nations. ",
    "Description": "<p><span style=\"font-weight: 400;\">The purpose of the </span><span style=\"font-weight: 400;\">Model United Nations</span><span style=\"font-weight: 400;\"> Club shall be to benefit the NJIT community by engaging the student body in international relations through public speaking and improve their public speaking skills while participating in Model United Nations tournaments both nationally and internationally. We believe that students can broaden their horizons by learning about other cultures and countries.</span></p>\r\n<p><br /><br /></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e0067c42-039a-4b96-b052-accbf4dcb84c12c4da88-469d-4465-9a6e-051b9789c07c.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/dance",
    "name": "NJIT Dance Team",
    "ShortName": null,
    "Summary": "The NJIT Dance Team is the official dance team of the university's athletic department. With each performance, the NJIT Dance Team hopes to spread the values of spirit, tradition, and culture throughout the NJIT community.",
    "Description": "<p><span style=\"font-weight: 400;\">The NJIT Dance Team is the official dance team of the university's athletic department. They serve as Ambassadors for NJIT and represent the university at various athletic and community events around campus. Coming from diverse performance and athletic backgrounds, they have created a diverse group of dancers with varying strengths. The NJIT Dance Team can be found at every home men&rsquo;s and women&rsquo;s basketball game, bringing spirit to the crowd with their energetic hip-hop routines. In addition, the team embraces weekly performances during their season by also appearing at numerous philanthropic events and showcases. With each performance, the NJIT Dance Team hopes to spread the values of spirit, tradition, and culture throughout the NJIT community. </span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/5e106f71-7694-4170-9fdd-fc9bfba81336aecedb2a-e852-4e70-9194-934761cc79bf.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/fy",
    "name": "First Year Students - for Student Senate",
    "ShortName": null,
    "Summary": "First Year students",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/dbb504c2-e1b4-4cd4-b797-5a4e5db8f4cb0cbfc598-57df-4f3e-b623-0db60df8f822.gif"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hllc",
    "name": "Hispanic and Latinx Leadership Council",
    "ShortName": "HLLC",
    "Summary": "New Jersey Institute of Technology has launched the Hispanic and Latinx Leadership Council (HLLC) to propel its mission of enrolling more Hispanic and Latinx students and achieve its goal of becoming a Hispanic-serving institution.",
    "Description": "<p>The 11-person council &mdash; which features leaders in business and community advocacy, including seven alumni &mdash; will advise, counsel and support NJIT&rsquo;s drive to increase its percentage of Hispanic and Latinx undergraduates from 20% to 25% by 2025 and thereby qualify to earn the federal designation of being Hispanic-serving. In addition, the HLLC will seek to deepen relationships with Hispanic and Latinx alumni, businesses and organizations.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/phietasigmafynationalhonorsociety",
    "name": "Phi Eta Sigma - National First Year Honor Society",
    "ShortName": "PES -FYHS",
    "Summary": "To encourage and reward high scholastic achievement among members of the first year cohort.",
    "Description": "<p>First-year students who are in good academic and disciplinary standing, have a 3.5 GPA or higher, and are enrolled full time are eligible (reach out to PhiEtaSigma@njit.edu if you have questions).&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Inducted members benefit from access to scholarships (over $300,000 awarded annually across the nation!), a national and local network of leaders and peers, personal and professional development and of course national recognition of academic excellence!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0e6079ae-a781-4d9f-b9f1-014e426d764d99afc54b-1716-4e58-87d9-09dca9942b3e.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/iac",
    "name": "Entrepreneur Society",
    "ShortName": "IAC",
    "Summary": "We provide students interested in entrepreneurship with the information and tools required to start their own business. From networking to pitch practice to hands-on trips. Students will be given the support and resources needed. ",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/c8051dd8-d505-4d38-957f-d098a809c298e9f68862-8a5c-4286-b081-dc2f56d69470.PNG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/psa",
    "name": "Polish Student Association",
    "ShortName": "PSA",
    "Summary": "The Polish Student Association (PSA) is committed to sharing Polish values, customs, and traditions with the NJIT community.  ",
    "Description": "<p><span style=\"font-weight: 400;\">&nbsp;&nbsp;&nbsp; The Polish Student Association (PSA) is committed to sharing Polish values, customs, and traditions with the NJIT community.&nbsp;&nbsp;</span></p>\r\n<p><span style=\"font-weight: 400;\">&nbsp; &nbsp;</span>&nbsp; &nbsp; We represent the university at cultural events, most notably the Pulaski Parade in New York City, the largest Polish parade on the East Coast, where we proudly walk down 5th Avenue, holding up our club banner and waving our flags for those watching on the sides.&nbsp;&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">&nbsp;&nbsp;&nbsp; Above all, we seek to build a dedicated and involved community through our social events and cultural celebrations, especially Wigilia and Wielkanoc, where we all gather around to celebrate our shared heritage and reflect upon the progress we have made as a club.</span></p>\r\n<p>&nbsp;&nbsp;&nbsp; To learn more about what we do, reach out to us by email (polish@njit.edu), our GroupMe (link below), or our Instagram page (@njitpsa). We hope to see you at our upcoming events!</p>\r\n<p>Our default contact is through the&nbsp;polish@njit.edu email and the advisor for our organization is Amber Danku.&nbsp;</p>\r\n<p><strong>GroupMe</strong>:&nbsp;https://web.groupme.com/join_group/44599895/yIbtbc</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2c16c6da-28e8-4c0c-b8a7-acb10c2ce212f38cec30-b76b-44b6-82e4-82a199758d31.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/asha",
    "name": "Advocates for Sexual Health Awareness",
    "ShortName": "ASHA",
    "Summary": "Advocates for Sexual Health Awareness is a student group dedicated to providing education and outreach to the NJIT community about healthy relationships, sexual health, consent, empowerment and campus resources.",
    "Description": "<p>Advocates for Sexual Health Awareness is a student organization dedicated to providing education and outreach to the NJIT community about healthy relationships, sexual health, consent, empowerment and campus resources.</p>\r\n<p>&nbsp;</p>\r\n<p>As the first official student organization recongized under Title IX, ASHA is dedicated to reducing sexual violence and encouraging safe relationships on campus. We want to empower students with the power we have as students ourselves. Our goals are to make campus a safer place by reducing discrimination based on race, gender, sexual orientation and gender. We promote healthy, safe sex and relationships, and always enforce the use of consent. We hope to create a safer enviorment for students and faculty each day.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/28524f87-3b48-4b96-9127-c138d4d508f9c360c79e-f74a-489b-af20-99985b994154.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/win",
    "name": "Women's Residential Initiative at NJIT",
    "ShortName": "W.I.N",
    "Summary": "The Women's Residential Initiative at NJIT's (W.I.N.) mission is to develop holistic programming to bring residential women collectively together to cultivate life skills that will help them thrive and flourish personally and professionally. ",
    "Description": "<p>The Women's Residential Initiative at NJIT's (W.I.N.) mission is <span style=\"font-weight: 400;\">to develop holistic programming to bring women collectively together to cultivate life skills that will help them thrive and flourish personally and professionally during and after college. Ultimately to provide opportunities for residents to develop a support network and establish a tight-knit community on NJIT campus</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ed8394f2-b242-47c5-9609-c1b615c081a6494f1566-791a-4d1a-b6f4-8b7487200f06.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/bsa",
    "name": "Bangladeshi Students' Association",
    "ShortName": "BSA",
    "Summary": "The Bangladeshi Students' Association is an organization that serves the NJIT community by upholding the values of diversity, compassion, and friendship. We proudly celebrate the Bangladeshi heritage, cultures, and traditions.",
    "Description": "<p><strong>Founded in Fall 2014, and approved by NJIT student Senate in Spring 2015, Bangladeshi Students' Association of NJIT (BSA) is a club comprised of NJIT undergraduate students as officers and is open to all members affiliated with NJIT.</strong></p>\r\n<p><strong>The main purpose of our club is to spread Bangladeshi culture and display our individuality to the NJIT community while participating in the chant of diversity. Through a variety of events, we embody our culture and traditions and foster unity among students regardless of their ethnic backgrounds.&nbsp;</strong></p>\r\n<p style=\"text-align: left;\"><strong><br /></strong><span style=\"font-weight: 400;\">If you have any questions, please email us at bsa+managers@njit.edu !</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/28015b0b-e03f-4ef2-9a84-2041a81b87f958e63135-9267-4a17-98e1-5bc66c334908.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/csla",
    "name": "College of Science and Liberal Arts - Dean's Office",
    "ShortName": "CSLA",
    "Summary": "The College of Science and Liberal Arts was formed in 1982.  It was originally known as the Third College because it had been preceded by NJIT’s Newark College of Engineering and the New Jersey School of Architecture. ",
    "Description": "<p class=\"p1\">The College of Science &amp; Liberal Arts was founded in 1982. It was originally known as the Third College, as it had been preceded by NJIT&rsquo;s Newark College of Engineering and the New Jersey School of Architecture. In 1986, as a result of a more distinctly defined mission and direction, the name of the college was officially changed to the College of Science and Liberal Arts (CSLA). Growing steadily ever since, CSLA has spawned three of NJIT&rsquo;s six schools and colleges: the School of Industrial Management (now the Martin Tuchman School of Management)was spun out of CSLA&rsquo;s Department of Organizational and Social Sciences in 1987, the Albert Dorman Honors College (founded in 1995), which evolved out of the Honors Program that was established within CSLA in 1985, and the College of Computing Sciences (now Ying Wu College of Computing), which evolved from CSLA&rsquo;s Department of Computer and Information Science in 2001.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/3ce4ad51-2bb9-4011-85bd-ed54514b5c16e2bb4194-4439-4d4f-80de-8d76c714f8ce.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/uasa",
    "name": "University Admissions Student Ambassadors",
    "ShortName": null,
    "Summary": "Are you bursting with Highlander pride? Do you love sharing your NJIT story with others? Join our team and connect with prospective students, friends, and family members to help them learn all about NJIT. ",
    "Description": "<p>We are a group of undergraduate students who help volunteer and work different events on campus and virtually where we share our experiences and become student leaders&nbsp;on campus.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ac4c5617-cec7-431f-b405-beb7bdfbf107f29f3025-6c92-4c6c-afe4-3dc5aa94eca9.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nce",
    "name": "Newark College of Engineering",
    "ShortName": "NCE",
    "Summary": "The Newark College of Engineering at New Jersey Institute of Technology.",
    "Description": "<p>The college has been providing quality engineering education since 1919. An estimated one in four professional engineers in the State of New Jersey are NCE alumni. Furthermore, the more than 40,000 living NCE alumni work in virtually every region of the whole world, often as CEOs or presidents of large engineering companies. NCE alumni have been pioneers and leaders in such fields as aerospace, television, telecommunications, plastics, electronics and environmental engineering.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/29b688a4-f1e0-452c-8955-8277b046b113851a19c6-efb4-4231-8ec9-2572a629af12.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/diversityinclusion",
    "name": "Office of Inclusive Excellence (IE)",
    "ShortName": "Diversity and Inclusion",
    "Summary": "Welcome to the NJIT Office of Inclusive Excellence (IE) page!",
    "Description": "<p>Our mission is to create an inclusive campus community by celebrating diversity, centering equity, and practicing inclusion in hopes of creating a culture of belonging.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0ebb623e-6914-4308-a564-3c1a9759138e9c839e4a-9f8f-4d3d-851d-8f273d2ca8c3.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/philosophyclub",
    "name": "Philosophy Club",
    "ShortName": null,
    "Summary": "Philosophy Club",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/acm",
    "name": "Association for Computing Machinery",
    "ShortName": "ACM",
    "Summary": "The NJIT chapter of ACM offers free tutoring for CS, IT, and IS classes, contains SIGs (special interest groups) dedicated to teaching various computer science topics, and works on various computer science-related projects.",
    "Description": "<p>What is ACM you might ask? ACM stands for the Association for Computing Machinery, and it is the world's largest educational computer science organization. ACM is divided up into many student chapters, and this one just happens to be located at, you guessed it, NJIT! If you're a student studying CS, IT, IS, or any other computer-related field, chances are that you'll find joining ACM to be useful. Whether you join for tutoring, use of ACM's vast array of online resources, or just to connect with fellow programmers, ACM is a great organization to be a part of.<br /><br />More specifically, the NJIT chapter of ACM offers free tutoring for CS, IT, and IS classes, contains SIGs (special interest groups) dedicated to teaching various computer science topics, works on various computer science-related projects, and works closely with the NJIT Ying Wu College of Computing to host a number events including HackNJIT, NJIT's own 24-hour hackathon. The NJIT chapter of ACM also occasionally takes trips to the headquarters of various companies to give students the opporunity to get an inside-look into real-world job environments. More information regarding our tutoring services, SIGs, projects, HackNJIT, and more is available through clicking the tabs above.<br /><br />While ACM is a professional organization, we also pride ourselves in trying to make our office a fun, safe, and friendly work environment. After quiet hours end at 6 PM, the office becomes a place where people can play video games, watch movies, and relax after a hard day of work. We urge all students to join us for both our professional services, and to simply unwind after a long day of classes. Join the <a href=\"https://discord.gg/XR6qPze\">NJIT ACM Discord</a>&nbsp;(https://discord.gg/XR6qPze) to stay up-to-date on everything ACM!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b8bf0f5b-21a6-4b8d-b978-a657cf251559c4445653-5396-4922-a6d7-2b5dfa90c5dd.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gswe",
    "name": "Graduate Society of Women Engineers",
    "ShortName": "GSWE",
    "Summary": "The graduate section of Society of Women Engineers (SWE) at NJIT aims to support the professional and personal development of the female graduate students (either M.S. or Ph.D. candidates) at NJIT. ",
    "Description": "<p>The graduate section of Society of Women Engineers (SWE) at NJIT aims to support the professional and personal development of the female graduate students (either M.S. or Ph.D. candidates) at NJIT. The issues that SWE intends to address include work-life balance for women, scholarship and funding opportunities, finding an academic or industry path based on mentoring programs and collaborations with university as well as industry representatives, etc. This section also focuses on facilitating mentoring the transition of undergraduate students towards graduate school. For this goal, the graduate section of SWE works closely with the undergraduate section at NJIT.</p>\r\n<p>The New Jersey Institute of Technology (NJIT) SWE collegiate section is a dynamic organization, dedicated to creating a bridge between students and professional opportunities. Our focus is to honor SWE's vision in advancing young women in their career as engineers and leaders by expanding the image of engineering profession, and demonstrating the value of diversity in the work place. NJIT's section of SWE is a great opportunity for students to be more involved on campus, to gain professional connections and skills, to network, and much more!</p>\r\n<p>The Society of Women Engineers (SWE), founded in 1950, is a not-for-profit educational and service organization. SWE is the driving force that establishes engineering as a highly desirable career aspiration for women. SWE empowers women to succeed and advance in those aspirations and be recognized for their life-changing contributions and achievements as engineers and leaders.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e4b51b73-979b-4d6f-827f-13fa2b326a2d35685e71-a61b-4d9a-b874-3e125046d036.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nicc",
    "name": "NJIT Information & Cybersecurity Club",
    "ShortName": "NICC",
    "Summary": "NICC connects students interested in information security & cybersecurity with hands-on experience, competitions, trainings, resources, and more to prepare them for a successful career in the industry.",
    "Description": "<p>NICC connects students interested in information security &amp; cybersecurity with hands-on experience, competitions, training, resources, and more to prepare them for a successful career in the industry.<br /><br />Our inaugural semester has many projects, cybersecurity Capture-The-Flag events, guest lectures, and trainings to encourage, excite, and motivate students about the fields.</p>\r\n<p>The best way to reach us is via our <a href=\"https://discord.gg/CsEFy4T8YX\" target=\"_blank\" rel=\"noopener\"> Discord</a>!</p>\r\n<p>Visit all our other links <a href=\"https://linktr.ee/njit.nicc\" target=\"_blank\" rel=\"noopener\"> here!</a><br /><br />Team CTFTime.org listings:<br /><a href=\"https://ctftime.org/team/202828\" target=\"_blank\" rel=\"noopener\">G1TC_Gu4rdians</a><br /><a href=\"https://ctftime.org/team/202841\" target=\"_blank\" rel=\"noopener\">NJ1T_H1ghland3r5</a><br /><a href=\"https://ctftime.org/team/202842\">Clocktower Dwellers</a><br /><a href=\"https://ctftime.org/team/202813\" target=\"_blank\" rel=\"noopener\">L0chness H4nt3rs</a><br /><a href=\"https://ctftime.org/team/202840\" target=\"_blank\" rel=\"noopener\">C3ntral_K1ngs</a><br /><a href=\"https://ctftime.org/team/270598\" target=\"_blank\" rel=\"noopener\">Tijn</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/81dbaec0-5f22-4714-af33-b447cda434c48485d280-29e8-43db-82c4-f3e4318a3f00.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/fssa",
    "name": "Forensic Science Student Association",
    "ShortName": "FSSA",
    "Summary": "FSSA will provide for its members opportunities to develop professional skills, enhance academic pursuits, build the forensic science community on campus, and collaborations within the department and NJIT as a whole. All majors are welcome to join!",
    "Description": "<p>We will hold and plan intellectual, academic, and social activities to expand the forensic science field on and off the campus. The Forensic Science Student Association&nbsp;will provide for its members' opportunities to&nbsp;develop professional skills, enhance academic pursuits,&nbsp;build the&nbsp;forensic science community on campus, and collaborations&nbsp;within the department and NJIT as a whole. We are interested in making forensic science accessible, entertaining, and inspiring to all students at NJIT. Everyone is welcome to join as we are not a major exclusive club, direct message us to get involved and to join our discord page!!!!&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e4110257-4db9-4b24-afa2-d486a4c4336ebaa178fc-e0fb-4f40-9a4e-34281c1cfa2a.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tlc",
    "name": "The Norma J. Clayton '81 Learning Center",
    "ShortName": null,
    "Summary": "Our mission is to assist students both in the classroom and beyond by providing tutorial services, academic coaching, academic and personal enrichment workshops and staff and peer support so students can meet the demands of their coursework and are prep.",
    "Description": "<p>Our mission is to assist students both in the classroom and beyond by providing tutorial services,&nbsp;academic coaching, academic and personal enrichment workshops and staff and peer support so students can meet the demands of their coursework and are prepared for life after graduation. TLC staff is committed to providing group and individual instruction which leads to student success. Thank you for checking out our website and we look forward to meeting you in person when you visit The Norma J. Clayton 81' Learning Center.&nbsp; If you have any questions or comments, please contact us at&nbsp;<a href=\"mailto:tlc@njit.edu\">tlc@njit.edu.</a>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2deedb91-6d6f-4e57-9de4-9725ec3b4324b0def1a8-0da4-4d3d-a99c-7de3f57e99f6.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/lambdasigmaupsilon",
    "name": "Lambda Sigma Upsilon Latino Fraternity, Incorporated",
    "ShortName": "LSU/Upsilons",
    "Summary": "The Proud and Prestigious Pioneros Chapter of Lambda Sigma Upsilon Latino Fraternity Incorporated takes pride in our four goals: Academic Excellence, Cultural Awareness, Community Service, and Brotherhood. Latino-based but not Latino-exclusive. ",
    "Description": "<p>The Proud and Prestigious Pioneros Chapter of Lambda Sigma Upsilon Latino Fraternity Incorporated takes pride in our four goals:&nbsp;Academic Excellence, Cultural Awareness, Community Service, and Brotherhood. Latino-based but not Latino-exclusive. Only organization on campus to aim for the professional success of our Latino brothers as well as preserve our beloved culture.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/8e2a3c59-c987-440b-b750-647e25617d8c46f4082e-281d-404c-a7a9-ab8746adabc4.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cph",
    "name": "College Panhellenic Council",
    "ShortName": "CPH",
    "Summary": "Panhellenic is the governing council for all NPC and local sororities at NJIT. We aim to grow the sorority community, host meaningful and fun events for initiated members, and raise money to help remove educational barriers for girls facing poverty. ",
    "Description": "<p><span style=\"font-weight: 400;\">The NJIT Panhellenic Council is an extension of the </span>National Panhellenic Conference<span style=\"font-weight: 400;\"> (NPC) which is comprised of 26 national/international sororities. Initiated members from regular NPC sororities (&Alpha;&Sigma;&Tau;+&Delta;ɸ&Epsilon;) and associate sororities (&Sigma;&Psi;&Kappa;) serve as E-Board members and delegates to create a better sorority experience at NJIT from recruitment to graduation. We g</span>row the sorority community through spring (formal) &amp; fall recruitment (informal); host social, professional, and wellness events for the Panhellenic sorority community; and raise money for NPC&rsquo;s philanthropy, the Circle of Sisterhood!&nbsp;</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/dfad6c87-787a-4d74-9498-55f03bcfed7ebcc70370-09f0-4ec9-a714-d6a0357f9fdb.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/depsi",
    "name": "Delta Epsilon Psi",
    "ShortName": "DEPsi (Pronounced: \"Dee-SIGH\")",
    "Summary": "A South Asian Interest Fraternity involved in nurturing a culture of giving back to our community, raising money for our philanthropy (JDRF) and exemplifying leadership through all of our members.",
    "Description": "<p><strong>Delta Epsilon Psi</strong> (<strong><span title=\"Ancient Greek (to 1453)-language text\"><span lang=\"grc\">&Delta;&Epsilon;&Psi;</span></span></strong>) is a South Asian interest social and service fraternity located in the United States. Delta Epsilon Psi Fraternity, Inc. was founded on <span data-sort-value=\"000000001998-10-01-0000\">October 1, 1998</span> at the University of Texas at Austin.<sup id=\"cite_ref-Baird's_Manual_Online_1-0\" class=\"reference\"></sup> The 18 founders formed the fraternity to provide a unified South Asian voice at the school.&nbsp;<sup id=\"cite_ref-hist_2-0\" class=\"reference\"></sup>The purpose of Delta Epsilon Psi is to develop leadership qualities within its members by instilling within them the three pillars (Brotherhood, Discipline, and Commitment) upon which the fraternity was founded.&nbsp;Delta Epsilon Psi's philanthropies are research towards curing juvenile diabetes (type 1 diabetes) through the Juvenile Diabetes Research Foundation (JDRF), and supporting the National Marrow Donor Program. Delta Epsilon Psi boasts 31 chapters and colonies throughout the nation. Tau Chapter at NJIT is one of many in the northeast region, with some others being Kappa (NB), Xi (Drexel), Alpha Theta (NYIT), Alpha Delta (TCNJ), Alpha Eta (Binghamton), and Alpha Xi (UMD).</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/efaa0810-9b13-478a-af1d-5670b00a962580e2fa70-f490-497a-917e-8c3df60b956c.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitchristiansoncampus",
    "name": "Christians on Campus",
    "ShortName": null,
    "Summary": "A club that wants to share God's words and truth to the campus.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/b5e202ef-76c3-4363-a9a3-4de7b80cd0b17683ea09-f363-48e4-aa65-592498b57ccf.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njit_thillana",
    "name": "NJIT Thillana",
    "ShortName": null,
    "Summary": "NJIT Thillana is a NJIT's premier Indian classical dance team that strives to showcase the classical dance styles of India while embracing the culture. With passionate experts in many styles, Thillana hosts stunningly innovative performances year-round.",
    "Description": "<p class=\"x__04xlpA x_direction-ltr x_align-start x_para-style-body\"><span class=\"x_WdYUQQ x_text-decoration-none x_text-strikethrough-none\">NJIT Thillana is NJIT's premier Indian classical dance team. What began as an online community during the COVID-19 pandemic has now transformed into a community of dancers of a variety of ages, backgrounds, and experiences passionate to hone in on their craft and continue their journey with dance.</span></p>\r\n<p class=\"x__04xlpA x_direction-ltr x_align-start x_para-style-body\">&nbsp;</p>\r\n<p class=\"x__04xlpA x_direction-ltr x_align-start x_para-style-body\"><span class=\"x_WdYUQQ x_text-decoration-none x_text-strikethrough-none\">With dancers trained in a plethora of classical styles, the team encourages freedom and innovation with the arts through personal and collaborative endeavors. Come the future, Thillana aspires to further nurture its dancers' skills while continuing to educate the Newark community of the beauty of ancient Indian arts through performance and discussion.</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2e5bca68-8b2a-4f7a-b94d-55c26779e0d7afa48ca8-b004-4ac5-af3a-fb9296dd9922.PNG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/asa",
    "name": "Armenian Students Association",
    "ShortName": "ASA",
    "Summary": "The ASA at NJIT is an organization that strives to connect the Armenian Community here at NJIT, with people of all ethnicity and background. Our goal is to educate students about current state of affairs, culture, and the rich history of Armenia. ",
    "Description": "<p>The ASA (Armenian Students Association) at NJIT is an organization that strives to connect the Armenian Community here at NJIT, with people of all ethnicity and background. Our goal is to educate students about current state of affairs, culture, the rich history, as well as preparing our members for the future of Armenians. As a member of the ASA at NJIT, members will have hands on experience with culture such as cooking, dancing, and other forms of culture. Members of the club will also learn a lot about the rich Armenian History, as well as current state of affairs, in order to stay educated at all times, and is able to provide detailed and factual information to others that are curious. As a club, we strive to not only educate and learn, but to also contribute to the NJIT cultural community and create connections with said communities. Amongst all of these, amongst all Armenians across the globe, we strive for a free, united, and independent Armenia and Artsakh.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/34995151-5fd3-407f-b806-6250a6535231f340ae7e-2bdd-433c-9a2b-a1467a244783.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitskate",
    "name": "NJIT Skate Club",
    "ShortName": "NJIT SKATE",
    "Summary": "Come skate with the official NJIT skateboarding club 🛹",
    "Description": "<p>NJIT SBC is the official skateboarding club at NJIT. We encourage and aim to foster a fun and inclusive community of skaters on campus. The club mainly revolves around street, transition, and freestyle skateboarding, but anyone involved in other types of boarding/related hobbies can join.<br /><br />Events: Although we are a skateboarding club, the activities of our club reach beyond just riding the board. We hope to collaborate with many organizations/students from those on the creative side who would like to have their art/design showcased in the form of stickers/graphics, to those on the engineering/design side, who would like to build their own skateable structures/objects in the makerspace. We of course also plan on holding skate events, such as tournament style games of SKATE, events where we teach people how to skate, and charity style events where skaters might have to land certain tricks for prizes.<br /><br />Skate Videos: One of the most rewarding aspects of skateboarding is the ability to look back on how far you've come and what you've been able to accomplish. Recording skateboarding and skate videos are a big part of skateboarding, and for that reason we at NJIT SBC plan on making a semester video every semester to showcase what our members have been up to. We plan to hold a premiere for these videos where all students/staff/anyone who is interested can come watch the video.<br /><br />Join our <a href=\"https://discord.gg/z8kTzxS9\">discord</a> where you can ask any questions pertaining to skateboarding or just talk<br /><br />Also join our <a href=\"https://groupme.com/join_group/89153544/nUVmS99V\">GroupMe</a>&nbsp;where we often text to meet up to skateboard</p>\r\n<p>&nbsp;</p>\r\n<p>Watch the <a href=\"https://youtu.be/rFjEdNFGXJ8?si=oGlcNvH9jJIEauS9\">trailer</a>&nbsp;for our newest video premiering in the beginning of the Spring 2024 semester!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/125c95b9-afab-4635-9d75-6ad965352c413f92c121-23da-4355-bfc5-862f7671f6d2.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/programmingteam",
    "name": "Programming Team",
    "ShortName": null,
    "Summary": "Programming Team competes in the Association for Computing Machinery's International Collegiate Programming Contest. As a student organization within NJIT's Ying Wu College of Computing, we have competed regionally each fall since 2018.",
    "Description": "<p>Programming Team competes in the Association for Computing Machinery's International Collegiate Programming Contest. As a student organization within NJIT's Ying Wu College of Computing, we have competed regionally each fall since 2018.</p>\r\n<p>&nbsp;</p>\r\n<p>Aside from preparing for ICPC, this club is open to anyone and everyone who wants to learn to improve their technical skills through coding problems!</p>\r\n<p>&nbsp;</p>\r\n<p>Join our <a href=\"https://discord.gg/46JeWuQ\">discord</a>&nbsp;for more information!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a22c5473-e699-4922-82b3-451137f09404df29cd6d-31c8-43ae-9b88-175840ffd133.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/iida",
    "name": "International Interior Design Association",
    "ShortName": "IIDA",
    "Summary": "The International Interior Design Association is a global network of design professionals, educators, and students across nearly 60 countries. ",
    "Description": "<p>The International Interior Design Association is a global network of design professionals, educators, and students across nearly 60 countries. With a network consisting of over 15,000 members, IIDA can provide an abundance of resources to interior designers and their clients. Through its advancement of the profession, education, leadership and design legislation, IIDA positively impacts the design world. Its various chapters and city centers provide both designers and students with the opportunity to collaborate and lead their design communities.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/72755fda-bf95-4d5b-88e3-be64f21fb702c632393d-9621-42f4-91ea-531d04be692f.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitactive",
    "name": "NJIT Active",
    "ShortName": null,
    "Summary": "NJIT Active gets students off campus to gain new experiences through different forms of physical activity such as hiking, biking, climbing, and skiing.",
    "Description": "<p>NJIT Active works to gather students and facilitate physical activities which are fun and unconventional forms of exercise. NJIT Active serves to break the student routine and provide exciting opportunities to gain new experiences off campus. Some examples of the activities promoted by NJIT Active include, but are not limited to, hiking, rock climbing, biking, and skiing.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0d8554b7-eef6-4735-83b6-8c71941e3e075b947f57-a6c9-4a51-9ce5-dec585adca48.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/seniors",
    "name": "Senior Class",
    "ShortName": null,
    "Summary": "The official page for the NJIT Class of 2024",
    "Description": "<p>Hello and welcome to the official page for the NJIT Class of 2024!</p>\r\n<p>If you are an incoming graduating senior, stay tuned for more updates coming soon!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hsc",
    "name": "Honors Student Council",
    "ShortName": "HSC",
    "Summary": "We serve as the liaison between the Honors College and the student body, helping Scholars to have their voice heard. We host events to let Honors students communicate their needs and desires, and help them to get the most out of the Honors experience!",
    "Description": "<p>The Honors Student Council serves as the liaison between the Albert Dorman Honors College and the student body as a whole, helping Honors Scholars and Dean's Scholars to have their voice heard by the Honors administration. We host several feedback sessions and other events to let Honors students communicate their needs and desires, and help them to get the most out of their Honors experience!</p>\r\n<p>Our Council is comprised of the Officers (a.k.a. E-Board) and several Representatives. The specific Representative positions are: one for each class year (Freshman - Senior), an Accelerated Student Rep, a Dean's Scholars Rep, a Transfer Rep (for students who transferred into Honors after being non-Honors), a Commuter Rep, and a Non-Honors Hall Resident Rep. All of our Representatives and Officers are happy to hear about any requests, comments, concerns, questions, or feedback you have about the Honors College or any of its programs or requirements!</p>\r\n<p>Join our discord:&nbsp;https://discord.gg/WgJSyyzdqk</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/312eddb2-63a3-4eed-993c-17ca4135c3d1abe0ca1f-66f8-4d32-94ad-a9d343784789.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/aiche",
    "name": "American Institute of Chemical Engineers",
    "ShortName": "AIChE",
    "Summary": "American Institute of Chemical Engineers",
    "Description": "<p><span style=\"font-weight: 400;\">NJIT&rsquo;s AIChE was founded in 1950 by a group of Chemical Engineering students who saw a need for a professional organization that focused on preparing chemical engineers for professional careers. They aimed to create a student-led chapter that will promote the professional development of its members by its programs and with the parent body, the American Institute of Chemical Engineers. The students envisioned a chapter that will contribute to the development of Chemical Engineering at New Jersey Institute of Technology through activities involving the faculty and student members.</span></p>\r\n<p>DISCORD:&nbsp;https://discord.gg/y6AhskgXMX</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/2e1c63b6-a46f-4311-9d30-b24f67acedba7693ebb8-55e2-41f0-b9e6-1c858acf10a3.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ica",
    "name": "Iranian Cultural Association",
    "ShortName": "ICA",
    "Summary": "The population of Iranian students is growing at NJIT. Therefore, we decided to establish an association to recall our home and introduce ourselves to our foreign friends.",
    "Description": "<p>Iran or Persia has one of the oldest cultures in the world. Iran has directly influenced cultures and people, for instance, <span style=\"font-size: 1.125rem; letter-spacing: 0px;\">Italy, Macedonia, and Greece to the West, </span><span style=\"font-size: 1.125rem; letter-spacing: 0px;\">Russia to the North, the Arabian Peninsula to the South, and South and East Asia to the East. Iran has had a long and turbulent history and its location at the crossroads of Europe and Asia has resulted in many invasions and migrations.</span></p>\r\n<p><br />There is evidence that Iran played a role in the emergence of civilization as far back as 10,000 years ago. In 553BC, Cyrus the Great established the first Persian Empire, which extended to Egypt, Greece, and Russia. Cyrus the Great is also well recognized for his achievements in human rights, politics, and military strategy, as well as his influence on both Eastern and Western civilizations. Having originated from Persis, roughly corresponding to the modern Iranian province of Fars, Cyrus has played a crucial role in defining the national identity of modern Iran.</p>\r\n<p><br />Iran is located in southwest Asia. With an area of 635,932 square miles (1,647,063 square kilometers), Iran is slightly larger than the state of Alaska. A vast, dry plateau in the center of the country is encircled by a ring of snow-topped mountain ranges that cover about half of Iran's area. To the north and south are coastal lowlands. Iran has a total population of about 70 million people.</p>\r\n<p><br />Iran's official language is Farsi, which is also known as Persian. Farsi is also spoken in parts of Turkey and Afghanistan. Many Iranians understand Arabic, the language of the Koran (the sacred text of Islam). The Azerbaijanis speak a Turkish dialect known as Azeri. The overwhelming majority of Iranians (about 98 percent) are Shi'ah Muslims. Shi'ah, one of the two schools of Islam, is the state religion.</p>\r\n<p><br />The major secular holiday is Nowruz, the ancient Persian New Year. It takes place on March 21, which is also the first day of spring. In the cities, a gong is sounded or a cannon is fired to signal the beginning of the new year. Children are given money and gifts, and dancers perform at festivals.</p>\r\n<p>There are several ancient festivals and ceremonies to be celebrated in Iran which has roots in the kindness and hospitality spirit of our ancestors. Each of these ceremonies is based on their beliefs and stories; some of which are mentioned hereunder:</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Sizdah Bedar:</strong> Persian Festival of \"Joy and Solidarity\". The 13th and last day of Nowruz celebration. Because of the end of twelve days (a sample of twelve-month), they celebrate the 13th day as a new beginning of the next twelve month and it has no relations with the number 13 (as an unlucky number). It is celebrated outdoors along with the beauty of nature.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Mehregan:</strong> Festival of Mehr (or Mihr). A day of thanksgiving. It is a day in which everyone shows the Mehr or the love they have for each other and it is one of the most important days in the year.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Jashne Sade:</strong> A mid-winter feast to honor fire and to \"defeat the forces of darkness, frost and cold\" in which people gather around and build a fire so that they can receive good things from the fire and give the fire their incompleteness.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Yaldā Night (Shabe Chelle):</strong> The turning point. End of the longest night (darkness) of the year, and beginning of growing of the days (Lights). A celebration of Good over Evil. Also known as Shab-e Yaldā they have special nuts for that night.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Sepandarmazgan:</strong> Day of Love, Friendship, and Earth in ancient Persian culture.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Chaharshanbe Suri:</strong> Festival of Fire, last Wednesday night in the Iranian Calendar year. It marks the importance of the light over the darkness, arrival of spring and revival of nature.</p>\r\n<p><br />The population of Iranian students is growing at NJIT. Therefore, we decided to establish an association to recall our home and introduce ourselves to our foreign friends. It goes without saying, according to the recent problems like the travel ban and VISA difficulties, Iranian students in states are facing a heavy burden of homesickness beside a load of academic challenges. Therefore, the need of having a community to provide support to the new arrivals has become considerably more than before.</p>\r\n<p><br />Additional goals of such an association are extending the communication with other nationalities, holding some of these fascinating ceremonies, introducing Iranian culture and society to the willing individuals. Hopefully, this association can play a significant role to provide students with a more confident, efficient, and cheerful life.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/17027241-a77d-4122-89f0-601d1931c54890f42876-e6d6-4f07-a8e8-f7848c695b37.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitft",
    "name": "Financial Technology Club",
    "ShortName": "NJIT FT",
    "Summary": "The NJIT Financial Technology Club (NJITFT) is the first holistic, undergraduate-led club to provide resources and support for NJIT students interested in the FinTech field.\r\n\r\n",
    "Description": "<p>The NJIT Financial Technology Club (NJITFT) provides resources and support for all students interested in Financial Technology! We intend to make FinTech accessible to all undergraduate students in order to foster and expand the FinTech community at NJIT. Through our meetings and events, we share FinTech knowledge and background, expand networking possibilities, and hosting professional development events.</p>\r\n<p><a href=\"https://discord.gg/MHQBssHgAX\">Join Our Discord!</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/1406787b-88d4-4892-8185-fef2e021d7ee45a390d3-c2fd-4d49-b5ad-6c17ea7bb2e2.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/dicendecks",
    "name": "Dice and Decks",
    "ShortName": "DND",
    "Summary": "\r\nNJIT's one and only tabletop game club! Play board games from Monopoly to Catan, RPGs like Dungeons & Dragons, or card games like Magic: the Gathering! We meet weekly and meetings are open to everyone!",
    "Description": "<p>This club is a place for students to come together and play <strong>board games</strong>, <strong>card games</strong>, <strong>TTRPG</strong>s and more. We own a large collection of physical board games and host game nights as well as game-related events (such as <strong>casino nights</strong>, <strong>board game marathons</strong> etc.) We are also a place for students interested in group games like <strong>D&amp;D</strong>, or forming smaller gaming groups to meet and organize.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Join our <strong>Discord</strong>:&nbsp;https://discord.gg/pSvDpWj5wh</p>\r\n<p>&nbsp;</p>\r\n<p>Our Discord allows members to <strong>view our game collection</strong>, <strong> explore our communities</strong>, and <strong>coordinate</strong> times and places for players to meet. Also, active members will gain access to our <strong>game rental system</strong>.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a97c737a-ab3b-4c11-b684-39aabf500cfcddf035f7-b9be-48ca-90be-73507acf9328.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cds",
    "name": "Career Development Services",
    "ShortName": "CDS",
    "Summary": "Vision: To have career development become a widely integrated and invaluable component of the university’s overall education delivery and student professional preparation strategies. ",
    "Description": "<p><strong>Mission</strong>:&nbsp; Career Development Services is a value&ndash;added contributor to the career planning and preparation of NJIT students and graduates. We are dedicated to continually improving our client services and to assuming leadership in the profession of career development.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/8a89ed32-a350-4fb4-8293-bd8d5a50397560c43291-fb4b-4b96-94b1-a50e8d6fde26.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cusa",
    "name": "Chinese Undergraduate Student Association",
    "ShortName": "CUSA",
    "Summary": "大家好! We are CUSA: the Chinese Undergraduate Student Association of NJIT! We are a sociocultural club focused on spreading and promoting Chinese culture at NJIT through events, festivals, food, and more!",
    "Description": "<p>大家好! We are CUSA: the Chinese Undergraduate Student Association of NJIT! We are a sociocultural club focused on spreading and promoting Chinese culture at NJIT through events, festivals, food, and more! Our club is <span style=\"font-weight: 400;\">inclusive towards anyone, Chinese or non-Chinese, interested in Chinese culture and other ethnically Chinese groups and cultures.</span></p>\r\n<p>&nbsp;</p>\r\n<div class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_page\" title=\"Page 1\">\r\n<div class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_section\">\r\n<div class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_layoutArea\">\r\n<div class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_column\">\r\n<p>Instagram: <a href=\"https://www.instagram.com/njit.cusa/\">@njit.cusa</a></p>\r\n<p>Discord: <a href=\"https://discord.gg/suDs98a6hq\">https://discord.gg/suDs98a6hq</a></p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b03d413b-eb60-4190-9197-1b8823186ac1dc201f21-5409-408e-b6c0-49ad6faf7510.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/siggraph",
    "name": "SIGGRAPH",
    "ShortName": "SIGGRAPH",
    "Summary": "ACM SIGGRAPH's mission is to foster and celebrate innovation in Computer Graphics and Interactive Techniques.",
    "Description": "<p>NJIT SIGGRAPH is a community where students interested in design through a digital medium can come and take part in activities that will strengthen their skills and industry connections. These events include discussions on design techniques, program tutorials, critique sessions, animation workshops, and more - all to continue cultivating the community of digital design students on campus. NJIT SIGGRAPH will be the hub of digital design knowledge, activity, and interactivity on and off campus, where students can be exposed to the professional field of design through interactions with the numerous design studios in the metropolitan area, representatives from well-established entertainment companies, educators who have started their own design businesses, etc. We strive to offer our students the strongest possible support network as they develop their projects and step into the professional world of design.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/300b2114-691a-46ec-9331-87764d0e27f704959365-2869-444c-8fdb-b289eff29b8b.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/racquetballclub",
    "name": "Racquetball Club",
    "ShortName": null,
    "Summary": "Racquetball Club",
    "Description": "<p><span style=\"font-weight: 400;\">The Racquetball club educates and entertains the students of NJIT who take an interest in the sport of racquetball. We host events for them to learn the game, connect students interested in play, and participate in a competitive environment.&nbsp;</span></p>\r\n<p>Discord:&nbsp;https://discord.gg/JFBXPEP6aq</p>\r\n<p>Instagram:&nbsp;https://www.instagram.com/njitracquetball/</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/spectrum",
    "name": "Spectrum",
    "ShortName": "Spectrum",
    "Summary": "Spectrum is a student run organization at NJIT and a chapter of oSTEM Incorporated. that caters to the lgbtqia+ student body as well as their allies.",
    "Description": "<p>Spectrum is a student run organization at NJIT and a chapter of oSTEM Incorporated that focuses on developing the campus as an lgbtqia+ friendly environment and nurturing the community on campus to be politically and socially conscious of LGBT+ topics. Our objectives are:</p>\r\n<p>Host and promote LGBT+ related events on and off campus.<br />Push our students toward community service locally and globally.<br />Hold discussions regarding past and current LGBT+ issues.<br />Educate students, faculty, and staff on LGBT+ topics.<br />Create a bridge between the LGBT+ student body and NJIT Administration.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7b6b2737-7b60-4ce2-b3c8-7c06dc7cd3706585be92-111a-410f-bdb1-f28c8c742b21.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/prosthetics",
    "name": "Prosthetics Club",
    "ShortName": "ProClub",
    "Summary": "The Prosthetics Club is an NJIT student organization that collaborates to design and construct prosthetics and other assistive devices for animals.",
    "Description": "<p>Our club utilizes CAD modeling to design prosthetics and prints them out using printing software and the Makerspace 3D printers. Members can partake in lessons and design sessions held during the semester to familiarize themselves with these programs. They will have the chance to design their own prosthesis and potentially use them for the final product that is delivered to clients. Previous experience is not required.</p>\r\n<p>Please join our club <a href=\"https://discord.gg/tfFfrtfCm8\">Discord</a>&nbsp;for more updates. We're looking forward to seeing you there!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/505c9c9d-0e70-4f8a-9dfd-299b4f3f6be627c6a705-a0b3-4a64-8dcf-9459628a1d6d.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/phisigmakappa",
    "name": "Phi Sigma Kappa - Alpha Octaton",
    "ShortName": "Phi Sig",
    "Summary": "Alpha Octaton Chapter of Phi Sigma Kappa",
    "Description": "<p>Phi Sigma Kappa is a lifelong brotherhood dedicated to the betterment of the individual, the university community, and our world, by giving its members opportunities to develop leadership skills, participate in service to others, achieve academic excellence, experience cultural diversity and practice personal integrity.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/891a55fe-82c0-43b8-bc14-d5ab609483a25c7fd41e-c385-4f28-abd4-c0ccc09d0435.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/thetachi",
    "name": "Theta Chi",
    "ShortName": null,
    "Summary": "The Epsilon Psi chapter of Theta Chi fraternity, focused on turning ordinary men, into resolute men.",
    "Description": "<p>Theta Chi is a resolute Fraternity founded in 1856 on the principle of friendship through mutual assistance. It gives its members a fulfilling experience socially and academically preparing them in their lives after college. The Epsilon Psi Charter continues to provide a helping hand to its community on and off campus, breaking the negative stigmas of Greek life.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7ef1058d-1d18-4a6c-9617-5db8a52c8536af94ac07-acc9-45b8-a31d-c2e0d96aacf6.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/kphig",
    "name": "Kappa Phi Gamma Sorority, Incorporated",
    "ShortName": "KPhiG",
    "Summary": "Founded by 27 visionary women, Kappa Phi Gamma Sorority, Inc. was established on November 8th, 1998, at The University of Texas at Austin, as the Nation's first ever South Asian Interest-Based Sorority. ",
    "Description": "<p>Founded by 27 visionary women, Kappa Phi Gamma Sorority, Inc. was established on November 8th, 1998, at The University of Texas at Austin, as the Nation&rsquo;s first ever South Asian Interest-Based Sorority. Although Kappa Phi Gamma was founded as a South Asian sorority, we have expanded the warmth of our Sisterhood to any and all motivated young women willing to make a difference in their community and to uphold the principles that the sisterhood is based upon. The Founders envisioned a sorority built around 8 principles: Character, Leadership, Scholarship, Sisterhood, Service, Culture, Womanhood, and Self. Realizing the quality of the Sisterhood could never be compromised, the Founders&rsquo; every endeavor thereafter was directed toward fostering these 8 principles and establishing a solid foundation for the future before embarking on plans for expansion. On May 18, 2016 five women chartered Sigma Charter at New Jersey Institute of Technology in Newark, New Jersey. Their mission is to spread the Sisterhoods' ideal principles for other women to embrace while continuing the vision of the National Founders.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ddf98f49-05d0-4239-a637-d8781760826f1fe3ce60-bd7c-45b1-b90d-274e11ff28a4.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/publicspeaking",
    "name": "Public Speaking Club",
    "ShortName": "PSC",
    "Summary": "The purpose of the Public Speaking Club shall be to enhance NJIT students’ public speaking abilities, interpersonal skills, and interactions. \r\n\r\n",
    "Description": "<p><span style=\"font-weight: 400;\">The purpose of the Public Speaking Club shall be to enhance NJIT students&rsquo; public speaking abilities, interpersonal skills, and interactions. The club shall provide opportunities to improve one&rsquo;s self-confidence across all mediums of communication. This club will provides students who are interested in public speaking a community where they will be able to improve their interpersonal skills. The organization also provides opportunities to improve public speaking skills for students that cannot commit to and pay for a public speaking course such as Oral Presentations. Public speaking courses also put pressure on students since they are graded for how they perform in their course. Our club will not place pressure on any student and may only lead to friendly competitions. Through a friendly/casual environment, this organization will allow opportunities even for students that are not comfortable with public speaking.&nbsp;</span></p>\r\n<p>https://discord.gg/kGURHGYP</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/de5c5a10-e2dc-4e3d-8952-1a4c06012cbf71216b09-f9bc-41ec-935c-505243202eed.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cki",
    "name": "Circle K International",
    "ShortName": "CKI",
    "Summary": "The purpose of this club is to devise, develop, organize, and implement service projects that benefit the campus and the community. Members gain resume worthy skills, find lifetime friends and do community service that changes lives, including their own.",
    "Description": "<p>Circle K International (CKI) is the premier collegiate and university community service, leadership development, and friendship organization in the world. CKI is a self-governing organization that elects its own officers, conducts its own meetings, and determines its own service activities. CKI blends community service and leadership training with the opportunity to meet other college students around the world.</p>\r\n<p>Discord:&nbsp;https://discord.gg/6Wu95y7Eht</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/320b5af3-95af-4272-b9e0-b99cdf02edeb23d9aa75-aa82-454c-b058-7ceba05f343d.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/occa",
    "name": "Off-Campus and Commuter Association",
    "ShortName": "OCCA",
    "Summary": "OCCA aims to serve the commuter population at NJIT through providing information, workshops, and social events benefiting students who regularly commute by car, train, bus, bike, or walking. ",
    "Description": "<p>OCCA aims to serve the commuter population at NJIT through providing information, workshops, and social events benefiting students who regularly commute by car, train, bus, bike, or walking.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4c5d3e60-1f61-4758-9e90-ac93d53848ca94850adb-fdaa-42cf-af98-2b7f619ac69d.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/phs",
    "name": "Pre-Health Society",
    "ShortName": "PHS",
    "Summary": "Pre-Health Society is an organization focused on guiding and uniting incoming and current pre-health students in their pursuit of all health-related careers.",
    "Description": "<p><span style=\"font-weight: 400;\">PHS hopes to guide incoming and current Pre-Health students in their pursuit of health related careers, including but not limited to careers as physicians, physician assistants, nurses and therapists. Such guidance will take the form of professional development and peer mentoring.&nbsp; The club also aims to serve the greater NJIT community by encouraging academic excellence as well as by promoting a spirit of unity and cooperation not only among pre-health students but also between the pre-health community and general NJIT community. </span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/1989d0b9-82c7-4080-b1c7-864710ee1009327dccf0-4e80-46f2-826f-f05262ed9a7f.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/biblestudyclub",
    "name": "Bible Study Club",
    "ShortName": "BSC",
    "Summary": "We gather together to read the Bible and discuss about the scripture, and share the thoughts.",
    "Description": "<p>We are students and alumni of NJIT and Christians or truth-seekers.</p>\r\n<p>We speak Chinese, and we speak a love language.</p>\r\n<p>We share about life and we share<strong> food (yah excellent Chinese food for dinner every Friday Night)</strong></p>\r\n<p>We sing and we pray for each other. We get to know each other, and we get to know Jesus.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f0f1489a-b67a-43dc-9e18-519af95097645b2ccd01-b9cc-4b7b-97b8-b8667dd1d41d.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/oakhallcouncil",
    "name": "Oak Hall Council",
    "ShortName": "Oak Hall Council",
    "Summary": "The governing body for the residents of Oak Hall",
    "Description": "<p>The governing body for the residents of Oak Hall</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/453cf33d-4966-4420-bf0d-e771833f2b349a508ef2-519b-4c90-8c31-ab2ae3fefc28.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sanskar",
    "name": "SANSKAR",
    "ShortName": "Sanskar",
    "Summary": "Graduate Indian Student Association",
    "Description": "<p>Welcome to <strong>Sanskar</strong>, your gateway to a vibrant cultural experience! Sanskar is a dynamic &amp; inclusive Student Org. dedicated to celebrating &amp; sharing the rich tapestry of Indian culture with the NJIT Community.</p>\r\n<p>Our mission, the <strong>Sanskar team</strong> is to foster belonging for Students away from their homes, while also promoting cross-cultural connections. We believe that diversity &amp; togetherness is our strength, and through our events &amp; activities, we aim to create an environment where every student feels welcomed, cherished, and at home.</p>\r\n<p>If you're wondering <strong>what we do</strong>: Community Engagement, Support and Friendship, Festive Celebrations, and Cultural Activities, Alumni Networking, Panel Discussion, Entertainment night with an Indian touch, and more collaborative events.</p>\r\n<p>Come join us to embark on the journey of cultural <strong>F</strong>estivities, <strong>F</strong>riendships, and <strong>F</strong>un.&nbsp;</p>\r\n<p>Follow us on Instagram for updates, join the club membership, and immerse yourself in the warmth of Sanskar's welcoming embrace.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/ce18d67a-875d-4480-906a-a7f9bdf7a70e5e197ebd-69b4-4bca-9f26-68d164611c79.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/studentsforlifenjit",
    "name": "Students for Life at NJIT",
    "ShortName": "Students for Life",
    "Summary": "Students for Life is an advocacy organization seeking to educate and engage the NJIT community about issues that threaten human life and provide support to community members who are personally facing these issues.",
    "Description": "<p>Students for Life seeks to promote the dignity and protection of all human life from conception to natural death and to uphold and preserve corresponding values geared at the promotion and protection of human life. The club works to save lives threatened by induced abortion, euthanasia, infanticide, and the destruction of human embryos for research in all scenarios. In furtherance of these goals, members seek to promote respect for life at NJIT and on a local, state, and national level, to educate on life issues, to help those in need so that life is a promising choice, and to work with others who share common goals.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/d61099b6-35ad-4c1f-bd28-2cec92f19f53ced80aea-0d1c-4beb-b7bf-85f474aade90.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cricketclub",
    "name": "NJIT Cricket Club",
    "ShortName": null,
    "Summary": "NJIT Highlanders Cricket is a student-run club that promotes cricket in the college community. It organizes games, tournaments, coaching sessions, and workshops for students to improve their skills and build relationships with other cricket enthusiasts.",
    "Description": "<p>NJIT Highlanders Cricket is a&nbsp;student-run organization that promotes and facilitates the sport of cricket among the college community. Our club organizes opportunities for students to participate in cricket games, tournaments, and other related events. Club activities may include regular practices, friendly matches against other college cricket clubs, and participating in intercollegiate tournaments.</p>\r\n<p>&nbsp;</p>\r\n<p>The primary objective of Highlanders Cricket Club is to provide a platform for students who are interested in playing cricket and promote the sport within the college community. The club may also organize coaching sessions, training camps, and workshops to improve the skills and techniques of the members.</p>\r\n<p>&nbsp;</p>\r\n<p>Overall, joining this club is a&nbsp;great way for students to get involved in the sport, develop their skills, and build lasting relationships with other students who share a common interest in cricket.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/caf36f68-a81e-4a79-990c-c864471807d2c55b4fd5-3e95-497c-8623-7cc56d1cc53b.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nomas",
    "name": "National Organization of Minority Architecture Students",
    "ShortName": "NOMAS",
    "Summary": "NOMAS\r\nNational Organization of Minority Architecture Students",
    "Description": "<p>The National Organization of Minority Architecture Students (NOMAS) the New Jersey Institute of Technology Chapter has a mission to champion diversity within the education of design by promoting academic excellence, community engagement, networking, national conferences, and professional development of its members. A welcoming environment for minority architecture students where we can support and build each other up. A place to talk about real issues that might be affecting minority students in their studies and at the professional level.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/7b3f4d68-66d7-41f4-b710-322010b4559a378b0f3a-806c-42d6-9642-8af961989125.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/womenscenter",
    "name": "The Murray Center for Women in Technology",
    "ShortName": "MCWT",
    "Summary": "The Murray Center is a university-wide network that connects women students and faculty to each other and to the resources they need to succeed.",
    "Description": "<p>The Center was established in 1995 to continue the work of the late Dr. Constance A. Murray (NJIT Dean of Students,1978-1994) a passionate advocate for diversity.&nbsp;&nbsp;</p>\r\n<p><strong>Our Initiatives:</strong>&nbsp;A peer-to-peer support system for first year students. A professional network for graduate students. A nationally-recognized program to advance women faculty.&nbsp;</p>\r\n<p><strong>Our Location:</strong>&nbsp;The 2nd Floor of the Campus Center. The Murray Center provides a quiet place to study, a lounge for relaxation with friends, computers, a library, a mini-kitchen, and two conference rooms for all students.</p>\r\n<p><strong>Dr. Nancy Steffen-Fluhr, Director&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong><br />Phone: (973) 596-3295,(973) 642-7021&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Email:&nbsp;steffen@njit.edu&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p>\r\n<p><strong>Fran Sears, Special Projects Manager</strong><br />Phone: (973) 642-4671<br />Email:&nbsp;<a href=\"mailto:fsear@njit.edu\">fsear@njit.edu</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/fe2e6d56-1a79-4e3a-8e07-c4e4f0b1abc0f96ab4bc-5e95-403c-8bbf-c34c546811c1.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/idcardphotosubmission",
    "name": "NJIT ID Card Photo Submission - For Fall 2023 incoming students only",
    "ShortName": null,
    "Summary": "For incoming first-year students, transfer students, and graduate students, your first NJIT Photo ID Card is free and can now be obtained remotely. \r\n\r\nIncoming students will submit their photo here, which will be used for their NJIT ID Card.",
    "Description": "<p>For incoming first-year students, transfer students, and graduate students, your first NJIT Photo ID Card is free and can now be obtained remotely.</p>\r\n<p>Incoming students will submit their photo here, which will be used for their NJIT ID Card.</p>\r\n<p><strong>IMPORTANT!! PLEASE READ:&nbsp; At this point all ID cards will be held for pick up at the NJIT Photo ID &amp; Parking Office (131 Summit St &ndash; Laurel Hall Extension). Please see our hours at this link:&nbsp;<a href=\"https://www.njit.edu/parking/2023-fall-semester-hours\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.njit.edu/parking/2023-fall-semester-hours&amp;source=gmail&amp;ust=1692814099160000&amp;usg=AOvVaw3Tk3SaoqTOfNSJEYI67HaU\">https://www.njit.edu/parking/<wbr />2023-fall-semester-hours</a>. If you are taking online classes or cannot make it in person during our hours, and would prefer your ID card mailed to you, please contact Mike Dabrowski asap at&nbsp;<a href=\"mailto:mikedab@njit.edu\" target=\"_blank\" rel=\"noopener\">mikedab@njit.edu</a>&nbsp;to request so and provide your mailing address. Thank you.</strong></p>\r\n<p>For current students, please email mikedab@njit.edu for ID card submissions and questions.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/fea2d557-31a2-4845-be64-662b74ea36e42dba92ca-6a35-471e-895c-fde3baf2271d.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/theatre",
    "name": "Theatre Arts & Technology Program",
    "ShortName": null,
    "Summary": "We are the joint theatre program of NJIT and Rutgers-Newark, which trains students in applied theatre education:  set, stage, light and sound design, playwriting, improvisational theatre techniques, music ensembles, directing, and performance.",
    "Description": "<p>We are the joint theatre program of NJIT and Rutgers-Newark, which trains students in applied theatre education: set, stage, light and sound design, playwriting, improvisational theatre techniques, music ensembles, directing, and performance.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/739fff8e-c829-4663-9f46-d7faa92665c0fdf523b4-79b4-44e2-bc88-b55abff3bbfc.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/team",
    "name": "Transition, Engagement, Access, & Mentorship (T.E.A.M.)",
    "ShortName": null,
    "Summary": "Transition, Engagement, Access, & Mentorship (T.E.A.M.) was developed to provide guidance and support for students with the overall goal of retention, persistence, and graduation. ",
    "Description": "<p>Transition, Engagement, Access, &amp; Mentorship (T.E.A.M.) was developed to provide guidance and support for students with the overall goal of retention, persistence, and graduation. This is realized through an affirming, learning-centered environment where students are equipped with information, motivation, and the agency needed to attain their academic and career goals.</p>\r\n<h4>T.E.A.M.&nbsp;Goals:</h4>\r\n<ul>\r\n<li>Connect students to resources internal and external to NJIT</li>\r\n<li>Improve Engagement/Involvement in the NJIT community</li>\r\n<li>Provide academic support and guidance</li>\r\n<li>Create opportunities for career exploration &amp; professional development</li>\r\n<li>Promote the holistic development and wellness of students</li>\r\n</ul>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f7d9890d-79e2-4ebe-b8fd-0cd6476e3ad387d9a41b-572c-40a1-aa25-ccdd8af894d6.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/masc",
    "name": "Material Advantage of NJIT, Student Chapter",
    "ShortName": "MASC",
    "Summary": "Material Advantage of NJIT, Student Chapter. We are a Student-Driven path to Materials Science Excellence. Join us and experience professional technical talks, unique networking opportunities, and meet fellow material scientists and engineers!",
    "Description": "<p><strong>Material Advantage of NJIT, Student Chapter.</strong></p>\r\n<p>We are a Student-Driven path to Materials Science Excellence. Join us and experience professional technical talks, unique networking opportunities, and meet fellow material scientists and engineers.</p>\r\n<p>&nbsp;</p>\r\n<p>Material Advantage Student Chapter at NJIT has a mission of dedication to the promotion of academic excellence, scholarship and professional development of undergraduate students. Being a member of Material Advantage NJIT provides students with amazing networking opportunities, enabling them to build a professional network with PHD students and working professionals before acquiring an undergraduate degree. Material Advantage NJIT also provides students memberships with four prestigious professional organizations which offers unlimited opportunities to expand their engineering knowledge base. Additionally, each of these four prestigious organizations provide Material Advantage NJIT members with real internship and career opportunities. Members are also provided with mentorship from professional engineers from four professional societies. The past activities of NJIT Material Advantage chapter provided students with technical talks and networking opportunities with professional engineers and faculty. Finally, professional plant Tours are organized each academic year.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a814e3f1-ce33-45fc-839f-70dc639d3d4dcd3486c9-0a68-4aac-b7f1-f054c3067d00.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ksa",
    "name": "Korean Student Association",
    "ShortName": null,
    "Summary": "Korean Student Association",
    "Description": "<p>Hello everyone! We are KSA, the Korean Student Association at NJIT. We are a cultural, student organization that fosters an inclusive environment for students passionate about Korean culture. We aim to provide a platform for students to share experiences, promote cultural appreciation, and celebrate traditions through diverse activities. KSA aims to unite undergraduate students and create a diverse and inclusive community at NJIT by emphasizing cultural awareness and acceptance.&nbsp; &nbsp;&nbsp;</p>\r\n<p>Join our discord!&nbsp;<a href=\"https://discord.gg/rSuyhdPg\"><span style=\"font-weight: 400;\">https://discord.gg/rSuyhdPg</span></a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/217a352a-4d2b-4941-8774-8799bb60e7b1066a9c11-8fa1-4503-9220-3266c4dfb174.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sigmapsikappa",
    "name": "Sigma Psi Kappa",
    "ShortName": null,
    "Summary": "Sigma Psi Kappa is a local social sorority founded in 1992 and based at the New Jersey Institute of Technology in Newark, NJ. ",
    "Description": "<div id=\"x_i4c-draggable-container\" style=\"width: 0px; height: 0px;\">\r\n<div class=\"x_resolved\">&nbsp;</div>\r\n</div>\r\n<div id=\"x_x_i4c-draggable-container\" style=\"width: 0px; height: 0px;\">\r\n<div class=\"x_x_resolved\">&nbsp;</div>\r\n</div>\r\n<div id=\"x_x_x_i4c-draggable-container\" style=\"width: 0px; height: 0px;\">\r\n<div class=\"x_x_x_resolved\">&nbsp;</div>\r\n</div>\r\n<div id=\"x_x_x_x_i4c-dialogs-container\">Sigma Psi Kappa is NJIT&rsquo;s only local social sorority founded and based at the New Jersey Institute of Technology in Newark, NJ. We have been on campus since 1992 and have since grown to the organization you see today. We are fully recognized by the University and have maintained this status since 1993.<br /><br />Out sisterhood is built upon the four main pillars of Greek Life: Scholarship, Service, Leadership, and Friendship. We also follow another set of 7 principles that guide us to be better sisters and above all, become better people.<br /><br />The philanthropies Sigma Psi Kappa are known for are: the American Heart Association, which we hold semesterly Blood Drives for on-campus, the second philanthropy that we dedicate our time to is the Kaleidoscope of Hope, a New Jersey-based organization who raises awareness for Ovarian Cancer.<br />Aside from our hard work at school and for the community, we are a social organization that prides ourselves on our motto &ldquo;Sisterhood by Friendship. We love spending time with each other, whether this is on out of state road trips or hanging out on a sister&rsquo;s couch with a bag of popcorn. Sigma Psi Kappa is full of unique, exciting, and diverse sisters from across the globe who found each other through the sisterhood.</div>\r\n<div id=\"x_x_x_i4c-dialogs-container\">&nbsp;</div>\r\n<div id=\"x_x_x_i4c-dialogs-container\">&nbsp;</div>\r\n<div id=\"x_x_i4c-dialogs-container\">&nbsp;</div>\r\n<div id=\"x_i4c-dialogs-container\">&nbsp;</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/a5a56bfc-2e93-446d-b7df-bafeac7fe95002f535f0-8fb1-4067-8050-b33f78385566.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/maps",
    "name": "Minority Association of Pre-Health Students",
    "ShortName": "MAPS",
    "Summary": "MAPS is an association dedicated to serving NJIT students who are interested in any health-related profession, including medicine, dentistry, pharmacy, veterinary, osteopathic medicine, ophthalmology, and others.",
    "Description": "<p>The&nbsp;Minority Association of Pre-Health Students is an association dedicated to serving New Jersey Institute of Technology students who are interested in any health-related profession; including medicine, dentistry, pharmacy, veterinary, osteopathic medicine, ophthalmology, and others. Our goal is to help make the professional health field more diverse by providing opportunities to students belonging to underrepresented groups in medicine. By providing information on admissions, shadowing, internships, scholarships, preparation in standardized exams and community service opportunities we hope to increase the number of minority students applying and getting accepted into professional health schools.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/13ae486d-3828-4cfe-a038-6e4e0cdacba0517d9c3c-c484-4f3f-9a24-4c89e3b0ac60.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/studentleadership",
    "name": "The Lisa A. Pierce Center for Leadership",
    "ShortName": null,
    "Summary": "The Lisa A. Pierce Center for Leadership was established in 2004 by the Student Senate, the Dean of Students, and the Vice President of Student Affairs as a resource for college student development. ",
    "Description": "<p><span class=\"x_x_x_OYPEnA x_x_x_text-decoration-none x_x_x_text-strikethrough-none\">The Lisa A. Pierce Center for Leadership is named after a NJIT staff member whose passion for Leadership Development has transcended past their tenure.</span></p>\r\n<p class=\"x_x_x_cvGsUA x_x_x_direction-ltr x_x_x_align-justify x_x_x_para-style-body\"><span class=\"x_x_x_OYPEnA x_x_x_text-decoration-none x_x_x_text-strikethrough-none\">Her strong desire to promote student leadership was exemplified when she created the Center for Leadership. Lisa brought energy and light to the room. She was fun, lighthearted, charismatic, and loved by many. When her colleagues created the \"Fun Committee,\", she was on board ready to plan parties, gatherings, and trips to watch local bands. While Lisa Ann Pierce may not be with us anymore, that same passion is what drives the Center forward.</span></p>\r\n<p class=\"x_x_x_cvGsUA x_x_x_direction-ltr x_x_x_align-justify x_x_x_para-style-body\"><span class=\"x_x_x_OYPEnA x_x_x_text-decoration-none x_x_x_text-strikethrough-none\">Follow us on Instagram: @lifeatnjit</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b3254e32-1d42-41b5-8c78-ea09b6d34f1433280c68-a64a-45cb-8fed-1de6630a8b95.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/minerva",
    "name": "The Minerva (NJIT Creative Writing Club)",
    "ShortName": "The Minerva",
    "Summary": "The Minerva is a community for students to creatively express themselves through writing, share personally written literature with like-minded individuals, and have a chance to publish their written works.",
    "Description": "<p>The Minerva is a community for students to creatively express themselves through writing, share personally written literature with like-minded individuals, and have a chance to publish their written works.</p>\r\n<p>Creative writing can not only serve as a way to unwind but a way to keep your mind active, be it by crafting stories, worlds, and narratives, or by letting poems spring forth from your mind. Within The Minerva, you will find many individuals who will not only help you along your journey of creation but appreciate and admire your work.</p>\r\n<p>On top of this, not only will students be able to publish their works in a yearly publication, but working hand in hand with The Vector, students can put their works in our college's own newspaper for all to see.</p>\r\n<p>Whether you're looking to spread your written word to students on campus and beyond, or looking for a quiet place to write in comfort, The Minerva is the place for you.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/e4743559-7ed5-400e-9d68-0a3a1fc00228144b2e1b-c91d-4e1b-abbd-ce4bd70345cc.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/mediczero",
    "name": "MedicZero",
    "ShortName": null,
    "Summary": "MedicZero",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/c-caps",
    "name": "Center for Counseling and Psychological Services",
    "ShortName": "C-CAPS",
    "Summary": "The NJIT Center for Counseling and Psychological Services (C-CAPS) is staffed by psychologists and professional counselors who are here to help students with the transitions and stresses of college life as well as with more serious psychological problems",
    "Description": "<p>Personal challenges such as stress, anxiety, depression, relationships and low self-esteem can impact academic and personal functioning.&nbsp;</p>\r\n<p><a href=\"https://www.njit.edu/counseling/sites/counseling/files/lcms/docs/whatiscounseling.doc\">Counseling</a>&nbsp;may help you to identify and explore available options, increase self-awareness and make realistic decisions about concerns that may be distracting you from achieving your personal and academic goals.&nbsp; Speaking with a professional can increase a students&rsquo; ability to achieve a sense of clarity and in turn regain a sense of empowerment to make decisions that feel right.&nbsp;</p>\r\n<p>C-CAPS provides a safe, non-judgmental and highly confidential environment where students can meet with a professional to discuss any discomfort or concerns they may have.&nbsp; For situations or conditions that require more comprehensive or longer-term services than the C-CAPS offers, we will assist students with referrals to off-campus providers.</p>\r\n<p>In addition to counseling, C-CAPS offers a number of other services.&nbsp; These include<a href=\"https://www.njit.edu/counseling/services/workshops.php\">&nbsp;workshops</a>&nbsp;on topics such as test anxiety, stress management, and assertiveness; CLEP tests for eligible students seeking credit by examination for certain core courses and pre-law information.</p>\r\n<h4><strong>Confidentiality Statement</strong></h4>\r\n<p>Confidentiality and trust are very important to the counseling process.&nbsp; Therefore, except as described below, the information disclosed during counseling and the identity of counseling clients&nbsp;<strong>will not&nbsp;</strong>be shared with anyone outside C-CAPS without the client&rsquo;s express (usually written) consent.&nbsp; This confidentiality extends to situation in which a client is referred to C-CAPS by a faculty member, administrator, or friend.</p>\r\n<p>However, exceptions to confidentiality may be necessary or be required by law when the C-CAPS professional believes there is risk of harm to yourself, other individual(s), or the university community; in cases of medical emergency; in situations involving probable child abuse; or other legal mandate.&nbsp; Should that occur, relevant information may be disclosed only to university personnel and/or others with responsibility for protecting safety or with legal jurisdiction.</p>\r\n<p>Situations involving exceptions to confidentiality occur infrequently.&nbsp; We encourage you to talk with a staff counselor or psychologist if you have concerns about this.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/soma",
    "name": "Society of Musical Arts",
    "ShortName": "SOMA",
    "Summary": "We are the student leaders of the Music Initiative. Focused on building the program and hosting music-based events (i.e. concerts, open mic nights, etc.). We welcome anyone who wants to perform, sing, or jam out, on and off campus.",
    "Description": "<p><span style=\"font-weight: 400;\">The Society of Musical Arts (SOMA) is the musical presence in NJIT. The organization is home to three instrumental ensembles, and a plethora of student run independent groups and bands that perform for events around campus and off campus. These events range from athletic events for the campus&rsquo; sports teams to scholarship luncheons. Our main goal is to spread the opportunity to perform music and to give the students of this campus a stress-relieving and hospitable environment and ample resources to do so.</span></p>\r\n<p>To chat, get updates on our events, or ask any questions, <a href=\"https://discord.gg/6TA3aZVE6H\"><span style=\"font-weight: 400;\">join our Discord!</span></a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/355d70af-7e52-4a23-bd47-e6308cc7c099a1646b06-733e-4a34-a90c-39e2ff660c62.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/shpe",
    "name": "Society of Hispanic Professional Engineers",
    "ShortName": "SHPE",
    "Summary": "The Society of Hispanic Professional Engineers (SHPE) changes lives by empowering the NJIT community to realize their fullest potential and impacts the world through STEM awareness, access, support, and development.",
    "Description": "<p>SHPE Holds professional events throughout the semesters to help students grow professionally and prepare them for the corporate world.</p>\r\n<p>SHPE also focus on maintaining a family bond with members to provide a support system through their journey in college.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/c373e648-6bcc-4784-bf10-2869295e0fbdbd9ee883-6e19-49cc-ad35-6c33fed45dcc.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/haccs",
    "name": "Hispanic Association of Computing College Students",
    "ShortName": "HACCS",
    "Summary": "The Hispanic Association of Computing College Students (HACCS) aims to support Hispanic/Latinx students in computing majors.",
    "Description": "<p><strong>Hello! Bienvenidos!</strong></p>\r\n<p>HACCS is committed to cultivating a strong community, encouraging cultural awareness, and providing resources to empower members as they pursue successful careers in computing. We also facilitate professional development opportunities for members.</p>\r\n<p>&nbsp;</p>\r\n<p>We strive to enhance the college experience and professional development of Hispanic/Latine students at the Ying Wu College of Computing (YWCC). Yet, <em>all</em> NJIT students interested are welcome to stop by!</p>\r\n<p>&nbsp;</p>\r\n<p>You can join our <strong>Discord</strong> <a href=\"https://discord.gg/2SnC6xsqAZ\" target=\"_blank\" rel=\"noopener\"> here</a>.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/bb2e006d-d4e9-4066-a23c-cb82dce21c0c9ee0755b-911c-48bc-9f99-830a71718ce6.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ifc",
    "name": "Interfraternity Council",
    "ShortName": "IFC",
    "Summary": "Governing council for our NIC fraternities on campus.",
    "Description": "<p>The Interfraternity Council is a coalition of NJIT's fraternities for the sake of governing our Fraternities.&nbsp;</p>\r\n<p>INTERFRATERNITY COUNCIL ORGANIZATIONS:</p>\r\n<p>Alpha Sigma Phi</p>\r\n<p><em>Phi Delta Theta coming Spring 2024</em></p>\r\n<p>Phi Sigma Kappa</p>\r\n<p>Pi Kappa Phi</p>\r\n<p>Psi Upsilon</p>\r\n<p>Sigma Alpha Epsilon</p>\r\n<p>Sigma Pi</p>\r\n<p>Tau Delta Phi</p>\r\n<p>Tau Kappa Epsilon</p>\r\n<p>Theta Chi</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0b1126aa-486b-4ace-a281-8e6e6ab7bd4b35129963-13a0-40bd-87be-896c1ea701e9.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ooo",
    "name": "Order of Omega",
    "ShortName": "OOO",
    "Summary": "Organization comprised of Greek students who have above the average Greek GPA. We select members based on an application process and are allowed to accept 15 members a year. Plan study sessions and other events throughout the year.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/b4f9aca1-ab5d-43f3-a84f-4d77095afdf5a35dca71-63ec-47ee-bdbd-ebc1818fc646.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/cheer",
    "name": "Cheerleaders",
    "ShortName": null,
    "Summary": "Cheerleaders",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitoxe",
    "name": "Omega Chi Epsilon",
    "ShortName": "OXE",
    "Summary": "OXE is the Chemical Engineering Honor Society. The society promotes high scholarship and recognizes the valuable traits of investigation, service, comradeship, and professionalism.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/f438fc25-a36a-4aaf-a03a-a2c71d42c25bf8d1ff73-a32c-4c3a-b6d8-e7442f151db4.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/gigabeats",
    "name": "GigaBeats",
    "ShortName": null,
    "Summary": "NJIT Gigabeats is an vocal musical group which performs mainly pop music in order to enrich NJIT's musical program and the programs of various other schools.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/466605fe-a324-4732-85a7-0c2c0230fbe47b00b423-9327-4c23-96e1-5cf838ad4e76.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/vsa",
    "name": "Vietnamese Student Association",
    "ShortName": "VSA",
    "Summary": "Vietnamese Student Association",
    "Description": "<p>Established in 2024, we are a community of students who share an interest in Vietnamese culture, traditions, and language. Our goal is to promote cultural awareness and appreciation, as well as to foster a community for Vietnamese students and any other students interested in Vietnamese culture.</p>\r\n<p>Whether you are Vietnamese or simply interested in learning more about the culture, we welcome you to join us. As a member of our club, you will have the opportunity to participate in a variety of events and activities, including: creating art, cooking traditional Vietnamese foods, fundraisers, cultural holidays, guest speaker events and much more!<br /><br />Be sure to join our discord!&nbsp;https://discord.gg/YseZsnCpk6</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/15995f96-8936-41ae-989a-dda1ea8cb7c651a7901c-8129-488f-af09-30a0da4d9f8d.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/nrc",
    "name": "Robotics Club",
    "ShortName": "NRC",
    "Summary": "The NJIT Robotics Club is a student-run group of highly motivated students who share a common passion for the field of robotics. This diverse group brings together a wide variety of skills to design, build, program, and test robots. Also host to VEX U.",
    "Description": "<p>Join Our Discord: <a title=\"https://njit.gg/robotics\" href=\"https://njit.gg/robotics\"><span style=\"margin: 0px; padding: 0px; border: 0px; font-weight: inherit; font-style: inherit; font-family: inherit; font-size: 16px; vertical-align: baseline; outline: 0px;\"><a href=\"https://njit.gg/robotics\">njit.gg/robotics</a></span></a> <br /><br /><br />The NJIT Robotics Club is a student-run group of highly motivated students who share a common passion for the field of robotics. With majors ranging from mechanical engineering to computer science, this diverse group brings together a wide variety of skills to design, build, program, and test robots. The robotics club is also host to our award winning VexU robotics team.</p>\r\n<p>The Robotics Club is the ideal place for any level of robotics enthusiast to learn new skills and apply their skills in novel and challenging environments. Any student can become a Project Manager and lead a project of their own. Alternatively, they can join an existing project they like and learn new skills or apply what they already know. In addition to team building and project management, which is at the core of any successful endeavor, we utilize a number of technical skills. For designing robots, some popular choices are Autodesk Inventor and Fusion 360 because they are provided free to students. But we also provide training and support for many other programs such as AutoCAD, Solidworks, and Creo Parametric. Additionally, we believe that the best way to learn is by doing, which is why we support many avenues to prototyping, including free 3D printing for all members and strong connections with the Makerspace. In addition to the mechanical aspect of robotics, programming is a key component to a successful robot. Some of the common programming languages that we teach and use in projects are C/C++, Python, VBA, Shell Script, and more. <br /><br />For more details, please see our Club Discord: <a href=\"https://njit.gg/robotics\">njit.gg/robotics</a><br /><br />Club Public Google Drive (Find useful documents here!): <a href=\"https://njit.gg/robotics-docs\"> njit.gg/robotics-docs</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/f1a5ec3c-fa14-4c90-b732-85f24cb773409c4ca400-a205-4576-b79d-ca3ae3ca5350.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/wics",
    "name": "Women in Computing Society",
    "ShortName": "WiCS",
    "Summary": "NJIT Undergraduate Women in Computing Society (WiCS) promotes and supports NJIT's growing community of women studying in the fields of computing and technology.\r\n",
    "Description": "<p>✨ Welcome to the <strong>NJIT Undergraduate Women in Computing Society (WiCS)</strong>, dedicated to fostering a vibrant community of women pursuing studies in computing and technology at NJIT. WiCS offers a range of opportunities for members to enhance their skills, connect with industry professionals, and contribute to our community. ✨</p>\r\n<p>&nbsp;</p>\r\n<p>✨ As a member of WiCS, you'll have access to student and company-led workshops, informative sessions, and office tours hosted by leading tech companies, exhilarating hackathons (<strong>GirlHacks</strong>), networking events at national conferences (Grace Hopper Celebration), and opportunities for community service. ✨</p>\r\n<p><br />🚀 Stay informed about our upcoming events and meetings by <a href=\"https://forms.gle/EcURPeYesSpQW4Ew6\"> joining our mailing list</a>!</p>\r\n<p>🚀 Connect with fellow WiCS members and stay up-to-date on all the latest news and events by joining our <a href=\"https://discord.gg/pY2C7NXqcf\">Discord server</a>!</p>\r\n<p>🚀 Follow and Interact with us on <a href=\"https://www.instagram.com/wicsnjit/\"> Instagram</a> and <a href=\"https://www.linkedin.com/company/wicsnjit/\">Linkedin</a>! Feel free to tag us!</p>\r\n<p>&nbsp;</p>\r\n<p>Join us in shaping the future of computing and technology, and let's thrive together in this exciting field!</p>\r\n<div id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_block-075998a59b9153804ee0\" class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_sqs-block x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_html-block x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_sqs-block-html\">\r\n<div id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_yui_3_17_2_1_1614022786002_149\" class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_sqs-block-content\">\r\n<h3>&nbsp;</h3>\r\n<h3 id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_yui_3_17_2_1_1614022786002_163\"><strong id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_yui_3_17_2_1_1614022786002_162\">New E-Board Position Available - Technical Director! Join our Team! <a href=\"http://bit.ly/wics-tech-director\">http://bit.ly/wics-tech-director</a></strong></h3>\r\n</div>\r\n</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/58ddacee-ffec-4504-963b-b50457b3ec744c26d7f9-80ad-42be-9517-a661606954fb.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/badminton",
    "name": "Badminton Club",
    "ShortName": null,
    "Summary": "We are a club comprised of both old and new players who look for good games to play and enjoy either casual or competitive badminton. We wish to provide a place without regard for weather, the need to drag equipment around, or to commit. Just have fun!",
    "Description": "<p>We are a club that offers a welcoming space to badminton players of all skill levels. We hope to guide new players and brush off the rust with veteran players with our weekly sessions. If you would like to keep up to date with information regarding our club, you can join us at <a href=\"https://discord.gg/3GdHT5ruMp\">https://discord.gg/3GdHT5ruMp.</a></p>\r\n<p>Meetings are held at the Naimoli Tennis Courts</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/0f853a00-67ab-476a-a121-aa55fff53e285b2655b4-df51-4054-a00c-11b377a9a272.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/conferenceservices",
    "name": "Strategic Events & Conferencing Services",
    "ShortName": null,
    "Summary": "Strategic Events and Conference Services offers several types of event and meeting spaces at NJIT.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/543a3630-6daa-43a3-b8ea-4a58c091409954579cb8-d83c-4fc2-880a-872dc4a13a77.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/hs",
    "name": "Albert Dorman Honors College",
    "ShortName": null,
    "Summary": "Honors Scholars map their future through Honors courses, colloquia, study tours, research experiences, service learning, dual degree and study abroad programs, a variety of accelerated degree partnerships, and internships.",
    "Description": "<p style=\"margin-bottom: .25in;\"><span style=\"font-family: 'Arial',sans-serif; color: black;\">The Albert Dorman Colloquium Series focuses on the interface between Science, Technology and Society. Colloquia normally meet during university common hours 10-15 times each semester. They feature talks by - and conversations with - industry, academic, and government leaders on a wide range of topics. Field trips to corporate, scientific, cultural, and community organizations are also included. In addition, some important campus political and cultural events are co-sponsored by the Honors College and regarded as part of the Colloquium Series.</span></p>\r\n<p style=\"margin-bottom: .25in;\"><span style=\"font-family: 'Arial',sans-serif; color: black;\">Honors students must attend at least 2 colloquia each semester and are strongly encouraged to attend more than the required amount.&nbsp;</span></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/967a905a-f013-4599-bd94-cfbad02db21719e90a8a-67d6-49d5-ac7a-1734854d5e26.jpg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/oslstudentemployees",
    "name": "OSL Student Employees",
    "ShortName": "OSL Student Employees",
    "Summary": "This group is for current student employees of the Office of Student Life",
    "Description": "<p>This group is for current student employees of the Office of Student Life</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/null"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ost",
    "name": "Office of Student Transition",
    "ShortName": "OST",
    "Summary": "The Office of Student Transition (OST) is committed to providing all the information and resources you need to transition smoothly to NJIT and be academically successful.",
    "Description": "<p>The Office of Student Transition (OST) is committed to providing all the information and resources you need to transition smoothly to NJIT and be academically successful. We pride ourselves on creating a warm and friendly environment where you can feel comfortable to ask all the questions you have. We promise to guide you through your first-year student journey!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/d5325063-21bf-4d7f-a05b-7eb160b0e7bfbdd16210-b782-45ae-b605-f5ba597d1d48.PNG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/caribso",
    "name": "Caribbean Students Organization",
    "ShortName": "CaribSO",
    "Summary": "The Caribbean Student Organization (CaribSO) is a cultural and social organization with the goal of unifying the Caribbean community on campus by way of music, dance, and social events.",
    "Description": "<p>CaribSO's mission is to implement a Caribbean experience through knowledge, food, song, and dance; to educate students on Caribbean history and culture; to bring people of different backgrounds together while enjoying what each other have to offer; and to contribute to the diversity and culture of NJIT's campus.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4ea5e564-c747-40a8-96d2-f3b1644d187436f65643-5e88-4ec0-835c-f3575b1d1a6f.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/tikkunolammakers",
    "name": "Tikkun Olam Makers",
    "ShortName": null,
    "Summary": "Tikkun Olam Makers (TOM) NJIT is a community of Makers at NJIT working to create affordable and accessible technology to under-represented communities and individuals.",
    "Description": "<p>Tikkun Olam Makers (TOM) NJIT is an organization dedicated to bringing together a community of students at NJIT that work towards helping create affordable and accessible technologies to those in need. We frequently work with local and external organizations on build parties, workshops, and projects for our members and partner organizations to attend and enjoy. Please visit our Instagram and website profile linked below for more information or&nbsp;https://tomglobal.org/home for more information on TOM Global as an organization!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/bd9121a0-b636-4e8a-9512-5607bd9758857683b948-769a-453a-b9e7-fece23237468.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitarchery",
    "name": "Archery Club",
    "ShortName": null,
    "Summary": "We strive to provide a safe, accessible, and fun opportunity for all students to enjoy and explore the sport of archery.",
    "Description": "<p>At the NJIT Archery Club,&nbsp;our mission is to strive to provide a safe, accessible, and fun opportunity for all students to enjoy and explore the sport of archery.<br /><br />If that sounds like something you would be interested in, come to one of the events or meetings we host, or head down to one of our practices at the range with other members.</p>\r\n<p>&nbsp;</p>\r\n<p>Our <strong>Practice Schedule</strong> for the <span style=\"text-decoration: underline;\"> Spring 2024</span>&nbsp;semester is:&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Wednesday: 12:00pm-2:00pm<br />Thursday: 1:00pm-3:30pm<br />Friday: 12:00pm-3:30pm<br />Sunday: 1:00pm-4:00pm</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Location/ Directions:&nbsp;</strong>We will be meeting in the Group Fitness room. The room is the first room on the left when you enter the WEC (Wellness and Events Center) through the entrance by Tiernan Hall.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Items/ Equipment:</strong> None Needed! The club will provide archery equipment(bows, arrows, protective gear) to every member.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>The <strong>General Body Meetings</strong> are on an&nbsp;<span style=\"text-decoration: underline;\">As-Needed Basis</span></p>\r\n<p>The most up-to-date information along with any practice cancellations can be found on our discord server.</p>\r\n<p><strong>Discord Server:&nbsp;</strong><a href=\"https://njit.gg/archery\">https://njit.gg/archery</a><strong><br /><br /></strong></p>\r\n<p>Hope to see you at practice soon!</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/eeb80045-9c78-48c1-afec-a20d7726897a7bd1a1a1-53af-41d4-9b00-e9f827f160fd.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/bsu",
    "name": "Black Student Union",
    "ShortName": "BSU",
    "Summary": "Black Student Union aka BSU creates an intersectional space for students of all backgrounds and personalities to engage, flourish and celebrate Black culture as a community and a found family.",
    "Description": "<p>At the Black Student Union (BSU), our purpose is to create a vibrant community that celebrates African American culture and heritage. We believe in the power of diversity, bringing together individuals from various backgrounds to learn, connect, and thrive.&nbsp;we curate a rich tapestry of events, workshops, and discussions that illuminate African American history, art, and cultural traditions. Through educational initiatives, we delve into our shared heritage, fostering a deeper understanding and promoting cultural exchange.</p>\r\n<p>As passionate advocates, we amplify the voices of black students on campus, addressing their concerns and navigating challenges. Our dialogue extends beyond our union&mdash;we collaborate with fellow student organizations, actively championing racial equity and social justice. BSU is a breeding ground for empowered leaders. We believe that leadership drives positive change. Within our safe haven, black students express themselves freely, find unwavering support, and forge lasting connections.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/4305f2f9-80f7-4249-9074-97c8af7bbf7b4187ef76-3081-4287-98a9-87524a80cfed.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/firstlovenjit",
    "name": "First Love NJIT",
    "ShortName": null,
    "Summary": "We are an organization that aims to benefit the NJIT community by helping members understand Christianity , as well as use their gifts and talents through our Creative Art Groups. Enjoy the Film Stars, Dancing Stars, Rap Stars and Choirs.",
    "Description": null,
    "pfp": "https://se-images.campuslabs.com/clink/images/ec660c60-c21f-403b-b663-d8fcb57a4de891f54c24-2461-40b3-9ee5-16d5e705ed23.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/habitatforhumanity",
    "name": "Habitat for Humanity",
    "ShortName": "H4H",
    "Summary": "NJIT Habitat for Humanity works to provide volunteers to help build affordable housing for people in need, allowing for students at NJIT to participate in the Newark community and beyond.",
    "Description": "<p>Habitat for Humanity is an international organization that helps organize, design, and construct affordable housing for people in need. At NJIT Habitat for Humanity, our main purpose is to send students to build sites, primarily with Habitat for Humanity of Greater Newark, to volunteer their time in <strong>construction and building tasks.</strong> Some of these tasks include painting walls, nailing down floor boards, sanding wood, etc. <strong>There is no experience necessary</strong> to attend our build sites, as there are always&nbsp;contractors or officials on site and safety equipment&nbsp;provided! It is an amazing experience to physically help people in need, and also a great opportunity for&nbsp;<strong>external volunteering hours</strong> for those who may need them. We also do lots of fundraisers and events for volunteers!<br /><br />Feel free to join our Discord to keep in touch, follow our Instagram account (@njit_habitat4humanity), and welcome to the club!<br /><br /><br /><a href=\"https://discord.gg/G6bYWzcY6v\">Join our Discord here!</a></p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/52a4426a-7354-498f-a21b-e25309e1da5477e6132e-ae7c-4e84-8a86-3002a2cfd180.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/laurelhallcouncil",
    "name": "Laurel Hall Council",
    "ShortName": "Laurel Hall Council",
    "Summary": "The governing body for the residents of Laurel Hall.",
    "Description": "<p>The governing body for the residents of Laurel Hall</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/23c99c75-1b87-44b3-a206-3494651640cf78ae9300-48d8-4917-b95e-7975a24b58a2.JPG"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/ast",
    "name": "Alpha Sigma Tau",
    "ShortName": "AST",
    "Summary": "The Alpha Sigma Tau sorority mission is to invest in women by instilling the skills necessary to navigate life and inspire members to enrich their own lives and the lives of others.",
    "Description": "<p>The Beta Upsilon chapter of Alpha Sigma Tau was founded on April 30, 1983 at New Jersey Institute of Technology. Today, we have 40+ sisters who are dedicated to upholding the values and ideals of its founders.&nbsp;</p>\r\n<p>Over the years, the Beta Upsilon Chapter has earned numerous awards, including Excellence in Community Relations at the Greek/Highlander Awards and the Top Fundraising Sorority for our Dance Marathon, HighlanderThon.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/b4157176-a300-4627-87bb-bbc79f64fc6ce68da97b-0605-4e09-be20-cd779d3d7b30.jpeg"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/fsl",
    "name": "Fraternity and Sorority Life",
    "ShortName": "OFSL",
    "Summary": "Welcome to the Fraternity and Sorority Life Homepage!  If you are interested in one of our fraternal organizations or are already in one please check out this page! ",
    "Description": "<p>Fraternity and Sorority Life at NJIT has been ingrained in the community for 100 years.&nbsp; We strive to develop our students into leaders, community servants, philanthropic minds, and instill a brotherhood or sisterhood to last a lifetime.</p>\r\n<p>Interested in joining in one of our organizations?</p>\r\n<p>Below is a list of our recognized chapters and our banned organizations.&nbsp; <br />*denotes culturally based social fraternities and sororities</p>\r\n<p style=\"text-align: left;\"><span style=\"text-decoration: underline;\"><strong>Fraternities</strong></span></p>\r\n<p><a href=\"https://njit.campuslabs.com/engage/organization/alpha_sig\">Alpha Sigma Phi</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/depsi\">Delta Epsilon Psi</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/upsilons\">Lambda Sigma Upsilon</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/psk\">Phi Sigma Kappa</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/pikappaphi\">Pi Kappa Phi</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/psiupsilon\">Psi Upsilon</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/sae\">Sigma Alpha Epsilon</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/sigrho\">Sigma Beta Rho</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/sigmapi\">Sigma Pi</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/tau-delt\">Tau Delta Phi</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/tke\">Tau Kappa Epsilon</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/thetachi\">Theta Chi</a></p>\r\n<p><strong><span style=\"text-decoration: underline;\">Sororities<br /></span></strong><a href=\"https://njit.campuslabs.com/engage/organization/ast\">Alpha Sigma Tau</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/dphie\">Delta Phi Epsilon</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/deltasigmatheta\">Delta Sigma Theta</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/kphig\">Kappa Phi Gamma</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/lto\">Lambda Tau Omega</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/omegaphichi\">Omega Phi Chi</a>*<br /><a href=\"https://njit.campuslabs.com/engage/organization/sigmapsikappa\">Sigma Psi Kappa</a></p>\r\n<p><span style=\"text-decoration: underline;\"><strong>Professional Co-ed Fraternities</strong></span><br /><a href=\"https://njit.campuslabs.com/engage/organization/akpsi\">Alpha Kappa Psi</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/apo\">Alpha Phi Omega</a><br /><a href=\"https://njit.campuslabs.com/engage/organization/apx\">Alpha Rho Chi</a></p>\r\n<p><span style=\"text-decoration: underline;\"><strong>Banned Organizations<br /><br /></strong></span>Alpha Phi Delta (APD)<br />Iota Kappa Phi (IKPhi)<br />Kappa Xi Kappa (KXK)</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/810e55cc-4e98-4da2-9ed1-751a843b7b7f63630763-a67e-4e57-922a-d13ba812f7ab.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/deltasigmatheta",
    "name": "Delta Sigma Theta Sorority Inc. - Delta Zeta Chapter",
    "ShortName": null,
    "Summary": "Delta Sigma Theta Sorority Incorporated was founded on January 13, 1913, on the campus of Howard University by 22 illustrious women. The organization was established to promote sisterhood,  academic excellence, and public service.",
    "Description": "<p>We are the Delta Zeta Chapter of Delta Sigma Theta Sorority Incorporated. Delta Zeta was charted on May 26, 1950, the first undergraduate chapter to be charted in the state of New Jersey.&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/574f2b9e-0f81-4cf1-9102-8aca25d34b5831dbfcad-bf78-479a-ba19-6cd96ebdebf2.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/njitsac",
    "name": "Student Activities Council",
    "ShortName": "SAC",
    "Summary": "The Student Activities Council provides recreational and social activities for NJIT students and other members of the NJIT community. ",
    "Description": "<div id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_comp-jlcxnrld\" class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_style-jlcxnrm2\" title=\"\">\r\n<p>The Student Activities Council can be summed up in one statement: Less stress, More FUN! We are a group of fun-loving and ambitious students who desire to make an impact at NJIT. We do this by planning and hosting engaging experiences throughout the semester, aimed at bringing the campus community together.</p>\r\n<p>&nbsp;</p>\r\n<p>Interested in creating new experiences for the campus community? We are always looking for people to join our team and help us make a difference at NJIT. With your help, we can make your vision a reality. Email <strong>sac@njit.edu</strong> if you are interested. Or stop by our office, located at the <strong>Campus Center, Room 476</strong>. We look forward to hearing from you!</p>\r\n<p>&nbsp;</p>\r\n<p style=\"text-align: center;\">&nbsp;&nbsp;&nbsp;<strong>&nbsp;&nbsp; <u>Our Values:</u></strong></p>\r\n<ul>\r\n<li><span style=\"text-decoration: underline;\"><strong>Students:</strong> </span>We offer opportunities for students to relax and cope with the stress of college.</li>\r\n<li><span style=\"text-decoration: underline;\"><strong>Feedback:</strong></span> We want to hear what students have to say about us, good or bad.</li>\r\n<li><span style=\"text-decoration: underline;\"><strong>Innovation:</strong></span> We push the boundaries of what we do, always trying to find the next big event.</li>\r\n<li><span style=\"text-decoration: underline;\"><strong>Collaboration:</strong></span> We partner with other campus organizations to produce high-quality events for all.</li>\r\n</ul>\r\n</div>",
    "pfp": "https://se-images.campuslabs.com/clink/images/172f7d26-8a58-4983-bf5f-8fd759063faa7e94eb2d-6385-46ac-95ff-231abb56a677.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/bc",
    "name": "Billiards Club",
    "ShortName": "BC",
    "Summary": "Cueing sports such as 8 Ball, 9 Ball, straight pool, Snooker, and a variety of others are built upon what you can learn here as a part of the NJIT Billiards Club. \r\n",
    "Description": "<p>We aim to teach the skills in a once again rising sport such as billiards through suspenseful games and thrilling competitions held in the Campus Center game room and occasionally at other pool halls in the area. Build on your shot taking, learn some cool tricks, and have a great time.</p>\r\n<p>Come and try it out!!</p>\r\n<p>Thursdays from 8:30pm in the Game Room</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/1f5d6adf-9d16-4ac9-847a-b77a186a4407ce076b33-38fc-4458-b5ce-500474e9719a.png"
  },
  {
    "website": "https://njit.campuslabs.com/engage/organization/sae",
    "name": "Sigma Alpha Epsilon",
    "ShortName": "SAE",
    "Summary": "Sigma Alpha Epsilon",
    "Description": "<p>The Fraternity&rsquo;s mission is advancing the highest standards of friendship, scholarship, leadership and service for our members throughout life.</p>",
    "pfp": "https://se-images.campuslabs.com/clink/images/90ca22de-c499-49a1-8d64-36493bac0832be121aa2-1fbe-433d-852c-216e3ed11303.jpg"
  }
]
